{
  "CONTENT": {
    "ACCOUNT_DELETION": {
      "CONTENT": "Можете да поискате изтриване на вашия акаунт по всяко време, като отидете на този адрес (след като влезете) и щракнете върху бутона „Изтриване на моя акаунт“ настройките на вашият профил.",
      "TITLE": "Изтриване на акаунт"
    },
    "CHANGES_TO_OUR_PRIVACY_POLICY": {
      "CONTENT": "Ако решим да променим нашата политика за поверителност, ще публикуваме тези промени на тази страница.\nТози документ е под лиценз [CC-BY-SA](https://creativecommons.org/licenses/by-sa/4.0/). Първоначално адаптиран от политиката за поверителност на [Discourse](https://github.com/discourse/discourse).",
      "TITLE": "Промени в нашата Политика за поверителност"
    },
    "DATA_COLLECTED": {
      "CONTENT": "Събира се следната информация:\n- Информация за акаунта (потребителско име, имейл адрес и парола). Можете също да въведете допълнителна информация за профила, като собствено име, фамилия, дата на раждане, местоположение, биография и да качите профилна снимка.\n- [GPX](https://en.wikipedia.org/wiki/GPS_Exchange_Format) файлове. Тези файлове съдържат данни, свързани с вашите дейности (географски координати, дата, разстояние, продължителност, максимална и средна скорост, надморска височина, заглавие, описание, пулс...). Ако не искате да излагате някои данни, изчистете ги преди качване или добавете тренировки без GPX файлове.\n- Данни за тренировка (спорт, заглавие, описание, дата, продължителност, разстояние, изкачване, спускане, бележки).\n- Followers and following users.\n- Comments and likes.\n- Техническа информация (име на браузъра и операционна система).",
      "TITLE": "Каква информация събираме?"
    },
    "INFORMATION_DISCLOSURE": {
      "CONTENT": "Ние не продаваме, търгуваме или по друг начин прехвърляме на външни страни вашата лична информация.\nТова не включва доверени трети страни, които ни помагат при работата с нашия сайт и обслужването ви, стига тези страни да се съгласят да пазят тази информация поверителна.\nМоже също така да предоставим информацията ви, когато смятаме, че освобождаването е подходящо за спазване на закона, прилагане на правилата на сайта ни или защита на нашите или на други права, собственост или безопасност.\nКогато упълномощите приложение на трета страна да използва вашия акаунт, в зависимост от обхвата на разрешенията, които одобрявате, то може да има достъп до информацията от вашия профил или вашите тренировки. Приложенията никога нямат достъп до вашата парола.",
      "TITLE": "Разкриваме ли информация на външни лица?"
    },
    "INFORMATION_PROTECTION": {
      "CONTENT": "Ние прилагаме различни мерки за сигурност, за да поддържаме безопасността на вашата лична информация, когато въвеждате, изпращате или осъществявате достъп до вашата лична информация.",
      "TITLE": "Как защитаваме вашата информация?"
    },
    "INFORMATION_USAGE": {
      "CONTENT": "Всяка информация, която събираме от вас, може да се използва за предоставяне на основната функционалност на **FitTrackee**:\n- GPX файловете се използват за създаване на тренировки, показване на следи на карта (с [OpenStreetMap](https://www.openstreetmap.org) и конфигурирания сървър за плочки) и диаграми, генериране на миниатюри на карти, изчисляване на записи и получаване на данни за времето (ако е зададен доставчик на времето).\n- Depending on the visibility level set on workouts and comments (public, followers only, private and mentioned users), other users can see and interact with them. **Please keep in mind that the server operating team or the moderation team may view content with restricted visibility.**\nYou can follow other people to view activities on your timeline. Interaction requires the user to log in.\n- All profile information is not displayed publicly, except username, role, registration date, number of followers and following users, suspension if set and number of workouts.\n- Предоставеният от вас имейл адрес може да се използва за изпращане на информация или за потвърждаване на промените в акаунта ви.",
      "TITLE": "За какво използваме вашата информация?"
    },
    "SITE_USAGE_BY_CHILDREN": {
      "CONTENT": "Ако този сървър е в ЕС или ЕИП: Нашият сайт и услуги са насочени към хора, които са навършили 16 години. Ако сте на възраст под 16 години, съгласно изискванията на [GDPR](https://en.wikipedia.org/wiki/General_Data_Protection_Regulation) (Общ регламент за защита на данните) не използвайте този сайт.\nАко този сървър е в САЩ: Нашият сайт, продукти и услуги са насочени към хора на възраст от поне 13 години. Ако сте на възраст под 13 години, съгласно изискванията на [COPPA](https://en.wikipedia.org/wiki/Children%27s_Online_Privacy_Protection_Act) (Закон за защита на личната информация на децата онлайн) не използвайте този сайт.\nЗаконовите изисквания могат да бъдат различни, ако този сървър е в друга юрисдикция.",
      "TITLE": "Използване на сайта от деца"
    },
    "YOUR_CONSENT": {
      "CONTENT": "Чрез използване на нашия сайт, вие се съгласявате с нашата политика за поверителност.",
      "TITLE": "Вашето съгласие"
    }
  },
  "LAST_UPDATE": "Последна актуализация",
  "TITLE": "политика за поверителност"
}
