{
  "CONTENT": {
    "ACCOUNT_DELETION": {
      "CONTENT": "Puoi richiedere la cancellazione del tuo account in qualsiasi momento andando a questo indirizzo (dopo aver effettuato l'accesso) e cliccando sul pulsante \"Elimina il mio account\" nella sezione modifica account.",
      "TITLE": "Eliminazione dell'account"
    },
    "CHANGES_TO_OUR_PRIVACY_POLICY": {
      "CONTENT": "Se decidiamo di modificare la nostra politica sulla privacy, pubblicheremo tali modifiche su questa pagina.\nQuesto documento è sotto licenza [CC-BY-SA](https://creativecommons.org/licenses/by-sa/4.0/) . Originariamente adattato dalla politica sulla privacy di [Discourse](https://github.com/discourse/discourse).",
      "TITLE": "Modifiche alla nostra Politica sulla Privacy"
    },
    "DATA_COLLECTED": {
      "CONTENT": "Vengono raccolte le seguenti informazioni:\n- Informazioni sull'account (nome utente, indirizzo e-mail e password). È inoltre possibile inserire informazioni aggiuntive sul profilo come nome, cognome, data di nascita, posizione, biografia e caricare un'immagine del profilo.\n- File [GPX](https://en.wikipedia.org/wiki/GPS_Exchange_Format). Questi file contengono dati relativi alle tue attività (coordinate geografiche, data, distanza, durata, velocità massima e media, altitudine, titolo, descrizione, frequenza cardiaca…). Se non desideri esporre alcuni dati, puliscili prima di caricarli o aggiungi allenamenti senza file GPX.\n- Dati degli allenamenti (sport, titolo, descrizione, data, durata, distanza, dislivello in salita, dislivello in discesa, note).\n- Followers and following users.\n- Comments and likes.\n- Informazioni tecniche (nome del browser e sistema operativo).",
      "TITLE": "Quali informazioni raccogliamo?"
    },
    "INFORMATION_DISCLOSURE": {
      "CONTENT": "Non vendiamo, scambiamo o trasferiamo in alcun modo a terzi le tue informazioni personali identificabili.\nCiò non include terze parti di fiducia che ci aiutano a gestire il nostro sito e a fornirti assistenza, purché tali parti accettino di mantenere riservate queste informazioni.\nPotremmo inoltre divulgare le tue informazioni quando riteniamo che la divulgazione sia appropriata per ottemperare alla legge, far rispettare le politiche del nostro sito o proteggere i nostri diritti, la nostra proprietà o la nostra sicurezza.\nQuando autorizzi un'applicazione di terze parti a utilizzare il tuo account, a seconda dello scopo delle autorizzazioni che approvi, potrebbe accedere alle informazioni del tuo profilo o ai tuoi allenamenti. Le applicazioni non possono mai accedere alla tua password.",
      "TITLE": "Divulghiamo informazioni a terze parti esterne?"
    },
    "INFORMATION_PROTECTION": {
      "CONTENT": "Implementiamo una varietà di misure di sicurezza per mantenere la sicurezza delle tue informazioni personali quando inserisci, invii o accedi alle tue informazioni personali.",
      "TITLE": "Come proteggiamo le tue informazioni?"
    },
    "INFORMATION_USAGE": {
      "CONTENT": "Ogni informazione che raccogliamo su di te può essere usata per fornire le funzionalità fondamentali di **FitTrackee**:\n- I file GPX sono usati per creare i workout, mostrare le traccie sulla mappa (con [OpenStreetMap](https://www.openstreetmap.org) and il tile server configurato) e grafici, generare le anteprime delle mappe, calcolare record e ottenere dati sul meteo (se un provider metodo è stato configurato).\n- A seconda del levello di visibilità assegnato a workout e commenti (pubblico, solo follower, privato e solo utenti menzionati), altri utenti possono vederli e interagirci. **Per favore ricorda che il team che gestisce il server o il team di moderazione può vedere contenuti con visibilità limitata.**\nPuoi seguire altre persone per vedere attività nella tua timeline. Le interazioni richiedono che l'utente sia loggato.\n- Tutte le informazioni del profilo non sono mostrate pubblicamente, tranne lo username, il ruolo, la data di registrazione, il numero di follower e di utenti seguiti, la sospensione, se presente, e il numero di workout.\n- L'indirizzo email che fornisci può essere usato per mandarti informazioni e notifiche o per confermare le modifiche al tuo account.",
      "TITLE": "Per cosa utilizziamo le tue informazioni?"
    },
    "SITE_USAGE_BY_CHILDREN": {
      "CONTENT": "Se questo server si trova in Unione Europa on nell'EEA: Il sito e i serizi sono diretti a persone che hanno almeno 16 anni. Se hai meno di 16 anni, secondo i requisiti della [GDPR](https://en.wikipedia.org/wiki/General_Data_Protection_Regulation) (General Data Protection Regulation) non puoi usare questo sito.\nSe questo server si trova negli USA: Il sito, i prodotti e i servizi sono diretti a persone che hanno almeno 13 anni. Se hai meno di 13 anni, secondo i requisiti del [COPPA](https://en.wikipedia.org/wiki/Children%27s_Online_Privacy_Protection_Act) (Children's Online Privacy Protection Act) non puoi usare questo sito.\nI requisiti di legge possono essere diversi se questo serve si trova in altre giurisdizioni.",
      "TITLE": "Utilizzo del sito da parte dei bambini"
    },
    "YOUR_CONSENT": {
      "CONTENT": "Utilizzando il nostro sito, acconsenti alla nostra politica sulla privacy del sito web.",
      "TITLE": "Il tuo consenso"
    }
  },
  "TITLE": "politica sulla privacy"
}
