{
  "CONTENT": {
    "ACCOUNT_DELETION": {
      "CONTENT": "Você pode solicitar a exclusão da sua conta a qualquer momento acessando este endereço (após fazer login) e clicando no botão “Excluir minha conta” nas configurações da conta.",
      "TITLE": "Exclusão de conta"
    },
    "CHANGES_TO_OUR_PRIVACY_POLICY": {
      "CONTENT": "Se decidirmos alterar a nossa política de privacidade, anunciaremos as alterações nesta página.\nEste documento está licenciado sob [CC-BY-SA](https://creativecommons.org/licenses/by-sa/4.0/). Adaptado da política de privacidade original do [Discourse](https://github.com/discourse/discourse).",
      "TITLE": "Mudanças na Política de Privacidade"
    },
    "DATA_COLLECTED": {
      "CONTENT": "Coletamos as seguintes informações:\n- Informações da conta (nome de usuário, endereço de e-mail e senha). Também informações opcionais do seu perfil, como nome, sobrenome, data de nascimento, localização, biografia e imagem de perfil carregada.\n- Arquivos [GPX](https://en.wikipedia.org/wiki/GPS_Exchange_Format). Estes arquivos contêm dados relacionados às suas atividades (coordenadas geográficas, data, distância, duração, velocidades máxima e média, altitude, frequência cardíaca…). Caso não queira expor esses dados, exclua-os antes de carregá-los ou adicione os treinos sem arquivo GPX.\n- Dados de treino (esporte, título, data, duração, distância, subida, descida, notas).\n- Informações técnicas (navegador e sistema operacional).",
      "TITLE": "Quais são as informações que coletamos?"
    },
    "INFORMATION_DISCLOSURE": {
      "CONTENT": "Não vendemos, comercializamos ou transferimos de outra forma suas informações de identificação pessoal a terceiros.\nIsto não inclui terceiros que nos ajudam a gerir o nosso website e a fornecer-lhe serviços, desde que esses terceiros mantenham um compromisso de confidencialidade.\nTambém poderemos divulgar essas informações se acreditarmos que estamos cumprindo a lei, aplicando as políticas do nosso site ou protegendo nossos e seus direitos, propriedade ou segurança.\nQuando você autoriza um aplicativo de terceiros a usar sua conta, dependendo do escopo das permissões concedidas, ele poderá acessar seu perfil ou informações de treino. Os aplicativos nunca têm acesso à sua senha.",
      "TITLE": "Mostramos algum tipo de informação a terceiros externos?"
    },
    "INFORMATION_PROTECTION": {
      "CONTENT": "Implementamos uma variedade de medidas de segurança para manter suas informações pessoais seguras quando você escreve, envia ou acessa suas informações pessoais.",
      "TITLE": "Como protegemos os seus dados?"
    },
    "INFORMATION_USAGE": {
      "CONTENT": "Todas as informações que coletamos de você podem ser usadas para fornecer as funções básicas do **FitTrackee**:\n- Os arquivos GPX são usados para criar treinos, exibir rotas no mapa (com [OpenStreetMap](https://www.openstreetmap.org) e o servidor de imagem do mapa configurado) e gráficos, criar miniaturas de mapas, calcular registros e obter dados meteorológicos (se o serviço estiver configurado).\n- Os treinos e as informações do perfil não são exibidos publicamente. Um usuário registrado só pode visualizar seus próprios treinos.\n- O endereço de e-mail fornecido poderá ser utilizado para lhe enviar informações ou para confirmar alterações na sua conta.",
      "TITLE": "Para que utilizamos os seus dados?"
    },
    "SITE_USAGE_BY_CHILDREN": {
      "CONTENT": "Se este servidor estiver na UE ou no EEE: O nosso site e serviços são direcionados a pessoas com pelo menos 16 anos de idade. Se você não tem 16 anos, conforme exigido pelo [GDPR](https://en.wikipedia.org/wiki/General_Data_Protection_Regulation) (Regulamento Geral de Proteção de Dados), não use este site.\nSe este servidor estiver nos Estados Unidos da América: o nosso website, produtos e serviços destinam-se a pessoas com pelo menos 13 anos de idade. Se você não tiver mais de 13 anos, conforme exigido pela [COPPA](https://en.wikipedia.org/wiki/Children%27s_Online_Privacy_Protection_Act) (Lei de Proteção à Privacidade Online das Crianças), não use este site.\nOs requisitos legais podem ser diferentes se este servidor estiver localizado em outros locais.",
      "TITLE": "Utilização deste site por menores"
    },
    "YOUR_CONSENT": {
      "CONTENT": "Ao utilizar nosso site, você aceita a política de privacidade do nosso site.",
      "TITLE": "Sua permissão"
    }
  },
  "LAST_UPDATE": "Última atualização",
  "TITLE": "política de privacidade"
}
