Repository: SamR1/FitTrackee
Catalog: fittrackee/emails/translations/*/LC_MESSAGES/messages.po
Languages: bg, cs, it

source: Hi %(username)s,
bg: Здравей %(username)s,
cs: Ahoj %(username)s,
it: Ciao %(username)s,

source: For security, this request was received from a %(operating_system)s device using %(browser_name)s.
bg: От съображения за сигурност тази заявка е получена от устройство %(operating_system)s, използващо %(browser_name)s.
cs: Kvůli bezpečnosti: Tento požadavek přišel ze zařízení s %(operating_system)s a prohlížeče %(browser_name)s.
it: Per sicurezza, questa richiesta è stata ricevuta da %(operating_system)s utilizzando il browser %(browser_name)s.

source: Thanks,
bg: Благодаря,
cs: Díky,
it: Grazie,

source: The FitTrackee Team
bg: Екипът на FitTrackee
cs: Tým FitTrackee
it: Il Team FitTrackee

source: Confirm your account
bg: Потвърдете акаунта си
cs: Potvrďte svůj účet
it: Conferma il tuo account

source: Use this link to confirm your account.
bg: Използвайтетози линк за да потвърдите акаунта си.
cs: Použijte tento odkaz pro potvrzení Vašeho účtu.
it: Usa questo link per confermare il tuo account.

source: You have created an account on FitTrackee.
bg: Създадохте акаунт в FitTrackee.
cs: Vytvořili jste účet na FitTrackee.
it: Hai creato un account su FitTrackee.

source: Use the button below to confirm your address email.
bg: Използвайте бутона отдолу за да потвърдите имейл адреса си.
cs: Pro potvrzení Vaší emailové adresy použijte následující tlačítko.
it: Usa il bottone qui sotto per confermare il tuo indirizzo email.

source: Verify your email
bg: Потвърдете имейла си
cs: Ověřte Váš email
it: Verifica la tua email

source: If this account creation wasn't initiated by you, please ignore this email.
bg: Ако създаването на този акаунт не е поискано от Вас, моля игнорирайте този имейл.
cs: Pokud jste nepožadovali vytvoření účtu, tak prosím ignorujte tento email.
it: Se la creazione di quest'account non è stata iniziata da te, per favore ignora quest'email.

source: If you're having trouble with the button above, copy and paste the URL below into your web browser.
bg: Ако виждате проблем с бутона отдолу, копирайте URL-а и го отворете нов таб на браузъра.
cs: Pokud máte potíže s tlačítkem výše, zkopírujte URL níže do Vašeho webového prohlížeče.
it: Se stai avendo problemi con il bottone qui sopra, copia ed incolla l'URL qui sotto nel tuo web browser.

source: Use the link below to confirm your address email.
bg: Използвайте линка отдолу за да потвърдите имейл адреса си.
cs: Použijte odkaz níže pro potvrzení Vaší emailové adresy.
it: Usa il link qui sotto per confermare la tua email.

source: Your archive is ready to be downloaded
bg: Архивът ви е готов за изтегляне
cs: Váš archiv je připravený ke stažení

source: A download link is available in your account.
bg: Линк за изтегляне е наличен в акаунта ви.
cs: Odkaz pro stažení je dostupný ve Vašem účtu.

source: You have requested an export of your account on FitTrackee.
bg: Поцелахте извадка на данните от акаунта си в FitTrackee.
cs: Požadovali jste export Vašeho účtu na FitTrackee.

source: The archive is now ready to be downloaded from your account.
bg: Архивът е готов да бъде свален от вашият акаунт.
cs: Tento archiv je nyní připravený ke stažení z Vašeho účtu.

source: Download your archive
bg: Изтегли архива
cs: Stáhněte si Váš archiv

source: If you did not request the export, please change your password immediately or contact your administrator if your account is locked.
bg: Ако не сте поискали този експорт, моля сменете си паролата незабавно или се свържете с администратор ако акаунта ви е заключен.
cs: Pokud jste o export nepožádali, okamžitě si změňte heslo nebo kontaktujte svého správce, pokud je váš účet uzamčen.

source: Email changed
bg: Имейлът е сменен
cs: Email byl změněn
it: Email modificata

source: Your email is being updated.
bg: Имейлът Ви беше променен.
cs: Váš e-mail se aktualizuje.
it: La tua email sta venendo aggiornata.

source: You recently requested to change your email address for your FitTrackee account to:
bg: Наскоро пожелахте да смените имейл адреса си за FitTrackee акаунт на:
cs: Nedávno jste požádali o změnu e-mailové adresy pro svůj účet FitTrackee na:
it: Hai richiesto di cambiare la tua mail di FitTrackee in:

source: If this email change wasn't initiated by you, please change your password immediately or contact your administrator if your account is locked.
bg: Ако тази промяна на имейла не е инициирана от вас, моля, променете паролата си незабавно или се свържете с вашия администратор, ако акаунтът ви е заключен.
cs: Pokud jste tuto změnu e-mailu neiniciovali vy, okamžitě si změňte heslo, nebo pokud je váš účet uzamčen, kontaktujte svého správce.
it: Se il cambio di email non è stato iniziato da te, per favore cambia immediatamente la tua password o contatta un amministratore se il tuo account è bloccato.

source: Confirm email change
bg: Потвърдете промяната на имейла
cs: Potvrďte změnu emailu
it: Conferma cambio email

source: Use this link to confirm email change.
bg: Използвайте тази връзка, за да потвърдите промяната на имейла.
cs: Pomocí tohoto odkazu potvrďte změnu e-mailu.
it: Usa questo link per confermare il cambio dell'email.

source: You recently requested to change your email address for your FitTrackee account.
bg: Наскоро поискахте промяна на вашия имейл адрес за акаунтът ви в FitTrackee.
cs: Nedávno jste požádali o změnu e-mailové adresy pro svůj účet FitTrackee.
it: Hai richiesto di recente di cambiare l'indirizzo email associato con il tuo account FitTrackee.

source: Use the button below to confirm this address.
bg: Използвайте бутона по-долу, за да потвърдите този адрес.
cs: Pro potvrzení této adresy použijte tlačítko níže.
it: Usa il bottone qui sotto per confermare questo indirizzo.

source: If this email change wasn't initiated by you, please ignore this email.
bg: Ако тази промяна на имейла не е инициирана от вас, моля, игнорирайте този имейл.
cs: Pokud jste tuto změnu e-mailu neiniciovali vy, ignorujte prosím tento e-mail.
it: Se il cambio d'email non è stato iniziato da te, per favore ignora questa mail.

source: Use the link below to confirm this address.
bg: Използвайте връзката по-долу, за да потвърдите този адрес.
cs: Pomocí níže uvedeného odkazu potvrďte tuto adresu.
it: Usa il link qui in basso per confermare quest'indirizzo.

source: Password changed
bg: Паролата е променена
cs: Heslo bylo změněno
it: Password cambiata

source: Your password has been changed.
bg: Паролата Ви е сменена.
cs: Vaše heslo bylo změněno.
it: La tua password è stata cambiata.

source: The password for your FitTrackee account has been changed.
bg: Паролата за вашия акаунт в FitTrackee е променена.
cs: Heslo k Vašemu FitTrackee účtu bylo změněno.
it: La password per il tuo account FitTrackee è stata cambiata.

source: If this password change wasn't initiated by you, please change your password immediately or contact your administrator if your account is locked.
bg: Ако промяната на паролата не е изискана от вас, моля, сменете незабавно паролата си или се свържете с администратор, ако акаунтът ви е заключен.
cs: Pokud jste tuto změnu hesla neiniciovali vy, okamžitě si heslo změňte, nebo pokud je váš účet uzamčen, kontaktujte svého správce.
it: Se questo cambio di password non è stato iniziato da te, per favore cambia immediatamente la tua password e contatta un amministratore se il tuo account è bloccato.

source: Password reset request
bg: Заявка за смяна на парола
cs: Žádost o obnovu hesla
it: Richiesta di reset della password

source: Use this link to reset your password. The link is only valid for %(expiration_delay)s.
bg: Използвайте тази връзка, за да нулирате паролата си. Връзката е валидна само за %(expiration_delay)s.
cs: Pomocí tohoto odkazu obnovíte své heslo. Odkaz je platný pouze po dobu %(expiration_delay)s.
it: Usa questo link per resettare la password. Il link è valido solo per %(expiration_delay)s.

source: You recently requested to reset your password for your FitTrackee account.
bg: Наскоро поискахте да нулирате паролата си за вашия акаунт в FitTrackee.
cs: Nedávno jste požádali o obnovu hesla ke svému účtu FitTrackee.
it: Hai richiesto di recente di resettare la password per il tuo account FitTrackee.

source: Use the button below to reset it.
bg: Използвайте бутона по-долу, за да я нулирате.
cs: Pro obnovu použijte tlačítko níže.
it: Usa il bottone qui sotto per resettarla.

source: This password reset link is only valid for %(expiration_delay)s.
bg: Връзката за нулиране на парола е валидна само за %(expiration_delay)s.
cs: Tento odkaz na obnovu hesla je platný pouze po dobu %(expiration_delay)s.
it: Questo link di reset è valido solo per %(expiration_delay)s.

source: Reset your password
bg: Нулирайте паролата си
cs: Obnovit heslo
it: Resetta password

source: If you did not request a password reset, please ignore this email.
bg: Ако не сте поискали нулиране на паролата си, моля, игнорирайте този имейл.
cs: Pokud jste o obnovu hesla nepožádali, ignorujte prosím tento e-mail.
it: Se non hai richiesto un reset della password, per favore ignora quest'email.

source: Use the link below to reset it.
bg: Използвайте връзката по-долу, за да я нулирате.
cs: Pro obnovu použijte odkaz níže.
it: Usa il link qui sotto per resettarla.
