{
  "CONTENT": {
    "ACCOUNT_DELETION": {
      "CONTENT": "Zure kontua ezabatzeko eskatu dezakezu helbide honetara joanez (behin webgunean sartuta) eta \"Ezabatu nire kontua\" botoian sakatuz.",
      "TITLE": "Kontua ezabatzea"
    },
    "CHANGES_TO_OUR_PRIVACY_POLICY": {
      "CONTENT": "Gure pribatutasun politika aldatzen baduzu, aldaketa horiek hemen jarriko ditugu.\nDokumentu hau [CC-BY-SA](https://creativecommons.org/licenses/by-sa/4.0/) lizentziapean dago. [Discourse](https://github.com/discourse/discourse) proiektuaren pribatutasun politikatik egokitu dugu.",
      "TITLE": "Gure Pribatutasun Politikaren aldaketak"
    },
    "DATA_COLLECTED": {
      "CONTENT": "Informazio hau jasotzen dugu:\n- Kontuaren informazioa (erabiltzaile-izena, eposta helbidea eta pasahitza). Zure profilean informazio gehigarria ere gehitu dezakezu, adibidez, zure izen-abizenak, jaiotze-data, herria, biografia eta argazkia.\n- [GPX](https://en.wikipedia.org/wiki/GPS_Exchange_Format) fitxategiak. Fitxategi hauek zure ekintzen informazioa gordetzen dute (koordinatuak, data, distantzia, iraupena, abiadurak, altuera, izena, deskribapena, bihotz-taupadak, …). Informazioren bat argitaratu nahi ez baduzu, garbitu fitxategia edo GPX fitxategi gabeko ekintzak gehitu.\n- Entrenamenduen informazioa (kirola, izena, deskribapena, data, iraupena, distantzia, igoerak, jaitsierak, oharrak, …).\n- Followers and following users.\n- Comments and likes.\n- Informazio teknikoa (nabigatzailearen izena eta sistema eragilearen izena).",
      "TITLE": "Ze informazio biltzen dugu?"
    },
    "INFORMATION_DISCLOSURE": {
      "CONTENT": "Ez dugu zu pertsonalki identifikatzen zaituen informaziorik hirugarrenekin saldu, negoziatu edo transferitzen.\nHonek ez ditu barne hartzen webgune hau martxan izateko behar-beharrezko diren hirugarrenak, beti ere informazio hori konfidentzialtasunez gordetzeko ados badaude.\nEra berean, zure informazioa besteren bati eman diezaiokegu legeak horrela agintzen badu, zure politika betetzen dela bermatzeko, gure edo besteen eskubideak, jabetza edo segurtasuna babesteko.\nHirugarren aplikazio bati zure kontua erabiltzeko baimena ematen diozuenean, ematen duzun baimenaren arabera, zure profileko informazioa edo entrenamenduak atzi ditzake. Aplikazioek ez dute sekula zure pasahitza ikusiko.",
      "TITLE": "Kanpoko norbaiti informazioren bat ematen diogu?"
    },
    "INFORMATION_PROTECTION": {
      "CONTENT": "Zure informazio pertsonalaren segurtasuna bermatzeko hainbat segurtasun-neurri aplikatzen ditugu berau sartu, bidali edo ikusten duzunean.",
      "TITLE": "Nola babesten dugu zure informazioa?"
    },
    "INFORMATION_USAGE": {
      "CONTENT": "Zugandik jasotzen dugun informazioa **FitTrackee**ren oinarrizko funtzionalitatea eskaintzeko erabili daiteke:\n- GPX fitategiak entrenamenduak sortzeko, ibilbideak mapak erakusteko ( [OpenStreetMap](https://www.openstreetmap.org) eta konfiguratutako zerbitzaria erabiliz) eta grafikoak, mapa txikiak, errekorrak kalkulatu eta eguraldiaren datuak lortzeko (eguraldia emateko zerbitzua aktibatuta badago) erabiltzen dira.\n- Depending on the visibility level set on workouts and comments (public, followers only, private and mentioned users), other users can see and interact with them. **Please keep in mind that the server operating team or the moderation team may view content with restricted visibility.**\nYou can follow other people to view activities on your timeline. Interaction requires the user to log in.\n- All profile information is not displayed publicly, except username, role, registration date, number of followers and following users, suspension if set and number of workouts.\n- Eman duzun eposta helbidea, informazioa bidaltzeko eta zure kontuan egindako aldaketen berri emateko erabiliko da.",
      "TITLE": "Zertarako erabiltzen ditugu zure datuak?"
    },
    "SITE_USAGE_BY_CHILDREN": {
      "CONTENT": "Zerbitzari hau EBean edo EEAn badago: gure webgunea eta zerbitzuak gutxienez 16 urte dituzten pertsonentzat dira. 16 urtez beherakoa bazara, eta [DBEO](https://eu.wikipedia.org/wiki/Datuak_Babesteko_Erregelamendu_Orokorra) (Datuak Babesteko Erregelamendu Orokorrak) dioenari jarraiki ez erabili webgune hau.\nZerbitzaru hau AEBn badago: gure webgunea, produktuak eta zerbitzuak, gutxienez 13 urte dituzten pertsonentzat dira. 13 urtez azpikoa bazara [HOPBL](https://en.wikipedia.org/wiki/Children%27s_Online_Privacy_Protection_Act) (Haurren Online Pribatutasuna Babesteko Legea) dioenari jarraiki ez erabili webgune hau.\nLege betebeharrak desberdinak izan daitezke zerbitzaria beste tokiren baten badago.",
      "TITLE": "Zerbitzua adingabeek erabiltzea"
    },
    "YOUR_CONSENT": {
      "CONTENT": "Gure webgunea erabiltzen duzunean, webguneko pribatutasun politikari baietza ematen diozu.",
      "TITLE": "Zure onarpena"
    }
  },
  "LAST_UPDATE": "Azken eguneraketa",
  "TITLE": "pribatutasun politika"
}
