{
  "CONTENT": {
    "ACCOUNT_DELETION": {
      "CONTENT": "Вы можете запросить удаление вашей учетной записи в любое время, перейдя на этот адрес (после входа в систему) и нажав на кнопку «Удалить мою учетную запись» в редактировании вашей учетной записи.",
      "TITLE": "Удаление аккаунта"
    },
    "CHANGES_TO_OUR_PRIVACY_POLICY": {
      "CONTENT": "Если мы решим изменить нашу политику конфиденциальности, мы опубликуем эти изменения на этой странице.\nЭтот документ распространяется по лицензии [CC-BY-SA](https://creativecommons.org/licenses/by-sa/4.0/). Изначально адаптирован из политики конфиденциальности [Discourse](https://github.com/discourse/discourse).",
      "TITLE": "Изменения в нашей политике конфиденциальности"
    },
    "DATA_COLLECTED": {
      "CONTENT": "Собирается следующая информация:\n- Информация об аккаунте (имя пользователя, адрес электронной почты и пароль). Вы также можете указать дополнительную информацию профиля, такую как имя, фамилия, дата рождения, местоположение, биография и загрузить изображение профиля.\n- [GPX](https://en.wikipedia.org/wiki/GPS_Exchange_Format)-файлы. Эти файлы содержат данные, связанные с вашими активностями (географические координаты, дата, расстояние, продолжительность, максимальная и средняя скорости, высота, название, описание, пульс и др.). Если вы не хотите раскрывать какую-либо информацию, очистите данные перед загрузкой или добавьте тренировку без GPX-файла.\n- Данные о тренировках (вид спорта, название, описание, дата, продолжительность, расстояние, набор и сброс высоты, заметки).\n- Подписчики и пользователи, на которых вы подписаны.\n- Комментарии и оценки.\n- Техническая информация (название браузера и операционная система).",
      "TITLE": "Какую информацию мы собираем?"
    },
    "INFORMATION_DISCLOSURE": {
      "CONTENT": "Мы не продаём, не обмениваем и не передаём ваши персональные данные сторонним организациям.\nЭто не относится к доверенным третьим сторонам, которые помогают нам в работе сайта и обслуживании пользователей, при условии, что эти стороны соглашаются сохранять конфиденциальность данной информации.\nМы также можем раскрывать вашу информацию, если сочтём это необходимым для соблюдения закона, выполнения политик нашего сайта или защиты прав, имущества и безопасности нас самих или других лиц.\nКогда вы разрешаете стороннему приложению использовать ваш аккаунт, в зависимости от предоставленных вами разрешений оно может получить доступ к информации вашего профиля или вашим тренировкам. Приложения никогда не могут получить доступ к вашему паролю.",
      "TITLE": "Раскрываем ли мы какую-либо информацию сторонним лицам?"
    },
    "INFORMATION_PROTECTION": {
      "CONTENT": "Мы внедряем различные меры безопасности для обеспечения сохранности вашей личной информации при её вводе, отправке или доступе к ней.",
      "TITLE": "Как мы защищаем вашу информацию?"
    },
    "INFORMATION_USAGE": {
      "CONTENT": "Любая информация, которую мы собираем у вас, может быть использована для обеспечения основной функциональности **FitTrackee**:\n- GPX-файлы используются для создания тренировок, отображения треков на карте (с помощью [OpenStreetMap](https://www.openstreetmap.org) и настроенного tile-сервера) и графиков, генерации миниатюр карт, расчёта рекордов и получения погодных данных (если выбран поставщик погоды).\n- В зависимости от установленного уровня видимости тренировок и комментариев (публичный, только для подписчиков, приватный и для упомянутых пользователей), другие пользователи могут видеть их и взаимодействовать с ними. **Пожалуйста, имейте в виду, что команда операторов сервера или модераторы могут просматривать контент с ограниченной видимостью.**\nВы можете подписываться на других людей, чтобы видеть их активности в вашей ленте. Для взаимодействия требуется вход в систему.\n- Вся информация профиля не отображается публично, кроме имени пользователя, роли, даты регистрации, количества подписчиков и подписок, статуса блокировки (если применим) и количества тренировок.\n- Указанный вами адрес электронной почты может использоваться для отправки информации и уведомлений или подтверждения изменений в вашем аккаунте.",
      "TITLE": "Для чего мы используем вашу информацию?"
    },
    "SITE_USAGE_BY_CHILDREN": {
      "CONTENT": "Если этот сервер находится в ЕС или ЕЭЗ: Наш сайт и сервисы предназначены только для лиц, достигших 16 лет. Если вам меньше 16 лет, согласно требованиям [GDPR](https://en.wikipedia.org/wiki/General_Data_Protection_Regulation) (Общий регламент по защите данных), не используйте этот сайт.\nЕсли этот сервер находится в США: Наш сайт, продукты и сервисы предназначены только для лиц, достигших 13 лет. Если вам меньше 13 лет, согласно требованиям [COPPA](https://en.wikipedia.org/wiki/Children%27s_Online_Privacy_Protection_Act) (Закон о защите персональных данных детей в интернете), не используйте этот сайт.\nПравовые требования могут отличаться, если сервер находится в другой юрисдикции.",
      "TITLE": "Использование сайта детьми"
    },
    "YOUR_CONSENT": {
      "CONTENT": "Используя наш сайт, вы соглашаетесь с нашей политикой конфиденциальности.",
      "TITLE": "Ваше согласие"
    }
  },
  "TITLE": "политика конфиденциальности"
}
