Repository: SamR1/FitTrackee
Catalog: fittrackee/translations/*/LC_MESSAGES/messages.po
Languages: de, es, eu, fr, gl, hr, nl, pl, pt, ru

source: Use the button below to confirm this address.
de: Verwende die untere Schaltfläche, um deine Adresse zu bestätigen.
es: Usa el botón inferior para confirmar esta dirección.
eu: Erabili beheko botoia helbide hau baieztatzeko.
fr: Cliquez sur le bouton ci-dessous pour confirmer cette adresse électronique.
gl: Usa o botón inferior para confirmar este enderezo.
hr: Upotrijebite gumb u nastavku za potvrdu ove adrese.
nl: Gebruik de onderstaande knop om dit adres te bevestigen.
pl: Użyj poniższego przycisku aby potwierdzić ten adres.
pt: Use o botão abaixo para confirmar o endereço.
ru: Используйте кнопку ниже, чтобы подтвердить этот адрес.

source: If this email change wasn't initiated by you, please ignore this email.
de: Falls die Änderung der E-Mail-Adresse nicht von dir initiiert wurde, ignoriere diese E-Mail bitte.
es: Si no has iniciado este cambio, por favor ignora este correo.
eu: Eposta aldaketa hau zuk eskatu ez baduzu, ez egin kasu mezu honi.
fr: Si vous n'êtes pas à l'origine de cette modification, vous pouvez ignorer ce courriel.
gl: Se non solicitaches este cambio, podes ignorar este correo.
hr: Ako ovu promjenu adrese e-pošte niste pokrenuli vi, zanemarite ovu e-poruku.
nl: Indien u deze email aanpassing niet hebt aangevraagd, gelieve deze email te negeren.
pl: Jeśli nie zlecałeś(-aś) zmiany adresu e-mail, zignoruj proszę tę wiadomość.
pt: Se não iniciou esta alteração, ignore este e-mail.
ru: Если вы не запрашивали изменение адреса электронной почты, просто не обращайте внимания на это письмо.

source: Use the link below to confirm this address.
de: Verwende den unteren Link, um deine Adresse zu bestätigen.
es: Usa el enlace inferior para confirmar esta dirección.
eu: Erabili beheko esteka helbidea baieztatzeko.
fr: Cliquez sur le lien ci-dessous pour confirmer cette adresse électronique.
gl: Usa a ligazón inferior para confirmar este enderezo.
hr: Upotrijebite poveznicu u nastavku za potvrdu ove adrese.
nl: Gebruik onderstaande link om dit adres te bevestigen.
pl: Użyj poniższego linku aby potwierdzić ten adres.
pt: Use o link abaixo para confirmar este endereço.
ru: Используйте ссылку ниже, чтобы подтвердить этот адрес.

source: Password changed
de: Passwort geändert
es: Contraseña cambiada
eu: Pasahitza aldatu egin da
fr: Mot de passe modifié
gl: Contrasinal cambiado
hr: Lozinka je promijenjena
nl: Wachtwoord aangepast
pl: Hasło zmienione
pt: Senha alterada
ru: Пароль изменён

source: Your password has been changed.
de: Dein Passwort wurde geändert.
es: Tu contraseña ha sido cambiada.
eu: Zure pasahitza aldatu egin da.
fr: Votre mot de passe a été modifié.
gl: Realizouse o cambio de contrasinal.
hr: Vaša lozinka je promijenjena.
nl: Uw wachtwoord werd aangepast.
pl: Twoje hasło zostało zmienione.
pt: Sua senha foi alterada.
ru: Ваш пароль был изменен.

source: The password for your FitTrackee account has been changed.
de: Das Passwort deines FitTrackee-Kontos wurde geändert.
es: La contraseña de tu cuenta FitTrackee ha sido cambiada.
eu: Zure FitTrackee kontuko pasahitza aldatu egin da.
fr: Le mot de passe de votre compte FitTrackee a été modifié.
gl: Realizouse o cambio de contrasinal da túa conta FitTrackee.
hr: Lozinka za vaš FitTrackee račun je promijenjena.
nl: Het wachtwoord voor uw FitTrackee account werd aangepast.
pl: Hasło do Twojego konta FitTrackee zostało zmienione.
pt: A senha da sua conta FitTrackee foi alterada.
ru: Пароль для вашей учетной записи FitTrackee был изменен.

source: If this password change wasn't initiated by you, please change your password immediately or contact your administrator if your account is locked.
de: Falls die Änderung des Passworts nicht von dir initiiert wurde, ändere bitte sofort dein Passwort oder kontaktiere den Administrator, falls dein Konto gesperrt ist.
es: Si no has iniciado este cambio de contraseña, por favor cambia la contraseña ahora mismo o contacta con la administración si la cuenta está bloqueada.
eu: Pasahitz aldaketa hau zuk eskatu ez baduzu, aldatu zure pasahitza berehala edo jarri kontaktuan kudeatzailearekin zure kontua blokeatuta badago.
fr: Si vous n'êtes pas à l'origine de cette modification, veuillez changer votre mot de passe immédiatement ou contacter l'administrateur si votre compte est bloqué.
gl: Se non solicitaches este cambio de contrasinal, cambia agora mesmo o contrasinal ou contacta coa administración se a conta está bloqueada.
hr: Ako ovu promjenu lozinke niste inicirali vi, odmah promijenite lozinku ili kontaktirajte svog administratora ako je vaš račun zaključan.
nl: Indien de aanpassing van uw wachtwoord niet door u werd aangevraagd, gelieve uw wachtwoord dan onmiddellijk te veranderen of contacteer uw administrator als uw account is vergrendeld.
pl: Jeśli nie zlecałeś(-aś) zmiany hasła, zmień hasło do swojego konta lub skontaktuj się z administratorem, jeśli twoje konto jest zablokowane.
pt: Se ainda não iniciou esta alteração de senha, altere a senha agora mesmo ou entre em contato com a administração se a conta estiver bloqueada.
ru: Если вы не инициировали смену пароля, немедленно измените свой пароль или обратитесь к администратору, если ваша учетная запись заблокирована.

source: Password reset request
de: Anfrage zum Zurücksetzen des Passworts
es: Solicitud de cambio de contraseña
eu: Pasahitza berrezartzeko eskaera
fr: Réinitialiser votre mot de passe
gl: Solicitude para restablecer contrasinal
hr: Zahtjev za ponovno postavljanje lozinke
nl: Aanvraag voor wachtwoord reset
pl: Prośba o reset hasła
pt: Solicitação para alteração da senha
ru: Запрос на сброс пароля

source: Use this link to reset your password. The link is only valid for %(expiration_delay)s.
de: Verwende den unteren Link, um dein Passwort zurückzusetzen. Der Link ist nur für %(expiration_delay)s gültig.
es: Usa este enlace para cambiar tu contraseña. Este enlace será válido durante %(expiration_delay)s.
eu: Erabili esteka hau zure pasahitza berrezartzeko. Esteka %(expiration_delay)s barru iraungiko da.
fr: Utiliser ce lien pour réinitialiser le mot de passe. Ce lien n'est valide que pendant %(expiration_delay)s.
gl: Usa esta ligazón para restablecer o contrasinal. A ligazón será válida durante %(expiration_delay)s.
hr: Koristite ovu poveznicu za poništavanje lozinke. Poveznica je važeća samo do %(expiration_delay)s.
nl: Gebruik deze link om uw wachtwoord te resetten. De link is enkel geldig voor %(expiration_delay)s.
pl: Użyj tego linku aby zresetować hasło. Ten link jest ważny tylko %(expiration_delay)s.
pt: Use este link para alterar sua senha. Este link será válido por %(expiration_delay)s.
ru: Используйте эту ссылку для сброса пароля. Ссылка действительна только в течение %(expiration_delay)s.

source: You recently requested to reset your password for your FitTrackee account.
de: Du hast kürzlich beantragt, das Passwort deines FitTrackee-Kontos zurückzusetzen.
es: Recientemente has solicitado cambiar la contraseña de tu cuenta FitTrackee.
eu: Zure FitTrackee kontuko pasahitza berrezartzeko eskaera egin duzu berriki.
fr: Vous avez récemment demandé la réinitialisation du mot de passe de votre compte sur FitTrackee.
gl: Recentemente solicitaches cambiar o contrasinal da túa conta FitTrackee.
hr: Nedavno ste zatražili ponovno postavljanje lozinke za svoj FitTrackee račun.
nl: U hebt een aanvraag ingediend om uw wachtwoord te resetten voor uw FitTrackee account.
pl: Zleciłeś(-aś) niedawno reset hasła do konta FitTrackee.
pt: Recentemente, solicitou a alteração da senha da sua conta FitTrackee.
ru: Вы недавно запросили сброс пароля для вашей учетной записи FitTrackee.

source: Use the button below to reset it.
de: Verwende die untere Schaltfläche, um es zurückzusetzen.
es: Usa el botón inferior para restablecerla.
eu: Erabili beheko botoia berrezartzeko.
fr: Cliquez sur le bouton pour le réinitialiser.
gl: Usa o botón inferior para restablecela.
hr: Upotrijebite gumb u nastavku za resetiranje.
nl: Gebruik de onderstaande knop om het te resetten.
pl: Użyj poniższego przycisku aby je zresetować.
pt: Use o botão inferior para redefini-lo.
ru: Используйте кнопку ниже, чтобы сбросить его.

source: This password reset link is only valid for %(expiration_delay)s.
de: Der Link ist nur für %(expiration_delay)s gültig.
es: Este enlace para restablecer la contraseña sólo será válido durante %(expiration_delay)s.
eu: Pasahitza berrezartzeko esteka %(expiration_delay)s barru iraungiko da.
fr: Ce lien n'est valide que pendant %(expiration_delay)s.
gl: A ligazón para restablecer o contrasinal será válido durante %(expiration_delay)s.
hr: Ova poveznica za poništavanje lozinke vrijedi samo do %(expiration_delay)s.
nl: Deze link om uw wachtwoord te resetten is enkel geldig voor %(expiration_delay)s.
pl: Ten link resetu hasła jest ważny tylko %(expiration_delay)s.
pt: Este link de redefinição de senha só será válido por %(expiration_delay)s.
ru: Эта ссылка для сброса пароля действительна только в течение %(expiration_delay)s.

source: Reset your password
de: Dein Passwort zurücksetzen
es: Restablecer contraseña
eu: Berrezarri zure pasahitza
fr: Réinitialiser le mot de passe
gl: Restablece o contrasinal
hr: Ponovno postavite lozinku
nl: Reset uw wachtwoord
pl: Zresetuj swoje hasło
pt: Restaurar senha
ru: Сбросить пароль

source: If you did not request a password reset, please ignore this email.
de: Falls du das Zurücksetzen des Passworts nicht angefordert hast, igoniere diese E-Mail bitte.
es: Si no has solicitado restablecer la contraseña, ignora este email.
eu: Zuk ez baduzu pasahitza berrezartzea eskatu, ez egin kasu mezu honi.
fr: Si vous n'avez pas demandé de réinitialisation, vous pouvez ignorer ce courriel.
gl: Se non solicitaches restablecer o contrasinal, ignora este correo.
hr: Ako niste zatražili ponovno postavljanje lozinke, zanemarite ovu e-poruku.
nl: Als u geen aanvraag hebt ingediend om uw wachtwoord aan te passen, gelieve dan deze mail te negeren.
pl: Jeśli nie zlecałeś(-aś) resetu hasła, zignoruj proszę tę wiadomość.
pt: Se não solicitou uma redefinição de senha, ignore este e-mail.
ru: Если вы не запрашивали сброс пароля, пожалуйста, проигнорируйте это письмо.

source: Use the link below to reset it.
de: Verwende den unteren Link, um es zurückzusetzen.
es: Usa el enlace inferior para restablecerla.
eu: Erabili beheko esteka berrezartzeko.
fr: Cliquez sur le lien ci-dessous pour le réinitialiser.
gl: Usa a ligazón inferior para restablecelo.
hr: Upotrijebite poveznicu u nastavku da biste ju poništili.
nl: Gebruik onderstaande link om het te resetten.
pl: Użyj poniższego linku aby je zresetować.
pt: Use o link abaixo para redefini-lo.
ru: Используйте ссылку ниже, чтобы сбросить пароль.

source: Your account has been suspended
de: Dein Konto wurde gesperrt
eu: Zure kontua bertan behera utzi da
fr: Votre compte a été suspendu
gl: Suspendeuse a túa conta
hr: Vaš račun je suspendiran
nl: Uw account is geblokkeerd
pl: Twoje konto zostało zawieszone
ru: Ваш аккаунт был заблокирован

source: You can no longer use your account and your profile is no longer accessible
de: Du kannst dein Konto nicht länger verwenden und dein Profil ist nicht länger erreichbar
eu: Ezin duzu zure kontua erabili eta zure profila ezin da ikusi
fr: Vous ne pouvez plus utiliser votre compte et votre profil n'est plus accessible
gl: Xa non podes usar a túa conta e o teu perfil non é accesible
hr: Više ne možete koristiti svoj račun i vaš profil više nije dostupan
nl: Uw account is geblokkeerd is uw profiel is niet langer zichtbaar
pl: Nie możesz dłużej używać swojego konta i twój profil nie jest nie jest już dostępny
ru: Вы больше не можете пользоваться своим аккаунтом, и ваш профиль недоступен

source: You can still log in to request an export of your data or delete your account
de: Du kannst dich weiterhin anmelden um einen Export deiner Daten anzufordern oder dein Konto zu löschen
eu: Zure datuak esportatzeko edo zure kontua ezabatzeko sartu zaitezke
fr: Vous pouvez toujours vous connecter pour demander un export de vos données ou supprimer votre compte
gl: Podes seguir inciando sesión e pedir exportar os teus datos ou eliminar a conta
hr: I dalje se možete prijaviti kako biste zatražili izvoz svojih podataka ili izbrisali svoj račun
nl: Je kan nog steeds aanmelden en een export van je data aanvragen of je account verwijderen
pl: Nadal możesz zalogować się by wyeksportować swoje dane i/lub usunąć konto
ru: Вы всё ещё можете войти в систему, чтобы запросить экспорт ваших данных или удалить свою учётную запись

source: Your account has been reactivated
de: Dein Account wurde wieder aktiviert
eu: Zure kontua biraktibatu egin da
fr: Votre compte a été réactivé
gl: Reactivouse a túa conta
hr: Vaš račun je ponovno aktiviran
nl: Uw account is geheractiveerd
pl: Twoje konto zostało reaktywowane
ru: Ваш аккаунт был восстановлен

source: You can now use all the features on FitTrackee
de: Du kannst jetzt alle Funktionen bei FitTrackee nutzen
eu: FitTrackeeren ezaugarri guztiak erabili ditzakezu orain
fr: Vous pouvez désormais utiliser toutes les fonctionnalités de FitTrackee
gl: Xa podes usar todas as características de FitTrackee
hr: Sada možete koristiti sve značajke na FitTrackee
nl: Je kan nu alle functies van FitTrackee gebruiken
pl: Możesz teraz używać wszystkich funkcji FitTrackee
ru: Теперь вы можете использовать все функции FitTrackee

source: Warning for %(username)s
de: Warnung für %(username)s
eu: %(username)s erabiltzailearentzako ohartarazpena
fr: Avertissement pour %(username)s
gl: Advertencia para %(username)s
hr: Upozorenje za %(username)s
nl: Waarschuwing voor %(username)s
pl: Ostrzeżenie dla %(username)s
ru: Предупреждение для %(username)s

source: You received a warning
de: Du hast eine Warnung erhalten
eu: Ohartarazpena jaso duzu
fr: Vous avez reçu un avertissement
gl: Recibiches unha advertencia
hr: Dobili ste upozorenje
nl: Je hebt een waarschuwing ontvangen
pl: Otrzymujesz ostrzeżenie
ru: Вы получили предупреждение

source: Your warning has been lifted
de: Deine Verwarnung wurde zurück genommen
eu: Zure ohartarazpena bertan behera utzi da
fr: Votre avertissement a été levé
gl: Retirouse a advertencia
hr: Vaše upozorenje je povučeno
nl: Uw waarschuwing is weggehaald
pl: Twoje ostrzeżenie zostało zniesione
ru: Ваше предупреждение снято

source: Your workout has been suspended
de: Ihr Training wurde unterbrochen
eu: Zure ekintza bertan behera utzi da
fr: Votre séance a été suspendue
gl: A actividade está suspendida
hr: Vaša aktivnost je suspendirana
nl: Je training is opgeschort
pl: Twój trening został zawieszony
ru: Ваша тренировка была заблокирована

source: Your workout has been suspended, it is no longer visible
de: Ihr Training wurde unterbrochen, es ist nicht länger sichtbar
es: Tu contraseña ha sido cambiada.
eu: Zure ekintza bertan behera utzi da, ez da gehiago ikusiko
fr: Votre séance a été suspendue, elle n'est plus visible
gl: A túa actividade foi suspendida, xa non é visible
hr: Vaša aktivnost je suspendirana, više nije vidljiva
nl: Je training is opgeschort, en is niet langer zichtbaar
pl: Twój trening został zawieszony, nie jest dłużej widoczny
ru: Ваша тренировка была заблокирована и больше не отображается

source: The suspension on your workout has been lifted
de: Die Unterbrechung ihres Trainings wurde aufgehoben
eu: Zure ekintza bertan behera uztea, bertan behera utzi da
fr: La suspension de votre séance a été levée
gl: Retirouse a suspensión da túa actividade
hr: Suspenzija vaše aktivnosti je povučena
nl: De schorsing van je training is opgeheven
pl: Zawieszenie twojego treningu zostało zniesione
ru: Блокировка вашей тренировки снята

source: The suspension on your workout has been lifted, it is visible again
de: Die Unterbrechung ihres Trainings wurde aufgehoben, es ist wieder sichtbar
eu: Zure ekintza bertan behera uztea, bertan behera utzi da, berriz ikusiko daiteke
fr: La suspension de votre séance a été levée, elle est visible à nouveau
gl: Retirouse a suspensión da túa actividade, volve a ser visible
hr: Suspenzija vaše aktivnosti je povučena, ponovno je vidljiva
nl: De vering op je workout is opgeheven, het is weer zichtbaar
pl: Zawieszenie twojego treningu zostało zniesione, jest znów widoczny
ru: Блокировка вашей тренировки снята, теперь она снова отображается

source: Canoeing
de: Kanufahren
es: Piragüismo
eu: Kanoa
fr: Canoë
gl: Piragüismo (canoa)
hr: Vožnja kanuom
nl: Kanoing
pl: Kanadyjkarstwo
ru: Гребля на каноэ

source: Cycling (Sport)
de: Radfahren (Sport)
es: Ciclismo (Deportivo)
eu: Txirrindularitza (Kirola)
fr: Vélo (Sport)
gl: Ciclismo (Deportivo)
hr: Biciklizam (sport)
nl: Fietsen (Sport)
pl: Kolarstwo (Sport)
pt: Ciclismo (Desporto)
ru: Велосипед (спорт)

source: Cycling (Transport)
de: Radfahren (Pendeln)
es: Ciclismo (Transporte)
eu: Txirrindularitza (Garraioa)
fr: Vélo (Transport)
gl: Ciclismo (Transporte)
hr: Biciklizam (vožnja)
nl: Fietsen (Transport)
pl: Kolarstwo (Transport)
pt: Ciclismo (Commut)
ru: Велосипед (транспорт)

source: Cycling (Trekking)
de: Radfahren (Trekking)
es: Ciclismo (senderismo)
eu: Txirrindularitza (mendikoa)
fr: Vélo (Trekking)
gl: Ciclismo (Trekking)
hr: Biciklizam (treking)
nl: Fietsen (Trekking)
pl: Kolarstwo (Trekking)
pt: Ciclismo (Trekking)
ru: Велосипед (треккинг)

source: Cycling (Virtual)
de: Radfahren (Virtuell)
es: Ciclismo (Virtual)
eu: Txirrindularitza (birtuala)
fr: Vélo (Virtuel)
gl: Ciclismo (Virtual)
hr: Biciklizam (virtualno)
nl: Fietsen (Virtueel)
pl: Kolarstwo (Wirtualne)
pt: Ciclismo (virtual)
ru: Велосипед (виртуальный)

source: Halfbike
hr: Polubicikl
pl: Półrower
ru: Халфбайк

source: Hiking
de: Wandern
es: Senderismo
eu: Mendi ibilaldia
fr: Randonnée
gl: Sendeirismo
hr: Planinarenje
nl: Trektocht
pl: Piesza wycieczka
pt: Caminhada
ru: Хайкинг

source: Kayaking
de: Kajakfahren
es: Kayak
eu: Kayak
fr: Kayak
gl: Piragüismo (caiac)
hr: Vožnja kajakom
nl: Kayakken
pl: Kajakarstwo
ru: Гребля на каяке

source: Mountain Biking
de: Mountainbiken
es: Bicicleta por Montaña
eu: Mendiko bizikleta
fr: VTT
gl: Ciclismo por Montaña
hr: Brdski biciklizam
nl: Mountainbiken
pl: Kolarstwo górskie
pt: Bicicleta de montanha
ru: Горный велосипед

source: Mountain Biking (Electric)
de: Mountainbiken (elektrisch)
es: Bicicleta (Eléctrica) por Montaña
eu: Mendiko bizikleta (elektrikoa)
fr: VTT (Électrique)
gl: Ciclismo por Montaña (Eléctrica)
hr: Brdski biciklizam (električni)
nl: Mountainbiken (Elektrisch)
pl: Kolarstwo górskie (Elektryczne)
pt: Bicicleta de montanha (elétrica)
ru: Горный велосипед (электро)

source: Mountaineering
de: Bergsteigen
es: Montañismo
eu: Mendizaletasuna
fr: Alpinisme
gl: Montañismo
hr: Alpinizam
nl: Bergbeklimmen
pl: Alpinizm
pt: Montanhismo
ru: Альпинизм

source: Open Water Swimming
de: Offenes Schwimmen im Wasser
es: Natación en aguas abiertas
eu: Ur irekietako igeriketa
fr: Nage en eau libre
gl: Natación Auga Aberta
hr: Plivanje u otvorenim vodama
nl: Zwemmen (open water)
pl: Pływanie na wodach otwartych
pt: Natação em águas abertas
ru: Плавание на открытой воде

source: Paragliding
de: Paragliden
es: Parapente
eu: Parapentea
fr: Parapente
gl: Paracaidismo
hr: Paraglajding
nl: Paragliden
pl: Paralotniarstwo
pt: Parapente
ru: Парапланеризм

source: Rowing
de: Rudern
es: Remo
eu: Arrauna
fr: Aviron
gl: Remo
hr: Veslanje
nl: Roeien
pl: Wioślarstwo
pt: Remo
ru: Гребля

source: Running
de: Laufen
es: Correr
eu: Korrika egitea
fr: Course
gl: Correr
hr: Trčanje
nl: Lopen
pl: Bieg
pt: Correr
ru: Бег

source: Skiing (Alpine)
de: Skifahren (Alpin)
es: Esquí (Alpino)
eu: Eskia (alpinoa)
fr: Ski (Alpin)
gl: Esquí (Alpino)
hr: Skijanje
nl: Skiën (Alpine)
pl: Narciarstwo alpejskie
pt: Esqui (alpino)
ru: Горные лыжи

source: Skiing (Cross Country)
de: Skifahren (Langlauf)
es: Esquí de travesía
eu: Mendiko eskia
fr: Ski (Randonnée)
gl: Esquí (de travesía)
hr: Skijaško trčanje
nl: Skiën (Cross Country)
pl: Narciarstwo biegowe
pt: Passeio de esqui
ru: Лыжные гонки

source: Snowshoes
de: Schneeschuhe
es: Raquetas de nieve
eu: Erraketak
fr: Raquettes
gl: Raquetas de neve
hr: Krpljanje
nl: Sneeuwschoenen
pl: Rakiety śnieżne
ru: Снегоступы

source: Standup Paddleboarding
es: Paddle Surf
fr: Stand up paddle
gl: Padexar de pé na táboa
hr: Uspravno veslanje na dasci
nl: Standup Paddleboarding (SUP)
pl: Pływanie na desce z wiosłem
ru: Сапсёрфинг

source: Swimrun
de: Schwimmlauf
eu: Igerikorrika
hr: Plivanje i trčanje (swimrun)
nl: Zwemloop
ru: Свимран

source: Tennis (Outdoor)
fr: Tennis (Extérieur)
gl: Tenis (Exterior)
hr: Tenis (na otvorenom)
nl: Tennis (Buiten)
pl: Tenis
ru: Теннис (на улице)

source: Trail
es: Ruta
eu: Mendiko lasterketa
hr: Trail trčanje
nl: Traillopen
pl: Szlak
ru: Трейл

source: Walking
de: Gehen
es: Caminar
eu: Oinez ibiltzea
fr: Marche
gl: Camiñar
hr: Šetnja
nl: Wandelen
pl: Chód
pt: Andar
ru: Ходьба

source: Windsurfing
es: Windsurf
eu: Windsurf
fr: Planche à voile
gl: Windsurf
hr: Jedrenje na dasci
nl: Windsurfen
ru: Виндсёрфинг

source: Latest public workouts on FitTrackee from %(username)s
fr: Dernières séances publiques de %(username)s sur FitTrackee
gl: Últimas actividades públicas de %(username)s en FitTrackee
hr: Posljednje javne aktivnosti na FitTrackee od %(username)s
nl: Laatste publieke trainingen op FitTrackee van %(username)s
pl: Ostanie publiczne treningi %(username)s na FitTrackee

source: %(username)s's workouts feed
fr: Flux de séances de %(username)s
gl: Canle de actividades de %(username)s
hr: Kanal aktivnosti od %(username)s
nl: %(username)s's trainingen
pl: kanał z treningami %(username)s

source: Workout map
de: Workout-Karte
es: mapa del entrenamiento
eu: Ekintzaren mapa
fr: Carte de la séance
gl: actividade no mapa
hr: Karta aktivnosti
nl: Kaart training
pl: Mapa treningu
pt: Mapa de treino
ru: карта тренировки

source: Duration
de: Dauer
es: Tiempo
eu: Iraupena
fr: Durée
gl: Duración
hr: Vrijeme
nl: Duur
pl: Czas trwania
pt: Duração
ru: продолжительность

source: Distance
de: Entfernung
es: Distancia
eu: Distantzia
gl: Distancia
hr: Udaljenost
nl: Afstand
pl: Dystans
pt: Distância
ru: расстояние

source: Min. altitude
de: Minimale Höhe
es: Altitud mínima
eu: Altuera minimoa
fr: Altitude min.
gl: Altitude min.
hr: Min. nadmorska visina
nl: Min. hoogte
pl: Min. wysokość
pt: Altitude mínima
ru: мин. высота

source: Max. altitude
de: Maximale Höhe
es: Altitud máxima
eu: Altuera maximoa
fr: Altitude max.
gl: Altitude máx.
hr: Maks. nadmorska visina
nl: Max. hoogte
pl: Maks. wysokość
pt: Altitude máxima
ru: макс. высота

source: Ascent
de: Aufstieg
es: Ascenso
eu: Igoera
fr: Dénivelé positif
gl: Ascenso
hr: Uspon
nl: Geklommen
pl: Wzniesienie
pt: Subida
ru: набор

source: Descent
de: Abstieg
es: Descenso
eu: Jaitsiera
fr: Dénivelé négatif
gl: Descenso
hr: Silazak
nl: Gedaald
pl: Zejście
pt: Descida
ru: спуск

source: Description
de: Beschreibung
es: Descripción
eu: Deskribapena
gl: Descrición
hr: Opis
nl: Beschrijving
pl: Opis
pt: Descrição
ru: Описание
