Repository: SamR1/FitTrackee
Catalog: fittrackee/translations/*/LC_MESSAGES/messages.po
Languages: de, es, eu, fr, gl, hr, nl, pl, pt, ru

source: Hi %(username)s,
de: Hallo %(username)s,
es: Hola %(username)s,
eu: Kaixo %(username)s,
fr: Bonjour %(username)s,
gl: Ola %(username)s,
hr: Pozdrav %(username)s,
nl: Dag %(username)s,
pl: Cześć %(username)s,
pt: Olá %(username)s,
ru: Привет %(username)s,

source: For security, this request was received from a %(operating_system)s device using %(browser_name)s.
de: Zur Sicherheit: Diese Anfrage wurde von einem %(operating_system)s Gerät mit %(browser_name)s ausgelöst.
es: Por seguridad, esta solicitud se ha recibido desde un dispositivo %(operating_system)s usando %(browser_name)s.
eu: Segurtasunagatik, eskaera hau %(browser_name)s nabigatzailea duen %(operating_system)s gailu batetik jaso dela jakinarazten dizugu.
fr: Pour vérification, cette demande a été reçue à partir d'un appareil sous %(operating_system)s, utilisant le navigateur %(browser_name)s.
gl: Por seguridade, recibiuse a solicitude desde un dispositivo %(operating_system)s usando %(browser_name)s.
hr: Radi sigurnosti, ovaj je zahtjev primljen s uređaja %(operating_system)s koji koristi %(browser_name)s.
nl: Voor beveiliging, werd deze aanvraag ontvangen van een %(operating_system)s apparaat via %(browser_name)s.
pl: Dla bezpieczeństwa, to żądanie zostało wysłane z %(operating_system)s używającego %(browser_name)s.
pt: Por segurança, esta solicitação foi recebida de um dispositivo com %(operating_system)s usando %(browser_name)s.
ru: Для безопасности, этот запрос был получен через %(browser_name)s, работающий под управлением %(operating_system)s.

source: Thanks,
de: Danke
es: Gracias,
eu: Eskerrik asko,
fr: Merci,
gl: Grazas,
hr: Hvala,
nl: Bedankt,
pl: Dzięki,
pt: Obrigado,
ru: Спасибо,

source: The FitTrackee Team
de: Dein FitTrackee-Team
es: El Equipo FitTrackee
eu: FitTrackee taldea
fr: L'équipe FitTrackee
gl: O Equipo FitTrackee
hr: Tim FitTrackee
nl: Het FitTrackee Team
pl: Ekipa FitTrackee
pt: A equipe FitTrackee
ru: Команда FitTrackee

source: Confirm your account
de: Bestätige dein Konto
es: Confirmar mi cuenta
eu: Baieztatu zure kontua
fr: Confirmer votre inscription
gl: Confirma a túa conta
hr: Potvrdite svoj račun
nl: Bevestig uw account
pl: Potwierdź swoje konto
pt: Confirmar minha conta
ru: Подтвердите ваш аккаунт

source: Use this link to confirm your account.
de: Verwendet diesen Link, um Dden Konto zu bestätigen.
es: Usa este enlace para confirmar tu cuenta.
eu: Erabili esteka hau zure kontua baieztatzeko.
fr: Utilisez ce lien pour confirmer votre inscription.
gl: Usa esta ligazón para confirmar a conta.
hr: Koristite ovu poveznicu da potvrdite svoj račun.
nl: Gebruik deze link om uw account te bevestigen.
pl: Użyj tego linka aby potwierdzić swoje konto.
pt: Use este link para confirmar sua conta.
ru: Используйте эту ссылку для подтверждения вашей учетной записи.

source: You have created an account on FitTrackee.
de: Du hast ein Konto bei FitTrackee angelegt.
es: Has creado una cuenta en FitTrackee.
eu: FitTrackeen kontu bat sortu duzu.
fr: Vous avez créé un compte sur FitTrackee.
gl: Creaches unha conta en FitTrackee.
hr: Kreirali ste račun na FitTrackee.
nl: U hebt een account aangemaakt op FitTrackee.
pl: Stworzyłeś konto na FitTrackee.
pt: Você criou uma conta no FitTrackee.
ru: Вы создали аккаунт на FitTrackee.

source: Use the button below to confirm your address email.
de: Verwende die unteren Schaltfläche, um deine E-Mail-Adresse zu bestätigen.
es: Usa el botón inferior para confirmar tu dirección de correo.
eu: Erabili beheko botoia zure eposta helbidea baieztatzeko.
fr: Cliquez sur le bouton pour confirmer votre adresse électronique.
gl: Usa o botón inferior para confirmar o enderezo do teu correo.
hr: Upotrijebite gumb u nastavku da biste potvrdili svoju adresu e-pošte.
nl: Gebruik de onderstaande knop om uw email adres te bevestigen.
pl: Użyj poniższego przycisku aby potwierdzić swój adres e-mail.
pt: Use o botão abaixo para confirmar seu endereço de e-mail.
ru: Используйте кнопку ниже, чтобы подтвердить адрес электронной почты.

source: Verify your email
de: Bestätige deine E-Mail
es: Verifica tu email
eu: Egiaztatu zure eposta
fr: Vérifier l'adresse électronique
gl: Verifica o enderezo de correo
hr: Potvrdite svoju e-poštu
nl: Verifieer uw email
pl: Potwierdź swój adres e-mail
pt: Verifique seu e-mail
ru: Подтвердите свою электронную почту

source: If this account creation wasn't initiated by you, please ignore this email.
de: Falls die Kontoerstellung nicht von Dir initiiert wurde, ignoriere diese E-Mail bitte.
es: Si no has iniciado la creación de esta cuenta, por favor ignora este correo.
eu: Kontu honen sorrera zuk ez baduzu eskatu, ez egin kasu mezu honi.
fr: Si vous n'êtes pas à l'origine de la création de ce compte, vous pouvez ignorer ce courriel.
gl: Se non iniciaches ti a creación da conta, ignora este correo electrónico.
hr: Ako ovu izradu računa niste inicirali vi, zanemarite ovu e-poruku.
nl: Indien u deze account niet hebt aangemaakt, gelieve deze email te negeren.
pl: Jeśli nie zlecałeś(-aś) utworzenia konta, proszę zignoruj tę wiadomość.
pt: Se você ainda não começou a criar esta conta, ignore este e-mail.
ru: Если вы не инициировали создание этой учетной записи, просто проигнорируйте это письмо.

source: If you're having trouble with the button above, copy and paste the URL below into your web browser.
de: Falls du Probleme mit der oberen Schaltfläche hast, kopiere diese URL und gebe sie in deinen Webbrowser ein.
es: Si tienes problemas con el botón superior, copia y pega la URL inferior en tu navegador web.
eu: Goiko botoiarekin arazoak badituzu, kopiatu eta itsatsi helbide hau zure nabigatzailean.
fr: Si vous avez des problèmes avec le bouton, vous pouvez copier et coller le lien suivant dans votre navigateur.
gl: Se tes problemas co botón superior, copia e pega o URL inferior no teu navegador web.
hr: Ako imate problema s gornjim gumbom, kopirajte i zalijepite donji URL u svoj web preglednik.
nl: Als u problemen hebt met bovenstaande knop, kopieer en plak de onderstaande URL in uw web browser.
pl: Jeśli masz problem z powyższym przyciskiem, skopiuj i wklej poniższy adres do swojej przeglądarki.
pt: Se estiver com problemas com o botão superior, copie e cole o URL inferior em seu navegador.
ru: Если у вас возникают проблемы с кнопкой выше, скопируйте и вставьте приведённую ниже ссылку в адресную строку вашего браузера.

source: Use the link below to confirm your address email.
de: Verwende den unteren Link, um deine E-Mail-Adresse zu bestätigen.
es: Usa la dirección inferior para confirmar tu dirección de correo.
eu: Erabili beheko esteka zure eposta helbidea baieztatzeko.
fr: Cliquez sur le lien ci-dessous pour confirmer votre adresse électronique.
gl: Usa a ligazón inferior para confirmar o teu enderezo de correo.
hr: Upotrijebite poveznicu u nastavku da potvrdite svoju adresu e-pošte.
nl: Gebruik de onderstaande link om uw email adres te bevestigen.
pl: Użyj poniższego linka by potwierdzić swój adres e-mail.
pt: Use o endereço abaixo para confirmar seu endereço de e-mail.
ru: Используйте ссылку ниже, чтобы подтвердить ваш адрес электронной почты.

source: Warning for %(username)s lifted
de: Warn-Level für %(username)s erhöht
es: Advertencia para %(username)s levantada
eu: %(username)s erabiltzailearen ohartarazpena bertan behera utzi da
fr: Avertissement levé pour %(username)s
gl: Levantouse a advertencia a %(username)s
hr: Upozorenje za %(username)s je povučeno
nl: Waarschuwing voor %(username)s is verwijderd
pl: Ostrzeżenie dla %(username)s zostało zniesione
ru: Предупреждение для %(username)s снято

source: Your appeal has been rejected
de: Dein Einspruch wurde abgelehnt
es: Su recurso ha sido rechazado
eu: Zure apelazioa baztertu egin da
fr: Votre appel a été rejeté
gl: Rexeitouse a túa apelación
hr: Vaša žalba je odbijena
nl: Uw beroep is niet onontvankelijk verklaard
pl: Twoje odwołanie zostało odrzucone
ru: Ваша апелляция отклонена

source: Your appeal on your account suspension has been rejected
de: Ihr Einspruch in Bezug auf die Sperrung Ihres Kontos wurde abgelehnt
es: Su recurso sobre la suspensión de su cuenta ha sido rechazado
eu: Zure kontua bertan behera uztearen inguruko apelazioa baztertu egin da
fr: Votre appel sur la suspension de votre compte a été rejeté
gl: Rexeitouse a apelación para a suspensión da conta
hr: Vaša žalba na obustavu vašeg računa je odbijena
nl: Uw beroep tegen het verwijderen van uw account is onontvankelijk verklaard
pl: Twoje odwołanie dla zawieszenie konta zostało odrzucone
ru: Ваша апелляция по поводу блокировки аккаунта была отклонена

source: Your appeal on your warning has been rejected
de: Ihr Einspruch gegen die Warnung bezüglich Ihres Kontos wurde zurückgewiesen
es: Su recurso sobre su advertencia ha sido rechazado
eu: Zure ohartarazpenaren gaineko apelazioa baztertu egin da
fr: Votre appel sur votre avertissement été rejeté
gl: Rexeitouse a apelación para a advertencia recibida
hr: Vaša žalba na upozorenje je odbijena
nl: Uw beroep tegen uw waarschuwing is onontvankelijk verklaard
pl: Twoje odwołanie dla ostrzeżenia zostało odrzucone
ru: Ваша апелляция по поводу предупреждения была отклонена

source: Your appeal on the following content suspension has been rejected
de: Ihr Einspruch gegen die Aussetzung folgender Inhalte wurde abgelehnt
es: Su recurso sobre la suspensión del siguiente contenido ha sido rechazado
eu: Ondorengo edukia bertan behera uztearen inguruko zure apelazioa baztertu egin da
fr: Votre appel sur la suspension du contenu suivant a été rejeté
gl: Rexeitouse a apelación para a suspensión do seguinte contido
hr: Vaša žalba na suspenziju sljedećeg sadržaja je odbijena
nl: Uw beroep tegen volgende inhoudsblokkering is onontvankelijk verklaard
pl: Twoje odwołanie dla zawieszonych treści zostało odrzucone
ru: Ваша апелляция по поводу блокировки следующего контента была отклонена

source: Comment:
de: Kommentar:
es: Comentario:
eu: Iruzkina:
fr: Commentaire :
gl: Comentario:
hr: Komentar:
nl: Reageer:
pl: Komentarz:
ru: Комментарий:

source: Workout:
de: Training:
es: Entrenamiento:
eu: Ekintza:
fr: Séance :
gl: Actividade:
hr: Aktivnost:
nl: Training:
pl: Trening:
ru: Тренировка:

source: Link:
es: Enlace:
eu: Esteka:
fr: Lien :
gl: Ligazón:
hr: Poveznica:
ru: Ссылка:

source: Appeal rejected
de: Einspruch abgelehnt
es: Recurso desestimado
eu: Apelazioa baztertuta
fr: Appel rejeté
gl: Apelación rexeitada
hr: Žalba je odbijena
nl: Beroep onontvankelijk verklaard
pl: Odwołanie odrzucone
ru: Апелляция отклонена

source: Your comment has been suspended
de: Dein Kommentar wurde deaktiviert
es: Su comentario ha sido suspendido
eu: Zure iruzkina bertan behera utzi da
fr: Votre commentaire a été suspendu
gl: Suspendeuse o teu comentario
hr: Vaš komentar je suspendiran
nl: Uw commentaar is geblokeerd
pl: Twój komentarz został zawieszony
ru: Ваш комментарий был удалён

source: Your comment has been suspended, it is no longer visible
de: Ihr Kommentar wurde gesperrt, er ist nicht mehr länger sichtbar
es: Su comentario ha sido suspendido, no será visible
eu: Zure iruzkina bertan behera utzi da, ez da gehiago ikusiko
fr: Votre commentaire a été suspendu, il n'est plus visible
gl: Suspendeuse o teu comentario, xa non é visible
hr: Vaš komentar je suspendiran, više nije vidljiv
nl: Uw commentaar is geblokkeerd, het is niet langer zichtbaar
pl: Twój komentarz został zawieszony i nie jest już widoczny
ru: Ваш комментарий был скрыт и теперь не отображается

source: Reason:
de: Grund:
es: Razón:
eu: Arrazoia:
fr: Raison :
gl: Razón:
hr: Razlog:
nl: Reden:
pl: Powód:
ru: Причина:

source: If you think this is an error, you can appeal:
de: Wenn Sie dies für einen Fehler halten, können Sie Einspruch einlegen:
es: si cree que se trata de un error, puede recurrir:
eu: Errorea dela uste baduzu, apelazioa egin dezakezu:
fr: Si vous pensez qu'il s'agit d'une erreur, vous pouvez faire appel :
gl: Se cres que é un erro podes apelar:
hr: Ako mislite da je ovo pogreška, možete se žaliti:
nl: Als je denkt dat dit foutief is, kun je beroep aantekenen:
pl: Jeśli uważasz to za błąd, możesz się odwołać:
ru: Если вы считаете, что это ошибка, вы можете подать апелляцию:

source: Appeal
de: Einspruch
es: Apelar
eu: Apelazioa
fr: Faire appel
gl: Apelación
hr: Žalba
nl: Beroep aantekenen
pl: Odwołanie
ru: Апелляция

source: The suspension on your comment has been lifted
de: Die Deaktivierung Deines Kommentars wurde aufgehoben
es: La suspensión de su comentario ha sido levantada
eu: Zure iruzkina bertan behera uztea bertan behera utzi da
fr: La suspension de votre commentaire a été levée
gl: Levantouse a suspensión do teu comentario
hr: Suspenzija vašeg komentara je povučena
nl: De blokkering van jouw commentaar is weggehaald
pl: Zawieszenie twojego komentarza zostało zdjęte
ru: Блокировка вашего комментария снята

source: The suspension on your comment has been lifted, it is visible again
de: Die Sperrung Ihres Kommentars wurde aufgehoben, er ist wieder sichtbar
es: La suspensión de su comentario ha sido levantada, es visible de nuevo
eu: Zure iruzkina bertan behera uztea bertan behera utzi da, berriro ikusi daiteke
fr: La suspension de votre commentaire a été levée, il est visible à nouveau
gl: Levantouse a suspensión do teu comentario, volve a ser visible
hr: Suspenzija vašeg komentara je povučena, ponovno je vidljiv
nl: De blokkering van uw commentaar is weggehaald, het is terug zichtbaar
pl: Zawieszenie komentarza zostało zniesione, jest ponownie widoczny
ru: Блокировка вашего комментария снята, теперь он снова виден

source: Your archive is ready to be downloaded
de: Dein Archiv ist bereit zum Download
es: Tu archivo está listo para ser descargado
eu: Zure artxiboa deskargatzeko prest dago
fr: Votre archive est prête à être téléchargée
gl: O arquivo está listo para descargar
hr: Vaša je arhiva spremna za preuzimanje
nl: Uw archief is klaar om te downloaden
pl: Twoje archiwum jest gotowe do pobrania
pt: O arquivo está pronto para fazer download
ru: Ваш архив готов к загрузке

source: A download link is available in your account.
de: Ein Download-Link ist auf deinem Account verfügbar.
es: Tienes un enlace de descarga disponible en tu cuenta.
eu: Deskargatzeko esteka zure kontuan ikusi dezakezu.
fr: Un lien de téléchargement est disponible dans votre compte.
gl: Tes unha ligazón de descarga dispoñible na túa conta.
hr: Veza za preuzimanje dostupna je na vašem računu.
nl: Een download link is beschikbaar in uw account.
pl: Link do pobierania jest dostępny na Twoim koncie.
pt: O link para download disponível em sua conta.
ru: Ссылка для скачивания доступна в вашем аккаунте.

source: You have requested an export of your account on FitTrackee.
de: Du hast eine Anfrage zum Export deines FitTrackee-Accounts gestellt.
es: Has solicitado la exportación de tu cuenta en FitTrackee.
eu: FitTrackeeko datuak esportatzeko eskaera egin duzu.
fr: Vous avez demandé un export des données de votre compte sur FitTrackee.
gl: Solicitaches exportar a túa conta de FitTrackee.
hr: Zatražili ste izvoz vašeg računa na FitTrackee.
nl: U hebt een export van uw account aangevraagd op FitTrackee.
pl: Zlecono eksport Twojego konta na FitTrackee.
pt: Solicitou a exportação da sua conta FitTrackee.
ru: Вы запросили экспорт вашей учетной записи на FitTrackee.

source: The archive is now ready to be downloaded from your account.
de: Das Archiv kann jetzt von deinem Account heruntergeladen werden.
es: El archivo está listo para ser descargado desde tu cuenta.
eu: Fitxategia zure kontutik deskargatu dezakezu.
fr: L'archive est maintenant prête à être téléchargée depuis votre compte.
gl: O arquivo está dispoñible na túa conta para ser descargado.
hr: Arhiva je sada spremna za preuzimanje s vašeg računa.
nl: Het archief kan nu gedownload worden van uw account.
pl: Archiwum jest już gotowe do pobrania z Twojego konta.
pt: O arquivo está pronto para ser download da sua conta.
ru: Архив теперь готов к скачиванию из вашего аккаунта.

source: Download your archive
de: Dein Archiv herunterladen
es: Descarga tu archivo
eu: Deskargatu zure fitxategia
fr: Télécharger votre archive
gl: Descarga o teu arquivo
hr: Preuzmite svoju arhivu
nl: Download uw archief
pl: Pobierz swoje archiwum
pt: Download do seu arquivo
ru: Скачать архив

source: If you did not request the export, please change your password immediately or contact your administrator if your account is locked.
de: Wenn du den Export nicht angefragt hast, ändere dein Passwort sofort oder frage deinen Administrator, ob dein Account gesperrt ist.
es: Si no has solicitado la exportación, cambia inmediatamente la contraseña o contacta con la administración si tu cuenta está bloqueada.
eu: Zuk ez baduzu esportazioa eskatu, aldatu berehala zure pasahitza edo jarri kontaktuan kudeatzailearekin zure kontua blokeatuta badago.
fr: Si vous n'êtes pas à l'origine de cette demande, veuillez changer votre mot de passe immédiatement ou contacter l'administrateur si votre compte est bloqué.
gl: Se non solicitaches a exportación, cambia agora mesmo o contrasinal ou contacta coa administración se a conta está bloqueada.
hr: Ako niste zatražili izvoz, odmah promijenite lozinku ili kontaktirajte svog administratora ako je vaš račun zaključan.
nl: Als u deze export niet hebt aangevraagd, gelieve uw wachtwoord onmiddelijk te veranderen of neem contact op met uw administrator als uw account is vergrendeld.
pl: Jeśli nie zlecałeś(-aś) eksportu, zmień hasło do swojego konta lub skontaktuj się z administratorem, jeśli twoje konto jest zablokowane.
pt: Caso não tenha solicitado a exportação, altere imediatamente sua senha ou entre em contato com a administração caso sua conta esteja bloqueada.
ru: Если вы не запрашивали экспорт, пожалуйста, немедленно смените пароль или свяжитесь с администратором, ваш аккаунт заблокируют.

source: Email changed
de: E-Mail-Adresse geändert
es: Email cambiado
eu: Eposta helbidea aldatu egin da
fr: Adresse électronique modifiée
gl: Enderezo cambiado
hr: Adresa e-pošte je promijenjena
nl: Email aangepast
pl: Adres e-mail zmieniony
pt: E-mail alterado
ru: Электронная почта изменена

source: Your email is being updated.
de: Deine E-Mail-Adresse wurde aktualisiert.
es: Tu email ha sido actualizado.
eu: Zure eposta helbidea aldatzen ari da.
fr: Votre adresse électronique est en cours de mise à jour.
gl: Estase actualizando o enderezo de correo.
hr: Vaša adresa e-pošte se ažurira.
nl: Uw email wordt aangepast.
pl: Twój adres e-mail jest aktualizowany.
pt: Seu e-mail foi atualizado.
ru: Ваша электронная почта обновлена.

source: You recently requested to change your email address for your FitTrackee account to:
de: Du hast kürzlich beantragt, die E-Mail-Adresse deines FitTrackee-Kontos zu ändern. Neue Adresse:
es: Recientemente has solicitado cambiar tu dirección de correo en tu instancia FitTrackee a:
eu: Zure FitTrackee kontuko eposta helbidea aldatzeko eskatu duzu. Berria hauxe da:
fr: Vous avez récemment demandé la modification de l'adresse électronique associée à votre compte sur FitTrackee vers :
gl: Recentemente solicitaches cambiar o enderezo de correo da túa conta FitTrackee a:
hr: Nedavno ste zatražili promjenu adrese e-pošte za svoj FitTrackee račun na:
nl: U hebt een aanvraag ingediend om uw email adres voor uw FitTrackee account te veranderen naar:
pl: Zleciłeś(-aś) niedawno zmianę swojego adresu e-mail do konta FitTrackee na:
pt: Recentemente, solicitou a alteração do seu endereço de e-mail na conta do FitTrackee para:
ru: Вы недавно запросили изменение адреса электронной почты для вашей учетной записи FitTrackee на:

source: If this email change wasn't initiated by you, please change your password immediately or contact your administrator if your account is locked.
de: Falls die Änderung der E-Mail-Adresse nicht von Dir initiiert wurde, ändere bitte sofort Dein Passwort oder kontaktiere den Administrator, falls dein Konto gesperrt ist.
es: Si no has solicitado este cambio de email, por favor cambia inmediatamente tu contraseña o contacta con la administración si tu cuenta está bloqueada.
eu: Eposta aldaketa hau zuk ez baduzu eskatu, aldatu berehala zure pasahitza edo jarri kontaktuan kudeatzailearekin zure kontua blokeatuta badago.
fr: Si vous n'êtes pas à l'origine de cette modification, veuillez changer votre mot de passe immédiatement ou contacter l'administrateur si votre compte est bloqué.
gl: Se non solicitaches este cambio, cambia agora mesmo o contrasinal ou contacta coa administración se a conta está bloqueada.
hr: Ako ovu promjenu adrese e-pošte niste pokrenuli vi, odmah promijenite lozinku ili kontaktirajte svog administratora ako je vaš račun zaključan.
nl: Indien deze verandering niet door u werd aangevraagd, gelieve uw wachtwoord dan onmiddellijk te veranderen of contacteer uw administrator als uw account is vergrendeld.
pl: Jeśli nie zlecałeś(-aś) zmiany adresu e-mail, zmień hasło do swojego konta lub skontaktuj się z administratorem, jeśli twoje konto jest zablokowane.
pt: Se não solicitou esta alteração do e-mail, altere sua senha imediatamente ou entre em contato com a administração caso sua conta esteja bloqueada.
ru: Если изменение адреса электронной почты не было инициировано вами, немедленно измените свой пароль или обратитесь к администратору, если ваша учетная запись заблокирована.

source: Confirm email change
de: E-Mail-Änderung bestätigen
es: Confirma el cambio de email
eu: Baieztatu eposta aldaketa
fr: Confirmer le changement d'adresse électronique
gl: Confirma o cambio de enderezo
hr: Potvrdite promjenu adrese e-pošte
nl: Bevestig email verandering
pl: Potwierdź zmianę adresu e-mail
pt: Confirmação de alteração do e-mail
ru: Подтвердить изменение электронной почты

source: Use this link to confirm email change.
de: Verwende den unteren Link, um deine Adresse zu bestätigen.
es: Usa este enlace para confirmar el cambio de email.
eu: Erabili esteka hau zure eposta aldatzea baieztatzeko.
fr: Confirmer le changement d'adresse électronique.
gl: Usa esta ligazón para confirmar o cambio.
hr: Koristite ovu poveznicu za potvrdu promjene adrese e-pošte.
nl: Gebruik deze link om uw email verandering te bevestigen.
pl: Użyj tego linku aby potwierdzić zmianę adresu e-mail.
pt: Use este link para confirmar a alteração do e-mail.
ru: Используйте эту ссылку, чтобы подтвердить изменение электронной почты.

source: You recently requested to change your email address for your FitTrackee account.
de: Du hast kürzlich beantragt, die E-Mail-Adresse deines FitTrackee-Kontos zu ändern.
es: Has solicitado recientemente cambiar la dirección de email de tu cuenta FitTrackee.
eu: Zure FitTrackee kontuko eposta helbidea aldatzea eskatu duzu berriki.
fr: Vous avez récemment demandé la modification de l'adresse électronique associée à votre compte sur FitTrackee.
gl: Recentemente solicitaches cambiar o enderezo de correo da túa conta FitTrackee.
hr: Nedavno ste zatražili promjenu adrese e-pošte za svoj FitTrackee račun.
nl: U hebt aangevraagd om uw email adres voor uw FitTrackee account te veranderen.
pl: Zleciłeś(-aś) niedawno zmianę swojego adresu e-mail do konta FitTrackee.
pt: Recentemente, solicitou a alteração do endereço e-mail da sua conta FitTrackee.
ru: Вы недавно запросили изменение адреса электронной почты для вашей учетной записи FitTrackee.
