{
  "ERROR": {
    "<time> is missing in gpx file": "Elément <time> manquant dans le fichier .gpx.",
    "Network Error": "Erreur réseau.",
    "UNKNOWN": "Erreur. Veuillez réessayer ou contacter l'administrateur.",
    "a report already exists": "Vous avez déjà soumis un signalement.",
    "at least one file in zip archive exceeds size limit, please check the archive": "Au moins un fichier de l'archive zip dépasse la taille maximale, veuillez vérifier l'archive.",
    "comment already reactivated": "Le commentaire est déjà réactivé, veuillez rafraîchir la page.",
    "comment already suspended": "Le commentaire est déjà suspendu, veuillez rafraîchir la page.",
    "comment has been reactivated after appeal": "Le commentaire a été réactivé après appel.",
    "completed request already exists": "Une demande d'export terminée existe déjà.",
    "email: valid email must be provided": "Courriel : une adresse électronique valide doit être fournie.",
    "equipment already exists with the same label": "Un équipement existe déjà avec le même nom.",
    "equipment type is inactive": "Le type d'équipement est désactivé.",
    "error during gpx file parsing": "Erreur lors de l'analyse du fichier.",
    "error during gpx processing": "Erreur lors du traitement du fichier gpx.",
    "error on getting configuration": "Erreur lors de la récupération de la configuration.",
    "error when getting timezones": "Error lors de la récupération des fuseaux horaires.",
    "error when saving workout": "Erreur lors de l'enregistrement de la séance.",
    "error when updating configuration": "Erreur lors de la mise à jour de la configuration.",
    "error while fetching comments": "Erreur lors de la récupération des commentaires.",
    "error, please try again or contact the administrator": "Erreur, veuillez réessayer ou contacter l'administrateur.",
    "error, registration is disabled": "Erreur, les inscriptions sont désactivées.",
    "file extension not allowed": "Extension de fichier non autorisée.",
    "file size is greater than the allowed size": "La taille du fichier est supérieure à la limite autorisée.",
    "gpx file is invalid": "Le fichier .gpx est invalide.",
    "invalid credentials": "Identifiants invalides.",
    "invalid payload": "Données fournies incorrectes.",
    "invalid token, please log in again": "Jeton de connexion invalide, merci de vous reconnecter.",
    "invalid token, please request a new token": "Jeton de connexion invalide, veuillez demander un nouveau jeton.",
    "max files in a zip archive must be equal or greater than max files in a zip archive processed synchronously": "Le nombre max. de fichiers dans une archive doit être supérieur ou égal au nombre max. de fichiers à traiter en synchrone.",
    "new email must be different than current email": "La nouvelle adresse électronique doit être différente de l'adresse actuelle.",
    "no file part": "Pas de fichier fourni.",
    "no selected file": "Pas de fichier sélectionné.",
    "no tracks in gpx file": "Pas de trace (<trk>) dans le fichier .gpx.",
    "one or more values, entered or calculated, exceed the limits": "Une ou plusieurs valeurs, saisies ou calculées, dépassent les limites.",
    "ongoing request exists": "Une demande d'exportation de données existe déjà.",
    "password: password and password confirmation do not match": "Mot de passe : les mots de passe saisis sont différents.",
    "provide a valid auth token": "Merci de fournir un jeton de connexion valide.",
    "signature expired, please log in again": "Signature expirée. Merci de vous reconnecter.",
    "sorry, that username is already taken": "Désolé, ce nom d'utilisateur est déjà utilisé.",
    "sport does not exist": "Ce sport n'existe pas.",
    "successfully registered": "Inscription validée.",
    "the number of files in the archive exceeds the limit": "Le nombre de fichiers de l'archive dépasse la limite.",
    "user account already reactivated": "Le compte de l'utilisateur est déjà réactivé, veuillez rafraîchir la page.",
    "user account already suspended": "Le compte de l'utilisateur est déjà suspendu, veuillez rafraîchir la page.",
    "user account has already been reactivated": "Le compte utilisateur a déjà été réactivé.",
    "user account has been reactivated after appeal": "Le compte utilisateur a été réactivé après appel.",
    "user already warned": "L'utilisateur a déjà reçu un avertissement.",
    "user does not exist": "L'utilisateur n'existe pas.",
    "user with owner rights can not be modified": "Un utilisateur avec un rôle Propriétaire ne peut pas être modifié.",
    "valid email must be provided for admin contact": "Une adresse électronique doit être fournie pour le contact de l'administrateur.",
    "workout already reactivated": "La séance a déjà été réactivée, veuillez rafraîchir la page.",
    "workout already suspended": "La séance est déjà suspendu, veuillez rafraîchir la page.",
    "workout has been reactivated after appeal": "La séance a été réactivée après appel.",
    "you can appeal only once": "Vous ne pouvez faire appel qu'une seule fois.",
    "you can not delete your account, no other user has admin rights": "Vous ne pouvez pas supprimer votre compte, aucun autre utilisateur n'a des droits d'administration.",
    "you do not have permissions": "Vous n'avez pas les permissions nécessaires.",
    "you do not have permissions, your account is suspended": "Vous n'avez pas les permissions nécessaires, votre compte a été suspendu."
  }
}
