Repository: SamR1/FitTrackee
Catalog: docsrc/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: Get workout segment GeoJSON, when segment has geometry
fr: Obtenir le GeoJSON du segment, quand le segment a une géométrie.

source: segment short id
fr: id court du segment

source: [REMOVED] Get gpx file for a workout displayed on map with Leaflet
fr: [SUPPRIMÉ] Obtenir un fichier gpx pour une séance affichée sur une carte avec Leaflet.

source: GONE
fr: aucune.

source: [REMOVED] Get gpx file for a workout segment displayed on map with Leaflet.
fr: [SUPPRIMÉ] Obtenir un fichier gpx pour le segment d'une séance pour l'afficher sur la carte avec Leaflet.

source: segment id
fr: identifiant du segment

source: Get chart data to display it with Chart.js.
fr: Récupérer les données d'une séance pour les afficher avec Chart.js.

source: Get chart data from a workout gpx file, to display it with Chart.js.
fr: Récupérer les données d'une séance avec gpx pour les afficher avec Chart.js.

source: Get map image for workouts with gpx.
fr: Obtenir l'image de la carte pour les séances avec gpx.

source: workout map id
fr: identifiant de la carte de la séance

source: Get map tile from tile server.
fr: Obtenir une tuile de la carte à partir du serveur de tuiles.

source: subdomain
fr: sous-domaine

source: index of the tile along the map's x axis
fr: index de la tuile sur l'axe x de la carte

source: index of the tile along the map's y axis
fr: index de la tuile sur l'axe y de la carte

source: Status codes are status codes returned by tile server
fr: Les codes d'état sont des codes d'état renvoyés par le serveur de tuiles

source: Download original file (gpx, kml, tcx or fit file).
fr: Télécharger le fichier original (fichier gpx, kml, tcx ou fit).

source: Post a workout with a file.
fr: Créer une séance à partir d'un fichier gpx.

source: when upload is synchronous
fr: quand le chargement est synchrone

source: when upload is asynchronous
fr: quand le chargement est asynchrone

source: workout file or archive (allowed extensions: .gpx, .kml, .kmz, .fit, .tcx, .zip)
fr: fichier de la séance ou archive (extensions autorisées : .gpx, .kml, .kmz, .fit, .tcx, .zip)

source: sport id, equipment id, description, title, notes, visibility for workout, analysis and map for example: ``{"sport_id": 1, "notes": "", "title": "", "description": "", "analysis_visibility": "private", "map_visibility": "private", "workout_visibility": "private", "equipment_ids": []}``. Double quotes in notes, description and title must be escaped. The maximum length is 500 characters for notes, 10000 characters for description and 255 for title. Otherwise, they will be truncated. When description and title are provided, they replace the description and title from gpx file. For `equipment_ids`, the id of the equipment to associate with this workout. **Note**: for now only one equipment can be associated. If not provided and default equipment exists for sport, default equipment will be associated. Notes, description, title, equipment ids and visibility for workout, analysis and map are not mandatory. Visibility levels default to user preferences.
fr: id du sport, id de l'équipement, description, titre et notes, par exemple: ``{"sport_id": 1, "notes": "", "title": "", "description": "", "analysis_visibility": "private", "map_visibility": "private", "workout_visibility": "private", "equipment_ids": []}``. Les guillemets doubles dans les notes, la description et le titre doivent être échappés. La longueur maximale est de 500 caractères pour les notes, de 10000 caractères pour la description et de 255 caractères pour le titre. Dans le cas contraire, ils seront tronqués. Pour `equipment_ids`, l'id de l'équipement à associer à la séance. **Note**: pour le moment, seul un équipement peut être associé. Si non fourni et qu'il existe un équipement par défaut pour le sport, l'équipement par défaut sera associé. Les notes, la description, le titre, l'id de l'équipement et la visibilité pour la séance, l'analyse et la carte ne sont pas obligatoires.

source: sport id, equipment id, description, title, notes, visibility for workout, analysis and map for example: ``{"sport_id": 1, "notes": "", "title": "", "description": "", "analysis_visibility": "private", "map_visibility": "private", "workout_visibility": "private", "equipment_ids": []}``. Double quotes in notes, description and title must be escaped.
fr: id du sport, id de l'équipement, description, titre et notes (exemple : ``{"sport_id": 1, "notes": "", "title": "", "description": "", "analysis_visibility": "private", "map_visibility": "private", "workout_visibility": "private", "equipment_ids": []}``). Les guillemets doubles dans les notes, la description et le titre doivent être échappés.

source: For `equipment_ids`, the id of the equipment to associate with this workout. **Note**: for now only one equipment can be associated. If not provided and default equipment exists for sport, default equipment will be associated.
fr: Pour `equipment_ids`, l'id de l'équipement à associer à la séance. **Note**: pour le moment, un seul équipement peut être associé. Si non fourni et qu'il existe un équipement par défaut pour le sport, l'équipement par défaut sera associé.

source: Notes, description, title, equipment ids and visibility for workout, analysis and map are not mandatory. Visibility levels default to user preferences.
fr: Les notes, la description, le titre, l'id de l'équipement et la visibilité pour la séance, l'analyse et la carte ne sont pas obligatoires.

source: archive upload in progress
fr: chargement de l'archive en cours

source: workout created
fr: séance créée

source: Post a workout without gpx file.
fr: Créer une séance sans fichier gpx.

source: workout ascent (not mandatory, must be provided with descent)
fr: dénivelé positif de la séance (non obligatoire, à fournir avec le dénivelé positif)

source: workout descent (not mandatory, must be provided with ascent)
fr: dénivelé négatif de la séance (non obligatoire, à fournir avec le dénivelé positif)

source: workout description (not mandatory, max length: 10000 characters, otherwise it will be truncated)
fr: description de la séance (non obligatoire, longueur max. : 10000 caractères, dans le cas contraire elle sera tronquée)

source: workout distance in km
fr: distance de la séance en km

source: workout duration in seconds
fr: durée de la séance en secondes

source: the id of the equipment to associate with this workout. **Note**: for now only one equipment can be associated. If not provided and default equipment exists for sport, default equipment will be associated.
fr: l'id de l'équipement à associer à cette séance. **Note**: pour le moment, un seul équipement peut être associé. Si non fourni et qu'il existe un équipement par défaut pour le sport, l'équipement par défaut sera associé.

source: notes (not mandatory, max length: 500 characters, otherwise they will be truncated)
fr: notes (non obligatoire, longueur max. : 500 caractères, dans le cas contraire elles seront tronquées)

source: workout sport id
fr: identifiant du sport de la séance

source: workout title (not mandatory, max length: 255 characters, otherwise it will be truncated)
fr: titre de la séance (non obligatoire, longueur max. : 255 caractères, dans le cas contraire il sera tronqué)

source: workout date, in user timezone (format: ``%Y-%m-%d %H:%M``)
fr: date de la séance, dans le fuseau horaire de l'utilisateur (format : ``%Y-%m-%d %H:%M``)

source: workout visibility (``private``, ``followers_only`` or ``public``). Not mandatory, defaults to user preferences.
fr: visibilité de la séance (``private``, ``followers_only`` ou ``public``). Non obligatoire, si non fournie utilise la préférence utilisateur.

source: Update a workout.
fr: Mettre à jour une séance.

source: analysis visibility (``private``, ``followers_only`` or ``public``)
fr: visibilité pour l'analyse (``private``, ``followers_only`` ou ``public``)

source: workout ascent (only for workout without gpx, must be provided with descent)
fr: dénivelé positif de la séance (seulement pour les séances sans gpx, doit être fourni avec le dénivelé négatif)

source: workout descent (only for workout without gpx, must be provided with ascent)
fr: dénivelé négatif de la séance (seulement pour les séances sans gpx, doit être fourni avec le dénivelé positif)

source: workout description (max length: 10000 characters, otherwise it will be truncated)
fr: description de la séance (longueur max. : 10000 caractères, dans le cas contraire elle sera tronquée)

source: workout distance in km (only for workout without gpx)
fr: distance de la séance en km (seulement pour les séances sans gpx)

source: workout duration in seconds (only for workout without gpx)
fr: durée de la séance en secondes (seulement pour les séances sans gpx)

source: the id of the equipment to associate with this workout (any existing equipment for this workout will be replaced). **Note**: for now only one equipment can be associated. If an empty array, equipment for this workout will be removed.
fr: l'id de l'équipement à associer à cette séance (si un équipement est déjà associé, il sera remplacé). **Note**: pour le moment, un seul équipement peut être associé. Si la liste est vide, l'équipement sera supprimé.

source: map visibility (``private``, ``followers_only`` or ``public``)
fr: visibilité de la carte (``private``, ``followers_only`` ou ``public``)

source: notes (max length: 500 characters, otherwise they will be truncated)
fr: notes (longueur max. : 500 caractères, dans le cas contraire elles seront tronquées)

source: workout title (max length: 255 characters, otherwise it will be truncated)
fr: titre de la séance (longueur max. : 255 caractères, dans le cas contraire il sera tronqué)

source: workout date in user timezone (format: ``%Y-%m-%d %H:%M``) (only for workout without gpx)
fr: date de la séance dans le fuseau horaire de l'utilisateur (format : ``%Y-%m-%d %H:%M``) (seulement pour les séances sans gpx)

source: workout updated
fr: séance mise à jour

source: Refresh a workout (created by uploading a file):
fr: Actualiser une séance (créée à partir d'un fichier):

source: recalculate workout data like max. speed, pauses...
fr: recalculer les données de la séance comme la vitesse max, les pauses...

source: update weather if weather provided is set and workout does not have weather data
fr: mettre à jour les données météo si un fournisseur de données est configuré et que la séance n'a pas de données météo

source: Delete a workout.
fr: Supprimer la séance.

source: workout deleted
fr: séance supprimée

source: Add a "like" to a workout.
fr: Ajouter un "like" à une séance.

source: Remove workout "like".
fr: Supprimer le "like" de la séance.

source: Get users who like the workout.
fr: Obtenir la liste des utilisateurs qui ont "liké" la séance

source: Appeal workout suspension.
fr: Faire appel de la suspension de la séance.

source: Only workout author can appeal the suspension.
fr: Seul l'auteur de la séance peut fait appel de la suspension.

source: Get user tasks for workouts archive upload
fr: Obtenir les tâches des utilisateurs pour le chargement des archives de séances

source: Get a given task for workouts archive upload
fr: Obtenir une tâche de chargement d'archive de séances donnée

source: Abort ongoing task for workouts archive upload
fr: Interrompre la tâche en cours de chargement d'archive de séances

source: Delete workouts archive upload task if status is successful or errored
fr: Supprimer les tâches de chargement d'archives de séances si le status est 'terminé avec succès' ou 'en erreur'

source: Change log
fr: Historique des modifications

source: Version 1.1.0b3 (2026/01/21)
fr: Version 1.1.0b3 (21/01/2026)

source: This is a pre-release. Don't install this version in production, you may not be able to safely downgrade to a stable version.<br />If you find bugs, please report them.
fr: **Il s'agit d'une préversion. N'installez pas cette version en production, vous pourriez ne pas être en mesure de rétrograder en toute sécurité vers une version stable.** <br />Si vous trouvez des bugs, veuillez les signaler.

source: Warning:
fr: **Attention :**

source: This release contains database migrations (see upgrade instructions in documentation).
fr: Cette version contient des migrations de base de données (voir les instructions dans la [documentation](https://next.docs.fittrackee.org/fr/installation/upgrade.html)).

source: Features and enhancements
fr: Fonctionnalités et améliorations

source: Bugs Fixed
fr: Bugs corrigés

source: Misc
fr: Divers

source: Thanks to the beta-testers for feedbacks.
fr: Merci aux bêta-testeurs pour leurs retours.

source: Version 1.1.0b2 (2026/01/11)
fr: Version 1.1.0b2 (11/01/2026)

source: Version 1.1.0b1 (2026/01/04)
fr: Version 1.1.0b1 (04/01/2026)

source: This version includes pace display, elevation correction from OpenElevation API or Valhalla Elevation API, and total calories from the file.<br />Notes: For workouts uploaded prior to the version 1.1.0, they must be refreshed (via the User Interface or the Workouts CLI).
fr: Cette version inclut l'affichage de l'allure, la correction d'altitude à partir des API d'**OpenElevation** ou de **Valhalla** et le total des calories à partir du fichier.<br />Remarque : pour les séances chargées avant la version 1.1.0, elles doivent être actualisés (via l'interface utilisateur ou l'[interface de lignes de commandes (CLI) des séances](https://next.docs.fittrackee.org/fr/cli.html#ftcli-workouts-refresh).

source: Two environment variables have been added to enable elevation correction: OPEN_ELEVATION_API_URL and VALHALLA_API_URL.
fr: 2 nouvelles variables d'environnements ont été ajoutées pour la correction de l'altitude: [`OPEN_ELEVATION_API_URL`](https://next.docs.fittrackee.org/fr/installation/environments_variables.html#envvar-OPEN_ELEVATION_API_URL) et [`VALHALLA_API_URL`](https://next.docs.fittrackee.org/fr/installation/environments_variables.html#envvar-VALHALLA_API_URL).

source: A new option has also been added to the Workouts CLI (--with-elevation) to allow refreshing workouts without calling Elevation service (which may result in rate limit issues). The missing elevations are updated only when --with-elevation is provided.
fr: Une nouvelle option a également été ajoutée à l'interface de lignes de commandes (CLI) des séances (`--with-elevation`) afin de permettre l'actualisation des séances sans faire appel au service de mise à jour de l'altitude (ce qui peut entraîner des problèmes de limitation d'accès). Les altitudes manquantes ne sont mises à jour que lorsque l'option `--with-elevation` est fournie.

source: Starting with this version, ENABLE_GEOSPATIAL_FEATURES is no longer used and can be removed. In addition, the --add-missing-geometry has also been removed from the Workouts CLI.
fr: À partir de cette version, [`ENABLE_GEOSPATIAL_FEATURES`](https://next.docs.fittrackee.org/fr/installation/environments_variables.html#envvar-ENABLE_GEOSPATIAL_FEATURES) n'est plus utilisée et peut être supprimée. De plus, l'option `--add-missing-geometry` a également été supprimée de l'interface de lignes de commandes (CLI) des séances.

source: PostgreSQL 13 is no longer supported.
fr: PostgreSQL 13 n'est plus pris en charge.

source: This version requires all workouts to be updated before installation.<br />Otherwise, the following error will be displayed:
fr: Cette version nécessite la mise à jour de tous les séances avant l'installation.<br />Sinon, l'erreur suivante s'affichera :

source: Thanks to the contributors:
fr: Merci aux contributeurs :

source: Version 1.0.6 (2026/01/04)
fr: Version 1.0.6 (04/01/2026)

source: The version 1.1.0 will require all workouts to be updated, see documentation.
fr: La version 1.1.0 nécessitera que toutes les séances soient mises à jour, voir la [documentation](https://next.docs.fittrackee.org/fr/installation/upgrade.html#workouts-data-update).

source: Translations
fr: Traductions

source: Translation status for languages available on the interface:
fr: Avancement de la traduction pour les langues disponibles sur l'interface :

source: Bulgarian: 54%
fr: Bulgare : 54%

source: Chinese (Simplified): 98%
fr: Chinois (Simplifié) : 98%

source: Croatian: 100%
fr: Croate : 100%

source: Czech: 48%
fr: Tchèque : 48%

source: Dutch: 99%
fr: Néerlandais : 99%

source: English: 100%
fr: Anglais : 100%

source: French: 100%
fr: Français : 100%

source: Galician: 100%
fr: Galicien : 100%

source: German: 93%
fr: Allemand : 93%

source: Italian: 99%
fr: Italien : 99%

source: Norwegian Bokmål: 45%
fr: Norvégien Bokmål : 45%

source: Polish: 98%
fr: Polonais : 98%

source: Portuguese: 53%
fr: Portugais : 53%

source: Russian: 97%
fr: Russe : 97%

source: Spanish: 71%
fr: Espagnol : 71%

source: Turkish: 1%
fr: Turc : 1%

source: Version 1.0.5 (2025/12/27)
fr: Version 1.0.5 (27/12/2025)

source: Polish: 95%
fr: Polonais : 95%

source: Version 1.0.4 (2025/12/14)
fr: Version 1.0.4 (14/12/2025)

source: Among changes, this version introduces some changes regarding environment variables:
fr: Parmi les changements, cette version introduit quelques modifications concernant les variables d'environnement :

source: APP_LOG can now be emptied to display only logs on the console,
fr: [`APP_LOG`](https://next.docs.fittrackee.org/fr/installation/environments_variables.html#envvar-APP_LOG) peut désormais être vidée pour n'afficher que les journaux sur la console,

source: API_RATE_LIMITS has now longer a default value. It is now possible to disable only API rate limits when Redis is available,
fr: [`API_RATE_LIMITS`](https://next.docs.fittrackee.org/fr/installation/environments_variables.html#envvar-API_RATE_LIMITS) n'a plus de valeur par défaut. Il est désormais possible de désactiver uniquement les limites d'accès à l'API lorsque Redis est disponible,

source: LOG_LEVEL has been added to set Gunicorn log level.
fr: [`LOG_LEVEL`](https://next.docs.fittrackee.org/fr/installation/environments_variables.html#envvar-LOG_LEVEL) a été ajouté pour définir le niveau de logs de **Gunicorn**.

source: For more information on installation see documentation.
fr: Plus d'informations dans la [documentation](https://docs.fittrackee.org/en/installation.html).

source: Reminder:
fr: **Rappel :**

source: For now, releases do not follow semantic versioning. Any version may contain backward-incompatible changes.
fr: Pour le moment, les versions publiées ne suivent pas la [gestion sémantique de version](https://semver.org/lang/fr/). Toute version peut contenir des changements non rétro-compatibles.

source: Translation status:
fr: Avancement de la traduction :

source: Version 1.0.3 (2025/11/05)
fr: Version 1.0.3 (05/11/2025)

source: Russian: 95%
fr: Russe : 95%

source: Version 1.0.2 (2025/11/01)
fr: Version 1.0.2 (01/11/2025)

source: Croatian: 99%
fr: Croate : 99%

source: Galician: 99%
fr: Galicien : 99%

source: German: 88%
fr: Allemand : 88%

source: Polish: 96%
fr: Polonais : 96%

source: Russian: 96%
fr: Russe : 96%

source: Version 1.0.1 (2025/10/22)
fr: Version 1.0.1 (22/10/2025)

source: FitTrackee is now available for Python 3.14.
fr: **FitTrackee** est maintenant disponible pour Python 3.14.

source: Dutch: 100%
fr: Néerlandais : 100%

source: Italian: 73%
fr: Italien : 73%

source: Version 1.0.0 (2025/10/05)
fr: Version 1.0.0 (05/10/2025)

source: FitTrackee now allows you to filter workouts on location and display them on a map.<br />To do so, FitTrackee requires the installation of PostGIS extension on PostgreSQL database and the recalculation of all workouts to generate geospatial data.<br />You can find the upgrade instructions in documentation.<br />Two new environment variables have been added: ENABLE_GEOSPATIAL_FEATURES and NOMINATIM_URL.
fr: **FitTrackee** permet désormais de filtrer les séances par lieu et de les afficher sur une carte. <br />Pour ce faire, **FitTrackee** nécessite l'installation de l'extension **PostGIS** sur la base de données **PostgreSQL** et le re-calcul de toutes les séances afin de générer des données géospatiales.<br />Vous trouverez les instructions pour la mise à niveau dans la [documentation](https://next.docs.fittrackee.org/fr/installation/upgrade.html#workouts-data-update).<br />Deux nouvelles variables d'environnement ont été ajoutées : [`ENABLE_GEOSPATIAL_FEATURES`](https://next.docs.fittrackee.org/fr/installation/environments_variables.html#envvar-ENABLE_GEOSPATIAL_FEATURES) et [`NOMINATIM_URL`](https://next.docs.fittrackee.org/fr/installation/environments_variables.html#envvar-NOMINATIM_URL).

source: Among other changes and improvements, this version also brings a new sport (Outdoor Padel).
fr: Parmi les autres changements et améliorations, cette version apporte également un nouveau sport (le Padel en extérieur).

source: The version 1.1.0 will require all workouts to be updated.
fr: La version 1.1.0 nécessitera que toutes les séances soient mises à jour.

source: Python 3.9 and PostgreSQL 12 are no longer supported. This version will not yet support Python 3.14 when it is released.
fr: **Python 3.9** and **PostgreSQL 12** ne sont plus supportés. Cette version ne prendra pas encore en charge **Python 3.14** à sa sortie.

source: Note: This release note includes the changes from the beta versions.
fr: Note: Cette note de version comprend les changements des versions bêta.

source: Chinese (Simplified): 95%
fr: Chinois (Simplifié) : 95%

source: Croatian: 96%
fr: Croate : 96%

source: Italian: 44%
fr: Italien : 44%

source: Norwegian Bokmål: 29%
fr: Norvégien Bokmål : 29%

source: Version 1.0.0b3 (2025/09/27)
fr: Version 1.0.0b3 (27/09/2025)

source: Version 1.0.0b2 (2025/09/21)
fr: Version 1.0.0b2 (21/09/2025)

source: if upgrading from v1.0.0b1, the refresh command (Workout CLI) must be re-executed.
fr: Si vous effectuez une mise à niveau à partir de la version 1.0.0b1, la commande de rafraîchissement (CLI des séances) doit être ré-exécutée.

source: Version 1.0.0b1 (2025/09/10)
fr: Version 1.0.0b1 (10/09/2025)

source: Warning:<br />This version introduces major changes:
fr: **Attention** :<br />Cette version introduit des changement majeurs :

source: FitTrackee v1+ now requires PostGIS extension and additional dependencies, see the upgrade instructions in documentation.
fr: FitTrackee v1+ nécessite dorénavant l'extension PostGIS et des dépendances additionnelles, voir les instructions de mises à jour dans la [documentation](https://next.docs.fittrackee.org/fr/installation/upgrade.html#upgrading-to-1-0-x).

source: Two new environment variables have been added: ENABLE_GEOSPATIAL_FEATURES and NOMINATIM_URL.
fr: 2 nouvelles variables d'environnements ont été ajoutées: [`ENABLE_GEOSPATIAL_FEATURES`](https://next.docs.fittrackee.org/fr/installation/environments_variables.html#envvar-ENABLE_GEOSPATIAL_FEATURES) and [`NOMINATIM_URL`](https://next.docs.fittrackee.org/fr/installation/environments_variables.html#envvar-NOMINATIM_URL).

source: This version drops support Python 3.9 and PostgreSQL 12
fr: Cette version ne prend plus en charge Python 3.9 et PostgreSQL 12

source: Version 0.12.2 (2025/09/07)
fr: Version 0.12.2 (07/09/2025)

source: Bulgarian: 56%
fr: Bulgare : 56%

source: Chinese (Simplified): 99%
fr: Chinois (Simplifié) : 99%

source: Czech: 45%
fr: Tchèque : 45%

source: German: 92%
fr: Allemand : 92%

source: Italian: 46%
fr: Italien : 46%

source: Norwegian Bokmål: 30%
fr: Norvégien (Bokmål) : 30%

source: Polish: 100%
fr: Polonais : 100%

source: Portuguese: 55%
fr: Portugais : 55%

source: Russian: 98%
fr: Russe : 98%

source: Spanish: 74%
fr: Espagnol : 74%

source: Version 0.12.1 (2025/09/03)
fr: Version 0.12.1 (03/09/2025)

source: Version 0.12.0 (2025/08/31)
fr: Version 0.12.0 (31/08/2025)
