Repository: SamR1/FitTrackee
Catalog: docsrc/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: Users can create a workout without file by entering date, time, duration, distance, ascent and descent.
fr: Les utilisateurs peuvent créer une séance sans fichier en saisissant la date, l'heure, la durée, la distance, l'ascension et la descente.

source: Form for workout creation without a file
fr: Formulaire pour créer une séance sans fichier

source: 27 sports are available.
fr: 27 sports sont disponibles.

source: Most icons for sports are made by `Freepik <https://www.freepik.com/>`__ from `Flaticon <https://www.flaticon.com/>`__.
fr: La majorité des icônes des sports ont été créées par `Freepik <https://www.freepik.com/>`__ sur `Flaticon <https://www.flaticon.com/>`__.

source: Sports icons for Canoeing, Kayaking and Rowing are made by `@Von-Birne <https://github.com/Von-Birne>`__.
fr: Les icônes des sports Aviron, Canoë et Kayak ont été créées par `@Von-Birne <https://github.com/Von-Birne>`__.

source: Sport icon for Halfbike is made by `@astridx <https://github.com/astridx>`__.
fr: L'icône du sport Halfbike a été créé par `@astridx <https://github.com/astridx>`__.

source: Sports available
fr: Sports disponibles

source: Cycle sports
fr: Sports cyclistes

source: Cycling (Virtual)
fr: Vélo (Virtuel)

source: Cycling (Trekking)
fr: Vélo (Trekking)

source: Mountain Biking (Electric)
fr: VTT (Électrique)

source: Icon
fr: Icône

source: Name
fr: Nom

source: Foot sports
fr: Sports pédestres

source: Water sports
fr: Sports nautiques

source: Rowing
fr: Aviron

source: Open Water Swimming
fr: Nage en eau libre

source: Canoeing and Kayaking
fr: Canoë et Kayak

source: Modified Rowing image
fr: Modification de l'image pour l'Aviron

source: Windsurfing
fr: Planche à voile

source: Standup paddleboarding
fr: Stand up paddle

source: Canoeing (Whitewater) and Kayaking (Whitewater)
fr: Canoë et Kayak en eaux vives

source: Modified Canoeing and Kayaking images
fr: Modification de l'image du Canoë et du Kayak

source: Canoeing
fr: Canoë

source: Canoeing (Whitewater)
fr: Canoë en eaux vives

source: Kayaking
fr: Kayak

source: Kayaking (Whitewater)
fr: Kayak en eaux vives

source: Standup Paddleboarding
fr: Stand up paddle

source: Rackets sports
fr: Sports de raquette

source: Tennis (Outdoor)
fr: Tennis (Extérieur)

source: Padel (Outdoor)
fr: Padel (Extérieur)

source: Winter sports and mountain sports
fr: Sports d'hiver et de montagne

source: Skiing (Alpine) and Skiing (Cross Country)
fr: Ski (Alpin et Randonnée)

source: Snowshoes
fr: Raquettes

source: Mountaineering
fr: Alpinisme

source: Skiing (Alpine)
fr: Ski (Alpin)

source: Skiing (Cross Country)
fr: Ski (Randonnée)

source: Other sports
fr: Autres sports

source: Paragliding
fr: Parapente

source: Swimrun is displayed as a single activity with no difference between segments for now.
fr: Le sport Swimrun s'affiche comme une seule activité sans différence entre les segments pour le moment.

source: Sports configuration
fr: Configuration des sports

source: It is possible to configure sport in user preferences (see `Account & preferences <account_and_preferences.html#sports-preferences>`__) :
fr: La couleur du sport peut être modifiée dans les préférences utilisateur (voir `Compte & préférences <account_and_preferences.html#sports-preferences>`__).

source: Sport color
fr: Couleur du sport

source: Active status
fr: État d'activation

source: Stopped speed threshold
fr: Seuil de vitesse arrêtée

source: Default equipment
fr: Équipement par défaut

source: Pace/Speed display
fr: Affichage de l'allure et/ou de la vitesse

source: Data entered and extracted
fr: Données saisies et extraites

source: added Visual Crossing as weather provider
fr: ajout de Visual Crossing comme fournisseur de données météo.

source: removed DarkSky as weather provider
fr: suppression de Darksky des fournisseurs de données météo.

source: added equipment
fr: ajout de l'équipement

source: added workout description
fr: ajout de la description de la séance

source: added extraction of description from file
fr: ajout de l'extraction de la description à partir du fichier

source: title can be entered when creation workout with file
fr: le titre peut être saisi lors de la création d'une séance avec un fichier

source: added Markdown syntax for descriptions and private notes
fr: ajout de la syntaxe Markdown pour la description et les notes personnelles

source: Garmin mapping updated
fr: mise à jour de la correspondance des produits Garmin

source: added extraction of total calories from file, missing elevations
fr: ajout de l'extraction du nombre total de calories à partir du fichier et du traitement des altitudes manquantes

source: If present in .gpx, .tcx and .fit files, the source (application or device) is displayed.
fr: Si présent dans les fichiers .gpx, .tcx et .fit, la source (application ou appareil) est affichée.

source: .fit files from Garmin devices may contain product id instead of product name. The mapping between the product id and the product name allows the product name to be displayed instead, if available.
fr: Les fichiers .fit provenant des appareils Garmin peuvent contenir l'identifiant du produit au lieu du nom du produit. Une correspondance entre l'identifiant et le nom permet d'afficher le nom du produit à la place, si disponible.

source: If the name is present in the file, it is used as the workout title. Otherwise, a title is generated from the sport and workout date.
fr: Si le nom est présent dans le fichier, il est utilisé comme titre de la séance. Sinon un titre est généré à partir du sport et de la date de la séance.

source: Users can provide title while uploading file.
fr: Les utilisateurs peuvent fournir un titre lors du téléversement du fichier.

source: Users can add description and private notes.
fr: Les utilisateurs peuvent ajouter une description et des notes personnelles.

source: If present and no description is provided by the user, the description from the file is used as the workout description.
fr: Si présente et qu'aucune description n'est fournie par l'utilisateur, la description du fichier est utilisée comme description de la séance.

source: An `equipment <equipment.html>`__ can be associated with a workout. For now, only one equipment can be associated.
fr: Un `équipement <equipment.html>`__ peut être associé à une séance. Pour le moment, un seul équipement peut être associé.

source: If present in .gpx, .tcx or .fit files, the total calories are extracted.
fr: Si présent dans les fichiers .gpx, .tcx et .fit, le nombre des calories totales est extrait.

source: If a weather provider is set by the administrator (data source is displayed in **About** page), the weather is extracted for the start and end points.
fr: Si un fournisseur de données météorologiques est défini par l'administrateur (la source des données est affichée dans la page **À propos**), les données météorologiques sont extraites pour les points de départ et d'arrivée.

source: Visibility levels
fr: Niveaux de visibilité

source: added visibility levels for heart rate
fr: ajout des niveaux de visibilité pour la fréquence cardiaque

source: added visibility levels for total calories
fr: ajout des niveaux de visibilité pour le nombre total de calories

source: Visibility level can be set separately for workout data, analysis and map:
fr: Le niveau de visibilité peut être configuré séparément pour les données de la séance, l'analyse et la carte :

source: private: only owner can see data,
fr: privé : seul le propriétaire de la séance peut voir les données,

source: followers only: only owner and followers can see data,
fr: abonnés seulement : seul le propriétaire de la séance et les abonnés peuvent voir les données,

source: public: anyone can see data even unauthenticated users.
fr: public: tout le monde peut voir les données, même les utilisateurs non authentifiés.

source: Workout visibility applies to title, description, records and workout data except elevation.
fr: La visibilité de la séance s'applique sur le titre, la description, les records et données de la séances à l'exception de l'altitude.

source: Analysis visibility applies to chart data, elevation and segments, if workout is associated with a file.
fr: La visibilité de l'analyse s'applique sur les données du graphique, l'altitude et les segments, si la séance est associée à un fichier.

source: Map visibility applies to the map, if workout is associated with a file.
fr: La visibilité de la carte s'applique sur la carte, si la séance est associée à un fichier.

source: Default visibility is private. All workouts created before **FitTrackee** 0.9.0 are private.
fr: La visibilité par défault est "privé". La visibilité des séances créés avant la version 0.9.0 de **FitTrackee** est "privé".

source: In addition, the visibility level can be set for all workouts for heart rate (average and max values and values displayed in chart) and total calories (value displayed in the workout detail).
fr: De plus, la visibilité peut être définie pour toutes les séances pour la fréquence cardiaque (valeurs moyennes et maximales et aux données affichées dans le graphe) et les calories totales (valeur affichée dans le détail de la séance).

source: Default visibility can be set in the `user preferences <account_and_preferences.html#preferences>`__.
fr: La visibilité par défault peut être configurée dans les `préférences de l'utilisateur <account_and_preferences.html#preferences>`__.

source: A workout with a file whose visibility for map and analysis data does not allow them to be viewed appears as a workout without a file.
fr: Une séance avec un fichier dont la visibilité pour la carte et l'analyse est privée apparait comme une séance sans fichier.

source: Max. speed and ascent/descent are returned regardless analysis visibility.
fr: La vitesse maximale et les dénivelée sont renvoyée quelque soit la visibilité de l'analyse.

source: Users can report a workout that violates instance rules. This will send a notification to moderators and administrators.
fr: Les utilisateurs peuvent signaler une séance qui enfreint les règles de l'instance. Une notification sera envoyée aux modérateurs et administrateurs.

source: Calculated data
fr: Données calculées

source: Related data are stored in database in metric system.
fr: Les données associées sont stockées dans la base de données dans le système métrique.

source: Calculated values may differ from values calculated by the application or device that originally generated the files, in particular the maximum speed or the duration of pauses.
fr: Les valeurs calculées peuvent différer de celles calculées par l'application ou l'appareil qui a généré les fichiers à l'origine, en particulier la vitesse maximale et la durée des pauses.

source: By default, extreme speed values (which may be related to GPS errors) are excluded, which also affects the maximum speed (and pace).
fr: Par défaut les valeurs extrêmes (pouvant être liées à des erreurs de GPS) sont exclues, ce qui affecte le calcul de la vitesse maximale (et de la meilleure allure).

source: A user preference allows this behavior to be disabled (see `Account & preferences <account_and_preferences.html#preferences>`__).
fr: Une préférence utilisateur permet de désactiver ce comportement (voir `Compte & préférences <account_and_preferences.html#preferences>`__).

source: added configuration
fr: ajout de la configuration

source: Stopped speed threshold affects speeds and durations calculation.
fr: Le seuil de vitesse arrêtée impacte le calcul des vitesses et des durées.

source: The value used by `gpxpy <https://github.com/tkrajina/gpxpy>`_ is not the default one for the following sports (0.1 km/h instead of 1 km/h):
fr: Le seuil de vitesse arrêtée utilisé par `gpxpy <https://github.com/tkrajina/gpxpy>`_ n'est plus la valeur par défaut pour les sports suivants (0.1 km/h au lieu de 1 km/h) :

source: Stopped speed threshold can be overridden in user preferences (see `Account & preferences <account_and_preferences.html#sports-preferences>`__).
fr: Le seuil de vitesse arrêtée peut être modifié par sport (voir `Compte & préférences <account_and_preferences.html#sports-preferences>`__).

source: It is not possible to enter 0 as stopped speed threshold, as gpxpy ignores it when it is equal to 0.
fr: Il n'est pas possible d'entrer 0 comme seuil de vitesse d'arrêt, car gpxpy l'ignore lorsqu'il est égal à 0.

source: Elevation
fr: Altitude

source: elevation is not displayed for flatwater sports
fr: l'altitude n'est pas affichée pour les sports nautiques en eaux calmes.

source: add missing elevation and elevation data source change
fr: ajout des altitudes manquantes et de la modification de la source des données d'altitude

source: Elevation-related data for racket sports (Outdoor Tennis and Padel) and flatwater sports (Canoeing, Kayaking, Rowing, Open Water Swimming, Rowing and Standup Paddleboarding) are not stored in database and displayed if the file contains elevation
fr: Les données liées à l'altitude pour les sports de raquettes (Tennis et Padel en extérieur) et les sports nautiques en eau calme (Canoë, Kayak, Aviron, Nage en eau libre et Stand up paddle) ne sont ni stockées ni affichées si le fichier en contient.

source: If some elevation data are missing and an `elevation service <../installation/elevation.html>`__ is enabled by the administrators (data source are displayed in **About** page), the missing elevations can be retrieved on workout creation if the user preference is set.
fr: Si certaines données d'altitude sont manquantes et qu'un `service d'altitude <../installation/elevation.html>`__ est activé par les administrateurs (les sources disponibles sont affichées dans la page **À propos**), les altitudes manquantes peuvent être récupérées lors de la création de la séance si l'option est activée dans les préférences utilisateurs.

source: In this case, all elevations are updated.
fr: Dans ce cas, toutes les élévations sont mises à jour.

source: Elevation data source can also be changed after creation.
fr: La source des données d'altitude peut également être modifiée après la création.

source: added highest ascent record
fr: ajout du record de dénivelé positif le plus élevé

source: added pace records
fr: ajout des recors liés à l'allure

source: Depending on sports, following records are calculated:
fr: En fonction des sports, les records suivants sont calculés :

source: best pace
fr: meilleure allure

source: highest ascent
fr: dénivelé positif le plus élevé

source: Records may differ from records displayed by the application that originally generated the files.
fr: Les records peuvent différer des records affichés par l'application qui a généré les fichiers à l'origine.

source: Display
fr: Affichage

source: Once created, the workout is displayed with the calculated data and, in the case of workouts created from a file, with a map and chart.
fr: Une fois créée, la séance s'affiche avec les données calculées et, dans le cas des séances créées à partir d'un fichier, avec une carte et un graphique.

source: Example for a workout created with a .gpx file:
fr: Exemple de séance créée à partir d'un fichier .gpx :

source: Workout Detail on FitTrackee
fr: Page de détail d'une séance sur FitTrackee

source: If the file contains multiple segments, each of them can be displayed.
fr: Si le fichier contient plusieurs segments, chacun d'entre eux peut être affiché.

source: Depending on preferences, data is displayed using the metric or imperial system.
fr: Selon les préférences, les données sont affichées en utilisant le système métrique ou impérial.

source: Displayed data
fr: Données affichées

source: added wind direction
fr: ajout de la direction du vent

source: added file source, heart rate, and cadence
fr: ajout de la source du fichier, de la fréquence cardiaque et de la cadence

source: added power
fr: ajout de la puissance

source: added pace and total calories
fr: ajout de l'allure et du nombre total de calories

source: Depending on the sport and the method used to create the workout, the following data are displayed:
fr: En fonction du sport et de la méthode utilisée pour créer la séance, les données suivantes sont affichées :

source: if present, file source
fr: si présente, source du fichier

source: durations (moving and total durations and pauses)
fr: durées (en déplacement et total, ainsi que les pauses)

source: average and max. speeds (depending on sport or pace/display preference)
fr: vitesse max. et moyenne (selon le sport ou la préférence d'affichage de l'allure et de la vitesse

source: average and best paces for the following sports (depending on pace/display preference):
fr: allures moyennes et optimales pour les sports suivants (en fonction de la préférence d'affichage de l'allure et de la vitesse) :

source: if present, min. and max. altitudes
fr: si présentes, altitudes min. et max.

source: if present, ascent and descent
fr: si présents, dénivelé positif et négatif

source: if present, average and max. heart rate
fr: si présentes, las fréquences cardiaques moyenne et maximale

source: if present, average and max. cadence for the following sports:
fr: si présentes, les cadences moyenne et maximale pour les sports suivants :

source: if present, average and max. power for the following sports:
fr: si présentes, les puissances moyenne et maximale pour les sports suivants :

source: if present, total calories
fr: si présent, le nombre total de calories

source: if present, weather data
fr: si présentes, les données météorologiques

source: Wind is displayed, with an arrow indicating the direction (a tooltip can be displayed with the direction that the wind is coming **from**).
fr: La vitesse du vent est affichée, avec une flèche indiquant la direction (une infobulle peut être affichée avec la direction (provenance du vent)).

source: associated equipment, according to its visibility (equipment details are only visible to its owner)
fr: équipement associé, selon le niveau de visibilité (le détail de l'équipement n'est visible que par son propriétaire)

source: Source and average and max values for heart rate and cadence are not displayed for workouts created before v0.10.0.
fr: La source, les valeurs moyennes et maximales pour la fréquence cardiaque et la cadence ne sont pas affichées pour les séances créées avant la version v0.10.0.

source: Average and max values for power are not displayed for workouts created before v0.11.0.
fr: Les valeurs moyennes et maximales pour la puissance ne sont pas affichées pour les séances créées avant la version v0.11.0.

source: Pace and total calories are not displayed for workouts created before v1.1.0.
fr: L'allure et les calories totales ne sont pas affichées pour les séances créées avant la version v1.1.0.

source: Refreshing the workout allows these values to be calculated.
fr: L'actualisation de la séance permet de calculer ces valeurs.

source: Map
fr: Carte

source: added full screen and reset control
fr: ajout du mode plein écran et du contrôle de réinitialisation

source: added heatmap for racket sports
fr: ajout de la carte thermique pour les sport de raquette

source: A map is displayed for workout with a file with the tile server set by the administrators (OpenStreetMap by default).
fr: Une carte est affichée pour la séance crée à partir d'un fichier avec le serveur de tuiles est défini par les administrateurs (OpenStreetMap par défaut).

source: Controls allow full screen view and position reset.
fr: Des boutons permettent une visualisation en plein écran et la réinitialisation de la position.

source: If the sport is Outdoor Tennis or Padel, a heat map is also available.
fr: Si le sport est le tennis ou le padel en extérieur, une carte thermique (*heat map*) est également disponible.

source: Chart
fr: Graphique

source: added heart rate and cadence
fr: ajout de la fréquence cardiaque et de la cadence

source: added power and display preference for charts
fr: ajout de la puissance et de la préférence d'affichage pour les graphiques

source: added pace and total calories, change default value for charts display preference
fr: ajout de l'allure et du nombre total de calories, changement de la valeur par défaut de l'affichage des graphiques

source: A chart is displayed for workout with a file, depending on sport and available data:
fr: Un graphique est affiché pour les séances crées avec un fichier, selon le sport et les données disponibles :

source: speed (by default, speed is not displayed when pace is displayed)
fr: vitesse (par défaut, la vitesse n'est pas affichée lorsque l'allure est affichée)

source: elevation
fr: altitude

source: heart rate
fr: fréquence cardiaque

source: power
fr: puissance

source: Speed/pace, elevation, heart rate, cadence and power can be displayed on one chart or split on multiple charts.
fr: Ces données (vitesse/allure, altitude, fréquence cardiaque, cadence et puissance) peuvent être affichées sur un seul graphique ou réparties sur plusieurs graphiques.

source: Pace and elevation are displayed in the same chart.
fr: L'allure et l'altitude sont affichées dans sur le même graphique.

source: The preferred display can be stored in a `user preference <account_and_preferences.html#preferences>`__.
fr: L'affichage préféré peut être enregistré dans les `préférences utilisateur <account_and_preferences.html#preferences>`__.

source: Workout menu
fr: Menu de la séance

source: added button for download
fr: ajout d'un bouton pour télécharger le fichier

source: added like button
fr: ajout du bouton "Like"

source: added refresh button
fr: ajout du bouton de rafraichissement

source: added button for elevation data source, file download updated
fr: ajout du bouton pour changer la source des données d'altitude, téléchargement du fichier modifié

source: Button
fr: Bouton

source: Like workout (only for authenticated users, depending on workout visibility)
fr: "Liker" la séance (uniquement pour les utilisateurs authentifiés, en fonction de la visibilité de la séance)

source: Download the original workout file or the generated .gpx file (only for workout owner)
fr: Téléchargez le fichier original de la séance ou le fichier .gpx généré (uniquement pour le propriétaire de la séance)

source: Edit workout (only for workout owner)
fr: Éditer la séance (uniquement pour le propriétaire de la séance)

source: Refresh workout (only for workout owner)
fr: Rafraîchir la séance (uniquement pour le propriétaire de la séance)

source: Change elevation data source workout (only for workout owner)
fr: Changer la source des données d'altitude de la séance (uniquement pour le propriétaire de la séance)

source: Delete workout (only for workout owner)
fr: Supprimer la séance (uniquement pour le propriétaire de la séance)

source: Report workout (only for authenticated users except the workout owner, depending on workout visibility)
fr: Signaler la séance (uniquement pour les utilisateurs authentifiés à l'exclusion du propriétaire de la séance, selon la visibilité de la séance)

source: Edition and deletion
fr: Modification et suppression

source: added workout refresh
fr: ajout du rafraîchissement de la séance

source: change elevation data source
fr: ajout du changement de la source des données d'altitude

source: Workout can be edited:
fr: Une séance peut être modifiée :

source: title
fr: titre

source: equipment
fr: équipement

source: private notes
fr: notes personnelles

source: workout visibility
fr: visibilité de la séance

source: analysis visibility
fr: visibilité de l'analyse

source: map visibility
fr: visibilité de la carte

source: date (only workouts without gpx)
fr: date (seulement pour les séances sans gpx)

source: duration (only workouts without gpx)
fr: durée (seulement pour les séances sans gpx)
