Repository: SamR1/FitTrackee
Catalog: docsrc/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: if the server running the application is different from the server running the database, install `gdal <https://gdal.org/en/stable/download.html#binaries>`__ library on the server running the application (**GDAL** is installed with **PostGIS**)
fr: si le serveur exécutant l'application et différent de celui de la base de données, installer la librairie `gdal <https://gdal.org/en/stable/download.html#binaries>`__ le serveur exécutant l'application (**GDAL** est installé avec **PostGIS**)

source: update **fittrackee** (see `instructions for upgrade <upgrade.html>`__)
fr: mettre à jour **fittrackee** (voir les `instructions pour la mise à jour <upgrade.html>`__)

source: run database migrations
fr: exécuter les migrations de base de données

source: start application and workers
fr: démarrer l'application et les *workers*

source: With Docker
fr: Avec Docker

source: stop the application, workers and database
fr: arrêter l'application, les *workers* et la base de données

source: change the database ``postgres`` image in ``docker-compose.yml`` to ``postgis/postgis`` (keep the same **PostgreSQL** version), for instance:
fr: remplacer l'image de la base de données ``postgres`` dans le fichier ``docker-compose.yml`` par ``postgis/postgis`` (en gardant la même version de **PostgreSQL**), par exemple :

source: start only the database
fr: démarrer uniquement la base de données

source: update **fittrackee** version in ``docker-compose.yml``
fr: mettre à jour la version de l'image de **fittrackee** dans le fichier ``docker-compose.yml``

source: start the application, migrations should run without error
fr: redémarrer l'application, les migration devraient s'exécuter sans erreur

source: Workouts data update
fr: Mise à jour des séances

source: An new CLI option (``--add-missing-geometry``) allows to refresh workouts without geometry and chart data.
fr: Une nouvelle option de l'interface de lignes de commande (``--add-missing-geometry``) permet de réactualiser toutes les séances sans géométries et données du graphique.

source: After upgrading **fittrackee**, run this command with other options depending on the number of workouts to update and the server capability, before enabling geospatial features on UI.
fr: Après avoir mis à jour **fittrackee**, exécuter la commande suivante avec éventuellement d'autres options selon le nombre de séances à mettre à jour et les capacités du serveur, avant d'activer les fonctionnalités géospatiales.

source: For instance to update the first 1,000 workouts created with a file:
fr: Par exemple pour les 1000 premières séances créées avec un fichier :

source: This command can be re-executed until there are no more workouts to update.
fr: Cette commande peut être ré-exécuter autant de fois que nécessaire, jusqu'à ce qu'il ne reste plus de séances à mettre à jour.

source: Once all workouts have been updated, enable geospatial features on the interface by setting the environment variable `ENABLE_GEOSPATIAL_FEATURES <environments_variables.html#envvar-ENABLE_GEOSPATIAL_FEATURES>`_ to ``True`` in ``.env``.
fr: Une fois que toutes les séances ont été mises à jour, activer les fonctionnalités géospatiales sur l'interface en configurant la variable d'environnement `ENABLE_GEOSPATIAL_FEATURES <environments_variables.html#envvar-ENABLE_GEOSPATIAL_FEATURES>`_ à ``True`` dans le fichier ``.env``.

source: The version 1.1.0 requires all workouts to be updated (``--add-missing-geometry`` option is removed in v1.1.0).
fr: La version 1.1.0 nécessite que toutes les séances soient mises à jour (l'option ``--add-missing-geometry`` est supprimée dans la version 1.1.0).

source: Weather data
fr: Données météo

source: Add Visual Crossing to weather providers
fr: Ajout de Visual Crossing parmi les fournisseurs de données météo.

source: Remove Darksky from weather providers
fr: Suppression de Darksky des fournisseurs de données météo.

source: The following weather data providers are supported by **FitTrackee**:
fr: Les fournisseurs de données météo suivants sont pris en charge par **FitTrackee** :

source: `Visual Crossing <https://www.visualcrossing.com>`__ (**note**: historical data are provided on hourly period)
fr: `Visual Crossing <https://www.visualcrossing.com>`__ (**note** : les données historiques sont fournies sur une période d'une heure)

source: **DarkSky** support is discontinued, since the service shut down on March 31, 2023.
fr: Le support de **DarkSky** est interrompu, depuis l'arrêt du service le 31 Mars 2023.

source: To configure a weather provider, set the following environment variables:
fr: Pour configurer un fournisseur de données météo, initialiser les variables d'environnement suivantes :

source: ``WEATHER_API_PROVIDER``: the name of the provider (currently ``visualcrossing`` is the only choice)
fr: ``WEATHER_API_PROVIDER``: le nom du fournisseur de données météo (pour le moment, seul ``visualcrossing`` est disponible)

source: ``WEATHER_API_KEY``: the key to the corresponding weather provider
fr: ``WEATHER_API_KEY`` : clé d'API correspondant au fournisseur de données météo

source: The configured weather data provider is displayed in **About** page.
fr: Le fournisseur de données météorologiques configuré s'affiche dans la page **À propos**.

source: Third-party tools
fr: Outils tiers

source: Thanks to the contributors, the following tools are available:
fr: Grâce aux contributeurs, les outils suivants sont disponibles :

source: Import tools
fr: Outils d'importation

source: `strava-to-fittrackee <https://github.com/jat255/strava-to-fittrackee>`_ (import workouts from a Strava account)
fr: `strava-to-fittrackee <https://github.com/jat255/strava-to-fittrackee>`_ (import des séances à partir d'un compte Strava)

source: `FitTrackee Uploader <https://github.com/ebrithiljonas/fittrackee-uploader>`_ (upload .gpx and .fit files)
fr: `FitTrackee Uploader <https://github.com/ebrithiljonas/fittrackee-uploader>`_ (ajout de fichiers .gpx et .fit)

source: `garmin-to-fittrackee <https://git.dryusdan.fr/Dryusdan/garmin-to-fittrackee>`_ (script to synchronize garmin to fittrackee)
fr: `garmin-to-fittrackee <https://git.dryusdan.fr/Dryusdan/garmin-to-fittrackee>`_ (script pour synchroniser fittrackee à partir de garmin)

source: Installation scripts
fr: Scripts d'installation

source: `fittrackee_installer.sh <https://github.com/speefak/fittrackee_installer.sh>`_ (install fittrackee on debian 12 netinstall)
fr: `fittrackee_installer.sh <https://github.com/speefak/fittrackee_installer.sh>`_ (installe FitTrackee sur debian 12 netinstall)

source: Administrator
fr: Administrateur

source: FitTrackee fails to start
fr: FitTrackee ne démarre pas

source: Check the database URL in `environment variables <../installation.html#envvar-DATABASE_URL>`__ if the following error is displayed in **gunicorn** logs:
fr: Vérifiez l'URL de la base de données dans les `variables d'environnement <../installation.html#envvar-DATABASE_URL>`__ si l'erreur suivante est affichée dans les logs de **gunicorn** :

source: The variable ``DATABASE_URL`` must start with ``postgresql://` (engine URLs starting with ``postgres://`` are no longer supported).
fr: La variable ``DATABASE_URL`` doit commencer par ``postgresql://`` (les URL commençant par ``postgres://`` ne sont plus supportées).

source: Check the email URL in `environment variables <../installation.html#envvar-EMAIL_URL>`__ if the following error is displayed in **gunicorn** logs:
fr: Vérifiez l'URL du serveur SMTP dans les `environment variables <../installation.html#envvar-EMAIL_URL>`__ si l'erreur suivante est affichée dans les logs de **gunicorn** :

source: A valid ``EMAIL_URL`` must be provided (see `emails <../installation.html#emails>`__).
fr: Une valeur valide pour la variable ``EMAIL_URL`` doit être fourni (voir `courriels <../installation.html#emails>`__).

source: Map images are not displayed but map is shown in Workout detail
fr: Les images de la carte ne sont pas affichées mais la carte est affichée dans le détail de la séance

source: Check the path in `environment variables <../installation.html#envvar-UPLOAD_FOLDER>`__. ``UPLOAD_FOLDER`` must be set with an absolute path.
fr: Vérifier le chemin dans les `variables d'environnement <../installation.html#envvar-UPLOAD_FOLDER>`__. ``UPLOAD_FOLDER`` doit être défini avec un chemin absolu.

source: Failed to upload or download files
fr: Échec du chargement ou du téléchargement de fichiers

source: Check ``client_max_body_size`` in **nginx** config. Increase the value to handle larger files (see **nginx** `documentation <https://nginx.org/en/docs/http/ngx_http_core_module.html#client_max_body_size>`_).
fr: Vérifiez ``client_max_body_size`` dans la configuration **nginx**. Augmentez la valeur pour gérer des fichiers plus volumineux (voir la `documentation <https://nginx.org/en/docs/http/ngx_http_core_module.html#client_max_body_size>`_ de **nginx**).

source: Increase **gunicorn** `timeout <https://docs.gunicorn.org/en/stable/settings.html#timeout>`__ value if the following error is displayed in gunicorn log: ``[CRITICAL] WORKER TIMEOUT``.
fr: Augmenter le `délai d'attente <https://docs.gunicorn.org/en/stable/settings.html#timeout>`__ (timeout) **gunicorn** si l'erreur suivante est affichée dans le journal de gunicorn : ``[CRITICAL] WORKER TIMEOUT``.

source: This error appears in task queue workers logs with `Flask-dramatiq <https://flask-dramatiq.readthedocs.io>`__ CLI on Python 3.13+.
fr: Cette erreur apparait dans les logs des *workers* de la file d'attente des tâches avec l'interface de ligne de commandes (CLI) de `Flask-dramatiq <https://flask-dramatiq.readthedocs.io>`__ et une version 3.13+ de Python.

source: The workaround is to use `Dramatiq <https://dramatiq.io>`__ CLI directly, for instance:
fr: La solution est d'utiliser directement l'interface de ligne de commandes de `Dramatiq <https://dramatiq.io>`__, par exemple :

source: ``staticmap3.staticmap - ERROR - request failed [None]`` or "error when generating map image"
fr: ``staticmap3.staticmap - ERROR - request failed [None]`` ou "Erreur lors de la génération de l'image de la carte"

source: FitTrackee v0.10+ introduces a new environment variable ``STATICMAP_CACHE_DIR``, for **Static Map 3** cache directory.
fr: A partir de la version v0.10+, une variable d'environnement pour le répertoire de cache de **Static Map 3** (``STATICMAP_CACHE_DIR``) a été ajoutée.

source: For docker installation, the directory must be writable for ``fittrackee`` user, see in ``docker-compose.yml`` example in the `repository <https://github.com/SamR1/FitTrackee/blob/main/docker-compose.yml>`__:
fr: Pour une installation avec Docker, le répertoire doit être accessible en écriture à l'utilisateur ``fittrackee`` (voir le fichier exemple ``docker-compose.yml`` dans le `dépôt <https://github.com/SamR1/FitTrackee/blob/main/docker-compose.yml>`__):

source: This error occurs when **PostGIS** extension is not installed, required with **FitTrackee** v1+.
fr: Cette erreur survient lorsque l'extension **PostGIS** n'est pas installée, cette extension est requise à partir de la version 1.0.0 de **FitTrackee**.

source: To install it, see `installation instructions <../installation.html#upgrade>`__ or `Upgrading to 1.x <../upgrading-to-1.0.0.html>`__
fr: Pour l'installer, voir les `instructions d'installation <../installation.html#upgrade>`__ ou de `mise à jour version vers la version 1.x <../upgrading-to-1.0.0.html>`__

source: Workouts created with a file are not displayed on the workouts map
fr: Des séances créées à partir de fichiers ne sont pas affichées sur la carte

source: If a workout has be created before **FitTrackee** 1.0.0, it needs to be refreshed to generate the geometry used to display the map.
fr: Si une séance a été créée avant la version 1.0.0 de **FitTrackee**, il est nécessaire de l'actualiser pour générer la géométrie utilisée pour afficher la carte

source: See `Upgrading to 1.x <../upgrading-to-1.0.0.html>`__ for instructions to recalculate all workouts with a CLI command.
fr: Voir `Mettre à jour vers la version 1.x <../upgrading-to-1.0.0.html>`__ pour les instructions permettant de réactualiser toutes les séances avec l'interface de lignes de commande.

source: Troubleshooting
fr: Dépannage

source: User
fr: Utilisateur

source: Workout maximum speed does not match the maximum speed displayed in chart
fr: La vitesse maximale de la séance ne correspond pas à la vitesse maximale affichée dans le graphique.

source: By default, extreme speed values (which may be related to GPS errors) are excluded, which also affects the maximum speed.
fr: Par défaut, les valeurs extrêmes (pouvant être liées à des erreurs de GPS) sont exclues, ce qui affecte le calcul de la vitesse maximale.

source: This behavior can be disabled by changing a user preference ("max. speed calculation strategy") in user account.
fr: Ce comportement peut être désactivé en modifiant une préférence utilisateur ("Stratégie de calcul de la vitesse maximale") dans le compte utilisateur.

source: For now, it's not possible to manually delete points with errors (see `issue #7 <https://github.com/SamR1/FitTrackee/issues/7>`__).
fr: Pour le moment, il n'est pas possible de supprimer manuellement les points avec des erreurs (cf. `ticket #7 <https://github.com/SamR1/FitTrackee/issues/7>`__).
