Repository: SamR1/FitTrackee
Catalog: docsrc/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: Documentation translations are located in following directory: docsrc/locales. For now only English and French are available and translations files are not yet on Weblate.
fr: La traduction de la documentation se trouvent dans le répertoire suivant : `docsrc/locales`. Pour l'instant, seuls l'anglais et le français sont disponibles et les fichiers de traduction ne sont pas encore disponibles sur Weblate.

source: Generative AI Policy
fr: Politique relative à l'IA générative

source: The use of large language models (LLMs) or generative AI applications is strongly discouraged. One reason, among others, is that these tools can produce code that is more complex than necessary, or even incorrect.
fr: L'utilisation de grands modèles linguistiques (LLM) ou d'applications d'IA générative est fortement déconseillée. L'une des nombreuses raisons est que ces outils peuvent produire un code plus complexe que nécessaire, voire incorrect.

source: However, if you do use such tools as a aid in your development environment (IDE), make sure you fully understand the code produced and how it works. The code must also fit the existing code base and should therefore be refactored if necessary.
fr: Toutefois, si vous utilisez de tels outils comme aide dans votre environnement de développement (IDE), assurez-vous de bien comprendre le code produit et son fonctionnement. Le code doit également s'intégrer à la base de code existante et doit donc être refactorisé si nécessaire.

source: On the other hand, bug reports or PRs generated entirely by AI/LLM tools or with commits co-authored by AI/LLM tools in the case of PRs are not accepted and will be closed.
fr: D'autre part, les rapports de bugs ou les _pull requests_ (PR) entièrement générés par des outils d'IA/LLM ou comprenant des _commits_ co-écrits par des outils d'IA/LLM dans le cas des _pull requests_ ne sont pas acceptés et seront fermés.

source: How to install FitTrackee
fr: Comment installer FitTrackee

source: see Installations instructions
fr: voir les [instructions d'installation](https://next.docs.fittrackee.org/fr/installation/index.html)

source: Note: Before starting, please open an issue to discuss implementation if the feature requires major changes or involves the addition of a new sport or language.<br />For new sports requests, as FitTrackee is built around files (.gpx or other supported formats) for outdoor activities, only sports associated with a file can be added for now.
fr: Remarque : Avant de commencer, veuillez ouvrir un ticket pour discuter de la mise en œuvre si la fonctionnalité nécessite des modifications majeures ou implique l'ajout d'un nouveau sport ou d'une nouvelle langue. Pour les demandes de nouveaux sports, **FitTrackee** étant basée sur des fichiers (.gpx ou autre format supporté) pour des activités de plein air, seuls les sports associés à un fichier peuvent être ajoutés pour le moment.

source: Please make your changes from the development branch (dev).
fr: Veuillez effectuer vos modifications à partir de la branche de développement (`dev`)

source: Fork the repository (see GitHub instructions)
fr: Dupliquer le dépôt (voir les [instructions sur GitHub](https://docs.github.com/fr/get-started/exploring-projects-on-github/contributing-to-a-project))

source: Implement your feature.
fr: Implémentez votre fonctionnalité

source: If your changes need a database migration:
fr: Si vos modifications nécessitent une migration de base de données :

source: You can generate one after updating models with the following command:
fr: Vous pouvez en générer un après avoir mis à jour les modèles avec la commande suivante :

source: For data migration, an empty migration can be created with this following command:
fr: Pour la migration des données, un fichier de migration vide peut être créé avec la commande suivante :

source: Rename the migration, prefixing with the next number.
fr: Renommez la migration en la préfixant avec le numéro suivant.

source: To apply database changes:
fr: Pour appliquer les modifications de la base de données :

source: Check the downgrade migration.
fr: Vérifiez la migration vers une version inférieure.

source: Run checks (lint, type check and unit tests).
fr: Exécutez des vérifications (_lint_, vérification de type et tests unitaires).

source: There are some end-to-end tests, to run them (needs a running application):
fr: Il existe des tests de bout en bout. Pour les exécuter (une application doit être en cours d'exécution) :

source: If needed, update translations (at least add English strings).
fr: Si nécessaire, mettez à jour les traductions (ajoutez au moins les chaînes en anglais).

source: On client side, update files in fittrackee_client/src/locales folder.
fr: Côté client, mettre à jour les fichiers dans le répertoire `fittrackee_client/src/locales`.

source: On API side (emails and RSS Feeds), to extract new strings into messages.pot:
fr: Côté API (courriels et flux RSS), pour extraire les nouvelles chaînes dans `messages.pot` :

source: To add new strings in translations files (fittrackee/emails/translations/<LANG>/LC_MESSAGES/messages.po):
fr: Pour ajouter les nouvelles chaînes dans les fichiers de traductions (`fittrackee/emails/translations/<LANG>/LC_MESSAGES/messages.po`) :

source: After updating strings in messages.po, compile the translations:
fr: Après avoir mis à jour les chaînes dans `messages.po`, compilez les traductions :

source: If needed, add or update tests.
fr: Si nécessaire, ajoutez ou mettez à jour des tests.

source: If needed, update documentation (no need to build documentation, it will be done when releasing).
fr: Si nécessaire, mettez à jour la documentation (inutile de compiler la documentation, elle sera effectuée lors de la publication de la version).

source: If updated code contains client-side changes, you can generate javascript assets to check FitTrackee without starting client dev server:
fr: Si le code mis à jour contient des modifications côté client, vous pouvez générer les ressources JavaScript pour vérifier **FitTrackee** sans démarrer le serveur de développement client :

source: No need to commit these files, dist files will be generated before merging or when releasing.
fr: Il n'est pas nécessaire d'ajouter ces fichiers, les fichiers seront compilés avant la fusion de la _pull request_ ou lors de la publication de la version.

source: Create your pull request to merge on dev branch.
fr: Créez votre _pull request_ avec comme branche cible la branche `dev`.

source: Ensure the pull requests description clearly describes the problem and solution. Include the relevant issue number if applicable.
fr: Assurez-vous que la description de la _pull request_ décrit clairement le problème et sa solution. Indiquez le numéro du ticket concerné, le cas échéant.

source: Check that all tests have been successfully passed.
fr: Vérifiez que tous les tests se sont exécutés avec succès.

source: If needed, update your branch.
fr: Si nécessaire, mettez à jour votre branche.

source: Thanks.
fr: Merci.

source: Account & preferences
fr: Compte et préférences

source: Account
fr: Compte

source: password reset
fr: réinitialisation du mot de passe

source: email change
fr: changement d'adresse électronique

source: data export
fr: export de données

source: notification when data export is completed
fr: notification quand l'export de données est terminé

source: Users can create, update and deleted their account.
fr: Les utilisateurs peuvent créer, modifier et supprimer leur compte.

source: User account edition on FitTrackee
fr: Edition du compte utilisateur sur FitTrackee

source: They can reset his password, can change their email address and update their profile image.
fr: Ils peuvent réinitialiser son mot de passe, modifier leur adresse e-mail et mettre à jour leur image de profil.

source: They can also request the export of their data.
fr: Ils peuvent également demander un export de leurs données.

source: It generates a zip archive containing 2 ``json`` files (user info and workouts data) and all uploaded files.
fr: Une archive zip sera générée, contenant 2 fichiers ``json`` (informations de l'utilisateur et données des séances) et tous les fichiers ajoutés.

source: A notification is displayed after export completion.
fr: Une notification est affichée une fois l'export terminé.

source: For now, it's not possible to import these files into another **FitTrackee** instance.
fr: Pour l'instant, il n'est pas possible d'importer ces fichiers sur une autre instance de **FitTrackee**.

source: Preferences
fr: Préférences

source: added interface theme and imperial system
fr: ajout d'un thème d'interface et du système impérial

source: added ascent preference
fr: préférence pour le dénivelé positif ajoutée

source: added date/time format
fr: format des date/heure ajouté

source: added elevation chart display
fr: ajout de l'affichage du graphe d'altitude

source: added max speed calculation strategy
fr: ajout d'une stratégie de calcul de la vitesse maximale

source: added interface theme
fr: ajout du thème de l'interface

source: added follow requests approval, profile visibility in users directory, workout visibilities
fr: Ajout de l'approbation des demandes d'abonnement, visibilité du profil dans le répertoire des utilisateurs, visibilité des séances

source: added heart rate visibility
fr: ajout de la visibilité de la fréquence cardiaque

source: event for segments creation
fr: évènement pour la création des segments

source: preferred displayed for charts
fr: affichage préférée pour les graphiques

source: missing elevation processing
fr: traitement des altitudes manquantes

source: User Preferences on FitTrackee
fr: Préférences de l'utilisateur sur FitTrackee

source: It is possible to set interface preference:
fr: Il est possible de définir les préférences d'interface :

source: language, timezone, date format and first day of week
fr: langue, fuseau horaire, format de date et premier jour de la semaine

source: interface theme (light, dark or according to browser preferences)
fr: thème de l'interface (clair, sombre ou selon les préférences du navigateur)

source: For account, it is possible to set:
fr: Pour le compte, il est possible de définir :

source: follow requests approval: manually (default) or automatically
fr: approbation des demandes d'abonnement : manuellement (par défaut) ou automatiquement

source: profile visibility in users directory: hidden (default) or displayed
fr: visibilité du profil dans le répertoire des utilisateurs : masqué (par défaut) ou affiché

source: For workouts, it is possible to choose:
fr: Pour les séances, il est possible de choisir :

source: between metric system and imperial system for distance, elevation and speed display
fr: entre le système métrique et le système impérial pour l'affichage de la distance, de l'altitude et de la vitesse

source: to display or hide ascent records and total on Dashboard
fr: d'afficher ou de cacher les records et le total de dénivelé positif sur le tableau de bord

source: the preferred display for workout chart:
fr: l'affichage préféré pour le graphique dans le détail de la séance :

source: all data on a single chart
fr: toutes les données sur un seul graphique

source: each data displayed on a different chart
fr: chaque donnée affichée sur un graphique différent

source: elevation chart axis start: zero or minimum altitude
fr: le point de départ de l'axe du graphique d'altitude : altitude zéro ou minimale

source: to exclude extreme values (which may be GPS errors) when calculating the maximum speed (by default, extreme values are excluded)
fr: d'exclure les valeurs extrêmes (qui peuvent être des erreurs GPS) lors du calcul de la vitesse maximale (par défaut, les valeurs extrêmes sont exclues)

source: Changing this preference will only affect next file uploads.
fr: La modification de cette préférence n'affectera que les prochains fichiers ajoutés.

source: missing elevation processing if an elevation service is set:
fr: le traitement des altitudes manquantes si un service de données d'altitude est défini :

source: none
fr: aucun

source: OpenElevation (raw data)
fr: OpenElevation (données brutes)

source: OpenElevation (smoothed data)
fr: OpenElevation (données lissées)

source: default visibility for workout data, analysis, map and heart rate.
fr: la visibilité par défaut des séances, de l'analyse, de la carte et de l'affichage de la fréquence cardiaque

source: The type of events that generate segment when uploading .fit files can also be set:
fr: Le type de pause pouvant générer un segment lors de l'ajout d'un fichier .fit peut être défini :

source: all pause events,
fr: tous les évènements de type pause,

source: only manual pause,
fr: seulement les pauses manuelles,

source: none.
fr: aucun.

source: Sports preferences
fr: Préférences des sports

source: added default equipment
fr: ajout de l'équipement par défaut

source: added pace/speed display
fr: ajout de l'affichage Allure/Vitesse

source: Sport Preferences on FitTrackee
fr: Préférences du sport sur FitTrackee

source: The following sport preferences can be set:
fr: Les préférences de sport suivantes peuvent être définies :

source: change sport color (used for sport image and charts)
fr: changer la couleur du sport (utilisée pour l'image du sport et les graphiques)

source: can override stopped speed threshold (for next uploaded gpx files)
fr: modifier le seuil de vitesse d'arrêt (pour les prochains fichiers gpx ajoutés)

source: disable/enable a sport
fr: désactiver/activer un sport.

source: define default `equipment <equipment.html>`__.
fr: définir des `équipements <equipment.html>`__ par défaut.

source: set pace/speed display for Hiking, Running, Trail and Walking:
fr: configurer de l'affichage de la vitesse/allure pour la randonnée, la course, le trail et la marche :

source: pace
fr: allure

source: speed
fr: vitesse

source: pace and speed
fr: allure et vitesse moyenne

source: If a sport is disabled by an administrator, it can not be enabled by a user. In this case, it will only appear in preferences if the user has workouts and only sport color can be changed.
fr: Si un sport est désactivé par un administrateur, il ne peut pas être activé par un utilisateur. Dans ce cas, il n'apparaîtra dans les préférences que si l'utilisateur a des séances et seule la couleur du sport peut être modifiée.

source: A disabled sport (by admin or user) will not appear in dropdown when **adding a workout**.
fr: Un sport désactivé (par l'administrateur ou l'utilisateur) n'apparaîtra pas dans la liste lors de l\'**ajout d'une séance**.

source: A workout with a disabled sport will still be displayed in the application.
fr: Une séance avec un sport désactivé sera toujours affichée dans l'application.

source: Quick edit is also available in order to change color, activate sport, update stopped speed threshold, or reset preferences.
fr: Une fonction d'édition rapide est également disponible pour modifier la couleur, activer le sport, mettre à jour le seuil de vitesse d'arrêt ou réinitialiser les préférences.

source: Sports edition on FitTrackee
fr: Édition des sports sur FitTrackee

source: Users can view follow requests to approve or reject.
fr: Les utilisateurs peuvent afficher les demandes d'abonnements pour les accepter ou les rejeter.

source: Follow requests on FitTrackee
fr: Demandes de suivi sur FitTrackee

source: They can display blocked users.
fr: Ils peuvent afficher les utilisateurs bloqués.

source: Blocked users on FitTrackee
fr: Utilisateurs bloquées sur FitTrackee

source: Moderation
fr: Modération

source: Users can view received warnings, sanctions, and appeal.
fr: Les utilisateurs peuvent afficher les avertissements et sanctions reçues et faire appel.

source: Moderation on FitTrackee
fr: Modération sur FitTrackee

source: Sanction detail on FitTrackee
fr: Détail d'une sanction sur FitTrackee

source: Users can update notification preferences.
fr: Les utilisateurs peuvent définir les préférences des notifications.

source: Notifications preferences on FitTrackee
fr: Préférences des notifications sur FitTrackee

source: Users can update messages preferences.
fr: Les utilisateurs peuvent définir les préférences des messages.

source: Messages preferences on FitTrackee
fr: Préférences des messages sur FitTrackee

source: Archive uploads
fr: Chargement d'archives

source: Users can view, interrupt and delete tasks for asynchronous uploads.
fr: Les utilisateurs peuvent voir, interrompre et supprimer les tâches de chargement d'archives.

source: Archive uploads list on FitTrackee
fr: Liste des archives chargées sur FitTrackee

source: Archive uploads detail on FitTrackee
fr: Détail du chargement d'une archive sur FitTrackee

source: FitTrackee Administration
fr: Administration de FitTrackee

source: Only users if administration rights can access application administration.
fr: Seuls les utilisateurs disposant de droits d'administration peuvent accéder à l'administration de l'application.

source: added administrator email for contact
fr: ajout de l'adresse électronique pour contacter l'administrateur

source: maximum size of workout file and maximum number of files in the zip archive updated
fr: ajout de la taille maximale du fichier et du nombre maximale de fichiers dans une archive

source: added maximum number of workouts for sport statistics
fr: ajout du nombre maximum de séances pour les statistiques d'un sport

source: added maximum number of files for synchronous processing and maximum number of workouts displayed on global map
fr: ajout du nombre maximal de fichier pour l'ajout synchrone de fichiers et du nombre maximal des séances affichées sur la carte globale

source: The following parameters can be set:
fr: Les paramètres suivants peuvent être définis :

source: active users limit (default: 0). If 0, registration is enabled (no limit defined).
fr: limite d'utilisateurs actifs (valeur par défaut : 0). Si la valeur est égale à 0, l'inscription est activée (aucune limite n'est définie).

source: maximum size of workout file (individually uploaded or in a zip archive, default: 1Mb)
fr: taille maximale du fichier (ajouté unitairement ou dans une archive zip, valeur par défaut : 1 Mo)

source: maximum size of zip archive (default: 10Mb)
fr: taille maximale de l'archive zip (valeur par défaut : 10 Mo)

source: maximum number of files in the zip archive (default: 10)
fr: nombre maximum de fichiers dans l'archive zip (valeur par défaut : 10)

source: maximum number of files for synchronous processing (default: 10). If the maximum number of files in the zip archive equals the maximum number of files for synchronous processing, asynchronous upload is disabled.
fr: nombre maximum de fichiers pour le traitement synchrone (valeur par défaut : 10). Si le nombre maximum de fichiers dans l'archive zip est égal à celui des fichiers traités en synchrone, le chargement asynchrone est désactivé.

source: When upgrading to v0.10.0, asynchronous download is disabled, since both values are equal.
fr: Lors de la mise à jour vers la version 0.10.0, le téléchargement asynchrone est désactivé, puisque les deux valeurs sont égales.

source: maximum number of workouts for sport statistics (default: 10,000). If 0, all workouts are fetched to calculate statistics
fr: nombre maximum de séances pour les statistiques d'un sport (par défaut : 10000). S'il est égal à 0, toutes les séances sont récupérées pour calculer les statistiques

source: maximum number of workouts displayed on global map (default: 10,000), this value can not exceed 50,000 workouts
fr: nombre maximum de séances affichées sur la carte globale (par défaut : 10000), cette valeur ne peut pas dépasser 50000

source: The maximum number of workouts for statistics or the global map must be defined according to the server capabilities.
fr: Le nombre maximal de séances pour les statistiques ou la carte globale doit être défini en fonction des capacités du serveur.

source: In the case of the global map, this value also has an impact on the rendering performance on the client side (depending on the browser and the capabilities of the device displaying the map).
fr: Dans le cas de la carte globale, cette valeur a également un impact sur les performances de rendu côté client (en fonction du navigateur et des capacités de l'appareil affichant la carte).

source: administrator email for contact
fr: adresse électronique pour contacter l'administrateur

source: If several application workers are running (see `environment variable <../installation/environments_variables.html#envvar-APP_WORKERS>`__), it may be necessary to restart all the workers so that the changes are taken into account.
fr: Si plusieurs *workers* pour l'application sont lancés (voir la `variables d'environnement <../installation/environments_variables.html#envvar-APP_WORKERS>`__), il peut être nécessaire de tous les redémarrer pour prendre en compte les changements.

source: Updating timeout (see `environment variable <../installation/environments_variables.html#envvar-APP_TIMEOUT>`__) or server configuration may be necessary to handle large files (like `nginx <https://nginx.org/en/docs/http/ngx_http_core_module.html#client_max_body_size>`_ for instance).
fr: La mise à jour du *timeout* (voir la `variable d'environnement <../installation/environments_variables.html#envvar-APP_TIMEOUT>`__) ou de la configuration du serveur peut être nécessaire pour gérer des fichiers volumineux (comme `nginx <https://nginx.org/en/docs/http/ngx_http_core_module.html#client_max_body_size>`_ par exemple).

source: Setting values that are too high for file size or number may cause errors.
fr: Des valeurs trop élevées pour la taille ou le nombre de fichiers peuvent être entraîner des erreurs.

source: If a weather data provider is configured, errors related to API limitations may occur.
fr: Si un fournisseur de données météo est configuré, des erreurs liées à la limitation de l'API peuvent être rencontrées.

source: If email sending is disabled, a warning is displayed.
fr: Si l'envoi de courriels est désactivé, un avertissement s'affiche.

source: About
fr: À propos

source: It is possible displayed additional information that may be useful to users in **About** page (like instance rules).
fr: Il est possible d'afficher des informations supplémentaires qui peuvent être utiles aux utilisateurs dans la page **À propos** (comme les règles de l'instance).

source: Markdown syntax can be used.
fr: La syntaxe Markdown peut être utilisée.

source: Privacy policy
fr: Politique de confidentialité

source: A default privacy policy is available (originally adapted from the `Discourse <https://github.com/discourse/discourse>`__ privacy policy).
fr: Une politique de confidentialité par défaut est disponible (adaptée de la `Politique de confidentialité de Discourse <https://github.com/discourse/discourse>`__).

source: A custom privacy policy can set if needed (Markdown syntax can be used). A policy update will display a message on users dashboard to review it.
fr: Une politique de confidentialité personnalisée peut être définie si nécessaire (la syntaxe Markdown peut être utilisée). Une mise à jour de la politique affichera un message sur le tableau de bord des utilisateurs pour qu'ils puissent en prendre connaissance.

source: Only the default privacy policy is translated (if the translation is available).
fr: Seule la politique de confidentialité par défaut est traduite (si la traduction est disponible).

source: Only users with administration or moderation rights can access moderation.
fr: Seul l'utilisateur ayant des droits d'administration peut modifier un autre utilisateur.

source: add a comment
fr: ajouter un commentaire

source: send a warning
fr: envoyer un avertissement
