Repository: SamR1/FitTrackee
Catalog: docsrc/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: Notifications can be disabled or enabled the following events in user preferences:
fr: Les notifications peuvent être désactivées ou activées pour les évènements suivants dans les préférences de l'utilisateur :

source: user registration (if authenticated user has administration rights)
fr: inscription d'un utilisateur (si l'utilisateur authentifié a les droits d'administration)

source: Comments, workouts, or accounts may be suspended after actions by moderators or administrators, see `Moderation in user account <account_and_preferences.html#moderation>`__.
fr: Commentaires, séances ou comptes peuvent être suspendus après actions par les modérateurs ou administrateurs, cf. `Modération dans le compte utilisateur <account_and_preferences.html#moderation>`__.

source: FitTrackee provides a REST API (see `documentation <../api/index.html>`__) whose most endpoints require authentication/authorization.
fr: FitTrackee fournit une API REST (voir `documentation <../api/index.html>`__) dont la plupart des points d'accès nécessitent une authentification/autorisation.

source: To allow a third-party application to interact with API endpoints, an `OAuth2 <https://datatracker.ietf.org/doc/html/rfc6749>`_ client can be created in user settings ('apps' tab).
fr: Pour permettre à une application tierce d'interagir avec les points d'accès de l'API, un client `OAuth2 <https://datatracker.ietf.org/doc/html/rfc6749>`_ peut être créé dans les paramètres de l'utilisateur (onglet 'apps').

source: OAuth2 endpoints requiring authentication are not accessible by third-party applications (`documentation <../api/oauth2.html>`__), only by FitTrackee client (first-party application).
fr: Les points d'entrée OAuth2 nécessitant une authentification ne sont pas accessibles par des applications tierces (`documentation <../api/oauth2.html>`__), seulement par l'application web de FitTrackee).

source: FitTrackee supports only `Authorization Code <https://datatracker.ietf.org/doc/html/rfc6749#section-1.3.1>`_ flow (with `PKCE <https://datatracker.ietf.org/doc/html/rfc7636>`_ support). It allows to exchange an authorization code for an access token. The client ID and secret must be sent in the POST body. It is recommended to use PKCE to provide a better security.
fr: Seul le flux avec `Code d'Autorisation <https://datatracker.ietf.org/doc/html/rfc6749#section-1.3.1>`_ (avec `PKCE <https://datatracker.ietf.org/doc/html/rfc7636>`_) est pris en charge. Il permet d'échanger un code d'autorisation contre un jeton d'accès. L'identifiant et le secret du client doivent être envoyés dans le corps du message (méthode "POST"). Il est recommandé d'utiliser PKCE pour assurer une meilleure sécurité.

source: added ``equipments`` scopes
fr: ajout du scope ``equipments``

source: added ``follow``, ``notifications``, ``reports`` scopes and added comments to ``workouts`` scopes
fr: ajout des scopes ``follow``, ``notifications`` et ``reports`` et ajout des commentaires au scope ``workouts``

source: added ``geocode`` scope
fr: ajout du scope ``geocode``

source: The following scopes are available:
fr: Les scopes suivants sont disponibles :

source: ``application:write``: grants write access to application configuration (only for users with administration rights),
fr: ``application:write`` : permet d'accéder en écriture à la configuration de l'application (uniquement pour les utilisateurs ayant des droits d'administration),

source: ``equipments:read``: grants read access to equipments endpoints,
fr: ``equipments:read`` : accorde un accès en lecture aux points d'entrée des équipements,

source: ``equipments:write``: grants write access to equipments endpoints,
fr: ``equipments:write`` : accorde un accès en écriture aux points d'entrée des équipements,

source: ``follow:read``: grants read access to follow requests and followers endpoints,
fr: ``follow:read`` : accorde un accès en lecture aux points d'entrée des demandes d'abonnements et des abonnés,

source: ``follow:write``: grants write access to requests and followers endpoints,
fr: ``follow:write`` : accorde un accès en écriture aux points d'entrée des demandes d'abonnements et des abonnés,

source: ``geocode:read``: grants read access to geocoding endpoints,
fr: ``geocode:read`` : accorde un accès en lecture aux points d'entrée pour le *geocoding*,

source: ``notifications:read``: grants read access to notifications endpoints,
fr: ``notifications:read`` : accorde un accès en lecture aux points d'entrée des notifications,

source: ``notifications:write``: grants write access to notifications endpoints,
fr: ``notifications:write`` : accorde un accès en écriture aux points d'entrée des notifications,

source: ``profile:read``: grants read access to auth endpoints,
fr: ``profile:read`` : accorde un accès en lecture aux points d'entrée d'authentification/profil utilisateur,

source: ``profile:write``: grants write access to auth endpoints,
fr: ``profile:write`` : accorde l'accès en écriture aux points d'entrée d'authentification/profil utilisateur,

source: ``reports:read``: grants read access to reports endpoints,
fr: ``reports:read`` : accorde un accès en lecture aux points d'entrée des signalements,

source: ``reports:write``: grants write access to reports endpoints,
fr: ``reports:write`` : accorde un accès en écriture aux points d'entrée des signalements,

source: ``users:read``: grants read access to users endpoints,
fr: ``users:read`` : accorde un accès en lecture aux points d'entrée des utilisateurs,

source: ``users:write``: grants write access to users endpoints,
fr: ``users:write`` : accorde un accès en écriture aux points d'entrée des utilisateurs,

source: ``workouts:read``: grants read access to workouts and comments endpoints,
fr: ``workouts:read`` : accorde un accès en lecture aux points d'entrée des séances et des commentaires,

source: ``workouts:write``: grants write access to workouts and comments endpoints.
fr: ``workouts:write`` : accorde un accès en écriture aux points d'entrée des séances et aux commentaires.

source: Flow
fr: Flux

source: The user creates an App (client) on FitTrackee for a third-party application.
fr: L'utilisateur crée une application (client) sur FitTrackee pour une application tierce.

source: OAuth2 client creation on FitTrackee
fr: Création d'un client OAuth2 sur FitTrackee

source: After registration, the client id and secret are shown.
fr: Après l'enregistrement, l'identifiant et le secret du client sont affichés.

source: They must be stored in the 3rd-party application by the user.
fr: Ils doivent être stockés dans l'application tierce par l'utilisateur.

source: The 3rd-party app needs to redirect to FitTrackee, in order for the user to authorize the 3rd-party app to access user data on FitTrackee.
fr: L'application tierce doit rediriger vers FitTrackee, afin que l'utilisateur puisse autoriser l'application tierce à accéder aux données de l'utilisateur sur FitTrackee.

source: App authorization on FitTrackee
fr: Autorisation de l'application sur FitTrackee

source: The authorization URL is ``https://<FITTRACKEE_HOST>/profile/apps/authorize``.
fr: L'URL pour l'autorisation est ``https://<FITTRACKEE_HOST>/profile/apps/authorize``.

source: The required parameters are:
fr: Les paramètres requis sont les suivants :

source: ``client_id``: the client id displayed after registration
fr: ``client_id`` : l'identifiant du client affiché après l'enregistrement

source: ``response_type``: ``code``, since FitTrackee only supports Authorization Code flow.
fr: ``response_type`` : ``code``, FitTrackee ne supportant que le flux avec code d'autorisation.

source: ``scope``: scopes separated with space.
fr: ``scope`` : scopes séparés par des espaces.

source: and optional parameters:
fr: et des paramètres facultatifs :

source: ``state``: unique value to prevent cross-site request forgery
fr: ``state`` : valeur unique pour empêcher la falsification des requêtes entre les sites (*cross-site request forgery* (CSRF))

source: For PKCE, the following parameters are mandatory:
fr: Pour PKCE, les paramètres suivants sont obligatoires :

source: ``code_challenge``: string generated from a code verifier
fr: ``code_challenge`` : chaîne de caractères générée par un vérificateur de code

source: ``code_challenge_method``: method used to create challenge, for instance "S256"
fr: ``code_challenge_method`` : méthode utilisée pour créer le challenge, par exemple "S256"

source: Example for PKCE:
fr: Exemple pour PKCE :

source: After the authorization, FitTrackee redirects to the 3rd-party app, so the 3rd-party app can get the authorization code from the redirect URL and then fetches an access token with the client id and secret (endpoint `/api/oauth/token <../api/oauth2.html#post--api-oauth-token>`_).
fr: Après autorisation, FitTrackee redirige vers l'application tierce, de sorte que l'application tierce puisse obtenir le code d'autorisation à partir de l'URL de redirection et récupère ensuite un jeton d'accès avec l'identifiant et le secret du client (point d'accès `/api/oauth/token <../api/oauth2.html#post--api-oauth-token>`_).

source: Example of a redirect URL:
fr: Exemple d'URL de redirection :

source: OAuth2 support is implemented with `Authlib <https://docs.authlib.org/en/latest/>`_ library.
fr: La prise en charge d'OAuth2 est mise en œuvre avec la bibliothèque `Authlib <https://docs.authlib.org/en/latest/>`_ bibliothèque.

source: If FitTrackee is running behind a proxy, the ``X-Forwarded-Proto`` header must be set.
fr: Si FitTrackee fonctionne derrière un *proxy*, l'en-tête ``X-Forwarded-Proto`` doit être défini.

source: For instance for ``nginx``:
fr: Par exemple pour ``nginx`` :

source: Resources
fr: Ressources

source: Some resources about OAuth 2.0:
fr: Quelques ressources sur OAuth 2.0 :

source: `OAuth 2.0 Simplified <https://www.oauth.com>`_ by `Aaron Parecki <https://aaronparecki.com>`_ (example for `authorization code flow with PKCE <https://www.oauth.com/oauth2-servers/server-side-apps/example-flow/>`_)
fr: `OAuth 2.0 Simplified <https://www.oauth.com>`_ par `Aaron Parecki <https://aaronparecki.com>`_ (exemple pour le flux avec le `code d'autorisation et PKCE <https://www.oauth.com/oauth2-servers/server-side-apps/example-flow/>`_)

source: `Web App Example of OAuth 2 web application flow <https://requests-oauthlib.readthedocs.io/en/latest/examples/real_world_example.html>`_ with Requests-OAuthlib (python)
fr: `Web App Example of OAuth 2 web application flow <https://requests-oauthlib.readthedocs.io/en/latest/examples/real_world_example.html>`_ avec Requests-OAuthlib (python)

source: `OAuth 2 Session <https://docs.authlib.org/en/latest/client/oauth2.html#oauth-2-session>`_ with Authlib (python)
fr: `OAuth 2 Session <https://docs.authlib.org/en/latest/client/oauth2.html#oauth-2-session>`_ avec Authlib (python)

source: `Minimal example of an application interacting with FitTrackee <https://codeberg.org/SamR1/ft-oauth-client>`_ (python)
fr: `Exemple d'une application minimale interagissant avec FitTrackee <https://codeberg.org/SamR1/ft-oauth-client>`_ (python)

source: Registration & authentication
fr: Inscription et authentification

source: improve registration process
fr: amélioration du processus d'inscription

source: create user account with language detected from browser
fr: création du compte utilisateur avec la langue détectée par le navigateur

source: create user account with time zone detected from browser
fr: création du compte utilisateur avec le fuseau horaire détecté par le navigateur

source: added privacy policy
fr: ajout de la politique de confidentialité

source: If registration is enabled, users can register by providing:
fr: Si l'inscription est activée, les utilisateurs peuvent s'inscrire en fournissant :

source: user name,
fr: nom de l'utilisateur,

source: email,
fr: adresse électronique,

source: password.
fr: mot de passe.

source: Tips for strengthening password security are displayed.
fr: Des conseils pour renforcer la sécurité des mots de passe sont affichés.

source: User registration on FitTrackee
fr: Inscription sur FitTrackee

source: The user must agree to the privacy policy to register.
fr: L'utilisateur doit accepter la politique de confidentialité pour s'inscrire.

source: When a more recent policy is available, a message is displayed on the dashboard to review the new version.
fr: Quand une politique plus récente est disponible, un message s'affiche sur le tableau de bord pour consulter la nouvelle version.

source: The user account is created with language if supported and time zone detected from browser.
fr: Le compte de l'utilisateur est créé avec comme préférences la langue et la fuseau horaire détectés à partir du navigateur.

source: After registration, the user account is inactive and an email with confirmation instructions is sent to activate it.
fr: Après l'enregistrement, le compte d'utilisateur est inactif et un courriel contenant des instructions de confirmation est envoyé pour l'activer.

source: A user with an inactive account cannot log in.
fr: Un utilisateur dont le compte est inactif ne peut pas se connecter

source: In case email sending is not configured, a `command line <../cli.html#ftcli-users-update>`__ allows to activate users account.
fr: Dans le cas où l'envoi des courriels n'est pas configuré, une `interface de ligne de commande <../cli.html#ftcli-users-update>`__ permet d'activer le compte des utilisateurs.

source: After account activation, users can log in with email and password.
fr: Après activation, les utilisateurs peuvent se connecter en saisissant l'adresse électronique et le mot de passe

source: By time period
fr: Par période de temps

source: added total ascent and descent
fr: ajout des dénivelé positif et négatif totaux

source: added average speed
fr: ajout de la vitesse moyenne

source: added average distance, duration, workouts, ascent and descent
fr: ajout des distance, durée, dénivelé positif et négatif moyens et du nombre moyen de séances

source: added day as time period
fr: ajout du jour comme période de temps

source: added total calories and average pace
fr: ajout des calories totales et de l'allure moyenne

source: User statistics, by period (day, week, month, year) and by sport, display:
fr: Les statistiques pour l'utilisateur, par période (jour, semaine, mois, année) et par sport, affichent :

source: totals:
fr: totaux :

source: total ascent
fr: dénivelé positif total

source: total descent
fr: dénivelé négatif total

source: total calories
fr: nombre total de calories

source: averages:
fr: moyennes :

source: average distance
fr: allure moyenne

source: average duration
fr: durée la plus longue

source: average number of workouts
fr: nombre moyen de séances

source: average ascent
fr: allure moyenne

source: average descent
fr: dénivelé négatif moyen

source: average pace
fr: allure moyenne

source: Statistics on FitTrackee
fr: Statistiques sur FitTrackee

source: By sport
fr: Par sport

source: added average pace and total calories
fr: ajout de l'allure moyenne et du nombre de calories totales

source: User statistics by sport display:
fr: Les statistiques de l'utilisateur pour un sport affichent :

source: distance (total and average)
fr: distance (total et moyenne)

source: duration (total and average)
fr: durée (total et moyenne)

source: ascent (total and average)
fr: dénivelé positif (total et moyenne)

source: descent (total and average)
fr: dénivelé négatif (total et moyenne)

source: average pace (if 'pace' is set in the sport preference)
fr: allure moyenne (lorsque l'option 'allure' est sélectionnée dans les préférences du sport)

source: Sport Statistics on FitTrackee
fr: Statistiques d'un sport sur FitTrackee

source: There is a limit on the number of workouts used to calculate statistics to avoid performance issues. The value can be set in `administration <administration.html#configuration>`__.
fr: Il existe une limite au nombre de séances utilisées pour calculer les statistiques afin d'éviter les problèmes de performances. La valeur peut être modifiée dans l'`administration <administration.html#configuration>`__.

source: If the limit is reached, the number of workouts used is displayed.
fr: Si la limite est atteinte, le nombre des séances utilisées est affiché.

source: The total number of workouts for a given sport is not affected by this limit.
fr: Le nombre total des séances pour un sport donné n'est pas affecté par cette limite.

source: FitTrackee is available in the following languages (which can be saved in the user preferences):
fr: FitTrackee est disponible dans les langues suivantes (la langue peut être enregistrée dans les préférences de l'utilisateur) :

source: English
fr: Anglais

source: French (*new in 0.2.3*)
fr: Français (*nouveau dans la version 0.2.3*)

source: German (*new in 0.6.9*)
fr: Allemand (*nouveau dans la version 0.6.9*)

source: Dutch (*new in 0.7.8*)
fr: Néerlandais (*nouveau dans la version 0.7.8*)

source: Italian (*new in 0.7.10*)
fr: Italien (*nouveau dans la version 0.7.10*)

source: Galician (*new in 0.7.15*)
fr: Galicien (*nouveau dans la version 0.7.15*)

source: Spanish (*new in 0.7.15*)
fr: Espagnol (*nouveau dans la version 0.7.15*)

source: Norwegian Bokmål (*new in 0.7.15*)
fr: Norvégien (Bokmål) (*nouveau dans la version 0.7.15*)

source: Polish (*new in 0.7.18*)
fr: Polonais (*nouveau dans la version 0.7.18*)

source: Basque (*new in 0.7.31*)
fr: Basque (*nouveau dans la version 0.7.31*)

source: Czech (*new in 0.8.1*)
fr: Tchèque (*nouveau dans la version 0.8.1*)

source: Portuguese (*new in 0.8.4*)
fr: Portugais (*nouveau dans la version 0.8.4*)

source: Bulgarian (*new in 0.8.8*)
fr: Bulgare (*nouveau dans la version 0.8.8*)

source: Russian (*new in 0.8.10*)
fr: Russe (*nouveau dans la version 0.8.10*)

source: Chinese (Simplified Han script) (*new in 0.9.0*)
fr: Chinois (Simplifié) (*nouveau dans la version 0.9.0*)

source: Croatian (*new in 0.9.8*)
fr: Croate (*nouveau dans la version 0.9.8*)

source: Catalan (*new in 0.10.0*)
fr: Catalan (*nouveau dans la version 0.10.0*)

source: Turkish (*new in 0.10.3*)
fr: Turc (*nouveau dans la version 0.10.3*)

source: Kabyle (*new in 1.0.6*)
fr: Kabyle (*nouveau dans la version 1.0.6*)

source: Application translations status on `Weblate <https://hosted.weblate.org/engage/fittrackee/>`__ (development branch, may differ from the released version):
fr: État d'avancement de la traduction de l'application sur `Weblate <https://hosted.weblate.org/engage/fittrackee/>`__ (branche de développement, peut différer de la version publiée) :

source: Workout
fr: Séance

source: Creation
fr: Création

source: A workout can be created by:
fr: Une séance peut être créée en :

source: uploading manually a file or a zip archive containing a limited number of files,
fr: ajoutant manuellement un fichier ou une archive zip contenant un certain nombre de fichiers

source: or entering workout data (without file).
fr: ou en saisissant les données de la séance (sans fichier gpx).

source: For now, **FitTrackee** has no importer, but some `third-party tools <../third_party_tools.html#importers>`__ allow you to import workouts (for instance from Garmin or Strava accounts).
fr: Pour le moment, **FitTrackee** ne dispose pas d'outil d'importation, mais des `outils tiers <../third_party_tools.html#importers>`__ permettent d'importer des séances (par example à partir d'un compte Garmin ou Strava).

source: File upload
fr: Chargement d'un fichier

source: support for .fit, .kml/.kmz and .tcx files, asynchronous uploads for larger files
fr: prise en charge des fichiers .fit, .kml/.kmz et .tcx, chargements asynchrones pour les fichiers volumineux

source: pause events triggering segment creation (.fit files only)
fr: ajout de l'évènement à l'origine de la création d'un segment pour les fichiers .fit

source: Supported files extensions are:
fr: Les extensions de fichiers sont supportés sont :

source: .kml and .kmz
fr: .kml et .kmz

source: versions supported: 2.2.0 and 2.3.0
fr: versions supportées : 2.2.0 and 2.3.0

source: only files with ``Placemark``/``MultiTrack``/``Tracks`` are supported.
fr: seuls les fichiers avec les tags ``Placemark``/``MultiTrack``/``Tracks`` sont supportées.

source: files with folders or multiple ``Placemark`` are not supported for now.
fr: les fichiers avec des répertoires ou plusieurs ``Placemark`` ne sont pas supportées pour le moment.

source: .zip archive containing files with one of the supported extensions
fr: archive .zip contenant des fichiers avec l'une des extensions prises en charge

source: The maximum file size and number can be modified by administrators.
fr: La taille maximale et le nombre maximal de fichiers peuvent être modifiés par les administrateurs.

source: Only files containing at least time and coordinates are supported (otherwise, errors may occur on upload).
fr: Seuls les fichiers contenant *a minima* la date et l'heure ainsi que les coordonnées sont pris en charge (dans le cas contraire, des erreurs peuvent se produire lors du téléversement).

source: Form for file upload
fr: Formulaire pour ajouter un fichier

source: Technical notes
fr: Notes techniques

source: For extensions other than .gpx, files are converted to .gpx:
fr: Pour les extensions autre que .gpx, les fichiers sont converties to .gpx :

source: .fit: generated .gpx file contains one track (``<trk>``). Depending on user preferences, a new segment (``<trkseg>``) can be created after pause events:
fr: .fit: le fichier .gpx généré contient une trace (``<trk>``). Selon les préférences de l'utilisateur, un nouveau segment (``<trkseg>``) peut être créé après un évènement de type pause :

source: only manual pause event.
fr: seulement les pauses manuelles.

source: .kml: generated .gpx file contains one track (``<trk>``) corresponding to ``<MultiTrack>``, containing one segment (``<trkseg>``) per kml track (``<Track>``)
fr: .kml: le fichier .gpx généré contient une trace (``<trk>``) correspondant au ``<MultiTrack>``, contenant un segment (``<trkseg>``) par trace du fichier .kml (``<Track>``)

source: .tcx: generated .gpx file contains one track (``<trk>``) containing one segment (``<trkseg>``) per activity (``<Activity>``)
fr: .tcx: le fichier .gpx généré contient une trace (``<trk>``) contenant un segment (``<trkseg>``) per activité (``<Activity>``)

source: Archive files (.zip) upload can be asynchronous when enabled by the administrators. Asynchronous uploads can be displayed in user account and can be interrupted by the user. In case errors are encountered, the list of error files is displayed at the end of the upload.
fr: Le chargement des fichiers d'archive (.zip) peut être asynchrone lorsque la fonctionnalité est activée par les administrateurs. Les chargements asynchrones peuvent être affichés dans le compte utilisateur et peuvent être interrompus par l'utilisateur. En cas d'erreurs, la liste des fichiers erronés s'affiche à la fin du chargement.

source: Weather data are not collected during asynchronous uploads to avoid hitting API rate limit.
fr: Les données météo ne sont pas collectées pendant le chargement asynchrone pour éviter d'atteindre les limites d'accès des API.

source: A timeout is set to prevent long-running uploads.
fr: Un délai est défini pour éviter l'exécution trop longue des tâches de chargement.

source: Errored or aborted uploads are not reprocessed.
fr: Les tâches de chargement en erreur ou interrompues ne sont pas retraités.

source: A notification is displayed after task completion.
fr: Une notification est affichée après le traitement de la tâche.

source: Data entry
fr: Saisie des données

source: add ascent and descent
fr: ajout des dénivelés positif et négatif
