Repository: SamR1/FitTrackee
Catalog: docsrc/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: Initialize the database (**after updating** ``db/create.sql`` **to change database credentials**):
fr: Initialiser la base de données (**après avoir mis à jour** ``db/create.sql`` **pour changer les informations de connexion à la base de données**) :

source: Start the server and **Dramatiq** workers:
fr: Démarrer le serveur et les *workers* de **Dramatiq** :

source: If email sending is disabled: ``$ make run-server``
fr: Si l'envoi des courriels est désactivé : ``$ make run-server``

source: Dev environment
fr: Environnements de développement

source: Clone this repo:
fr: Cloner ce dépôt :

source: Install Python virtualenv, Vue and all related packages and initialize the database:
fr: Installer l'environnement virtuel Python, Vue et tous les paquets nécessaires et initialiser la base de données :

source: Start the server and the client:
fr: Démarrer le serveur et le client :

source: Run **Dramatiq** workers:
fr: Démarrer les *workers* de **Dramatiq** :

source: Open http://localhost:3000 and register
fr: Ouvrir l'URL http://localhost:3000 avec un navigateur et s'inscrire

source: add client application for development
fr: ajout de l'application cliente pour le développement

source: add docker image for production
fr: ajout de l'image Docker pour la production

source: Images are available on `DockerHub <https://hub.docker.com/r/fittrackee/fittrackee>`_ or `Github registry <https://github.com/SamR1/FitTrackee/packages>`_.
fr: Des images sont disponible sur `DockerHub <https://hub.docker.com/r/fittrackee/fittrackee>`_ ou `Github registry <https://github.com/SamR1/FitTrackee/packages>`_.

source: Images are available for ``linux/amd64`` and ``linux/arm64`` platforms. Only ``linux/amd64`` image has been tested.
fr: Les images sont disponibles pour les plateformes ``linux/amd64`` et ``linux/arm64``. Seule l'image ``linux/amd64`` a été testée.

source: There is no official image for PostGIS on ARM platforms yet, see `issue on GitHub <https://github.com/postgis/docker-postgis/issues/216>`__.
fr: Il n'y a pas encore d'image officielle de PostGIS sur les plateformes ARM, cf. `ticket sur GitHub <https://github.com/postgis/docker-postgis/issues/216>`__.

source: The workaround is to build PostGIS image locally.
fr: La solution est de générer l'image PostGIS localement.

source: create a ``docker-compose.yml`` file as needed (see the `example <https://github.com/SamR1/FitTrackee/blob/main/docker-compose.yml>`__ in the repository):
fr: créer un fichier ``docker-compose.yml`` selon les besoins (voir l'`exemple <https://github.com/SamR1/FitTrackee/blob/main/docker-compose.yml>`__ dans le dépôt) :

source: the minimal set up requires at least the database and the web application
fr: l'installation minimale nécessite la base de données et l'application web

source: to activate the rate limit, redis is required
fr: pour activer les limitations d'accès à l'API, redis est requis

source: to send e-mails, redis and workers are required and a valid ``EMAIL_URL`` variable must be set in ``.env``
fr: pour envoyer des courriels, redis et les *workers* sont requis et une variable ``EMAIL_URL`` valide doit être initialisée dans le fichier ``.env``

source: The same image is used by the web application and workers.
fr: La même image est utilisée pour l'application Web et les *workers*

source: Following directory must be writable for ``fittrackee`` user (see `docker-compose.yml example <https://github.com/SamR1/FitTrackee/blob/main/docker-compose.yml>`__):
fr: Les répertoires suivants doivent être accessibles en écriture à l'utilisateur ``fittrackee`` (voir le fichier exemple `docker-compose.yml <https://github.com/SamR1/FitTrackee/blob/main/docker-compose.yml>`__):

source: create ``.env`` from example (``.env.docker.example``) and update it (see `Environment variables <environments_variables.html>`__).
fr: Créer le fichier ``.env`` à partir de l'exemple (``.env.docker.example``) et le mettre à jour (cf. `Variables d'environnement <environments_variables.html>`__).

source: to start the application:
fr: pour démarrer l'application :

source: Migrations are executed at startup. Please backup data before updating FitTrackee image version.
fr: Les migrations sont exécutées au lancement du conteneur. Veuillez sauvegarder les données avant de mettre à jour la version de l'image FitTrackee.

source: to run a CLI command, for instance to give admin rights:
fr: pour lancer une commande de l'interface de ligne de commandes (CLI), par example pour donner les droits d'administration :

source: Development
fr: Développement

source: To install and run **FitTrackee**:
fr: Pour installer et lancer **FitTrackee** :

source: Open http://localhost:5000 and register.
fr: Ouvrir l'URL http://localhost:5000 avec un navigateur et s'inscrire.

source: To change ``fittrackee`` container port when running containers with Makefile commands, create a ``.env`` file with `HOST_APP_PORT <environments_variables.html#envvar-HOST_APP_PORT>`__.
fr: Pour changer le port du conteneur ``fittrackee`` lorsque les conteneurs sont lancés avec les commandes Makefile, créer un fichier ``.env`` avec la variable `HOST_APP_PORT <environments_variables.html#envvar-HOST_APP_PORT>`__.

source: For example:
fr: Par exemple :

source: Open http://localhost:8025 to access `MailHog interface <https://github.com/mailhog/MailHog>`_ (email testing tool)
fr: Ouvrir l'URL http://localhost:8025 pour accéder à l'interface de `MailHog <https://github.com/mailhog/MailHog>`_ (outil de test)

source: To stop **Fittrackee**:
fr: Pour arrêter **Fittrackee** :

source: To run shell inside **Fittrackee** container:
fr: Pour lancer le shell dans le container **Fittrackee** :

source: an additional step is needed to install ``fittrackee_client``
fr: une étape additionnelle est nécessaire pour installer `fittrackee_client`

source: to start **FitTrackee** with client dev tools:
fr: pour démarrer **FitTrackee** avec les outils de développement client :

source: Open http://localhost:3000
fr: Ouvrir http://localhost:3000

source: Some environment variables need to be updated like ``UI_URL``
fr: Certaines variables d'environnement doivent être mise à jour comme ``UI_URL``

source: to run lint or tests:
fr: pour lancer le *lint* et les tests :

source: You can use the **Dev Container** without the **debug configuration** and vice versa. Dev Container is strongly recommended on Windows because of path handling issues.
fr: Vous pouvez utiliser le **conteneur de développement** (**Dev Container**) sans la **configuration de débogage** et inversement. Le conteneur de développement est fortement recommandé sous Windows en raison de problèmes de gestion des chemins d'accès.

source: Dev Container
fr: Conteneur de Développement

source: Using a Dev Container gives you a ready-to-use environment (Python, Poetry, Node, etc.) without installing them on your host.
fr: L'utilisation d'un conteneur de développement vous offre un environnement prêt à l'emploi (Python, Poetry, Node, etc.) sans avoir à les installer sur votre machine.

source: **Prerequisites**
fr: **Prérequis**

source: VS Code with `Dev Containers extension <https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-containers>`__
fr: VS Code avec l'extension `Dev Containers <https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-containers>`__

source: **How to use**
fr: **Mode d'emploi**

source: Open the FitTrackee folder in VS Code.
fr: Ouvrir le répertoire FitTrackee dans VS Code.

source: When prompted, choose **Reopen in Container** (or open the Command Palette and run ``Dev Containers: Reopen in Container``).
fr: Lorsque vous y êtes invité, choisissez **Reopen in Container** (ou ouvrez la palette de commandes et exécutez ``Dev Containers: Reopen in Container``).

source: For better file-system performance on Windows/macOS, use an **anonymous container volume** so code and packages are stored inside the VM filesystem.
fr: Pour améliorer les performances du système de fichiers sous Windows/macOS, utilisez un **volume conteneur anonyme** (*anonymous container volume*) afin que le code et les paquets soient stockés dans le système de fichiers de la machine virtuelle.

source: Use the Command Palette action ``Dev Containers: Clone Repository in Container Volume`` to clone into a volume.
fr: Utilisez l'action ``Dev Containers: Clone Repository in Container Volume`` de la palette de commandes pour cloner dans un volume.

source: If you rebuild the container frequently, prefer a **named volume** to preserve installed dependencies between rebuilds.
fr: Si vous reconstruisez fréquemment le conteneur, privilégiez un **volume nommé** (*named volume*) afin de préserver les dépendances installées entre les reconstructions.

source: See `Improve performance <https://code.visualstudio.com/remote/advancedcontainers/improve-performance>`__.
fr: Voir la documentation `Améliorer les performances (Anglais) <https://code.visualstudio.com/remote/advancedcontainers/improve-performance>`__.

source: Port 5000 (fittrackee-ui) is forwarded automatically, if you change APP_PORT you need to manually forward the new port using ``Forward a Port`` command in the Command Palette.
fr: Le port 5000 (fittrackee-ui) est redirigé automatiquement. Si vous modifiez APP_PORT, vous devez rediriger manuellement le nouveau port à l'aide de la commande ``Forward a Port`` dans la palette de commandes.

source: Debug configuration & tasks
fr: Déboguer la configuration et les tâches

source: This repository includes a VS Code *launch* configuration that:
fr: Ce dépôt comprend une configuration de lancement VS Code qui :

source: starts the full Docker Compose dev stack in the background,
fr: démarre la *stack* de développement Docker Compose complète en arrière-plan,

source: waits until services are healthy,
fr: attend que les services soient opérationnels,

source: attaches the debugger to the backend so breakpoints work immediately,
fr: attache le débogueur au backend afin que les points d'arrêt fonctionnent immédiatement,

source: tears the stack down when you stop the debugger.
fr: démonte la *stack* lorsque vous arrêtez le débogueur.

source: **How to start debugging**
fr: **Comment démarrer le débogage**

source: Open the Command Palette and run ``Debug: Start Debugging`` **or** press **F5**.
fr: Ouvrez la palette de commandes et exécutez ``Debug: Start Debugging`` **ou** appuyez sur **F5**.

source: If the debugger fails to attach, use ``Debug: Select Debug Session`` to end the session, check container logs, then run ``Tasks: Run Task`` and then **down: devcontainer-compose** before retrying.
fr: Si le débogueur ne parvient pas à se connecter, utilisez ``Debug: Select Debug Session`` pour mettre fin à la session, vérifiez les logs du conteneur, puis exécutez ``Tasks: Run Task`` et ensuite **down : devcontainer-compose** avant de réessayer.

source: On Linux, ``host.docker.internal`` does not resolve automatically from inside containers. If the debugger fails to attach and logs show connection issues to ``host.docker.internal:5678``, ensure ``.devcontainer\docker-compose-devcontainer.yml`` includes the host gateway mapping:
fr: Sous Linux, ``host.docker.internal`` ne se résout pas automatiquement à partir de l'intérieur des conteneurs. Si le débogueur ne parvient pas à se connecter et que les logs indiquent des problèmes de connexion à ``host.docker.internal:5678``, assurez-vous que ``.devcontainer\docker-compose-devcontainer.yml`` inclut le mappage de la passerelle hôte :

source: Map tile server
fr: Serveur de tuiles

source: added possibility to change map tile provider
fr: ajout de la possibilité de changer le serveur de tuiles

source: handle tile server subdomains
fr: gestion des sous-domaines du serveur de tuile

source: default tile server (**OpenStreetMap**) no longer requires subdomains
fr: les sous-domaines du serveur de tuiles par défaut (**OpenStreetMap**) ne sont plus nécessaires

source: Default tile server is **OpenStreetMap**'s standard tile layer (if environment variables are not initialized). The tile server can be changed by updating ``TILE_SERVER_URL`` and ``MAP_ATTRIBUTION`` variables (`list of tile servers <https://wiki.openstreetmap.org/wiki/Raster_tile_providers>`__).
fr: Le serveur de tuiles par défaut est le serveur standard d'**OpenStreetMap** (si les variables d'environnements ne sont pas initialisées). Le serveur de tuile peut être changé en modifiant les variables ``TILE_SERVER_URL`` et ``MAP_ATTRIBUTION`` (`liste des serveurs de tuiles <https://wiki.openstreetmap.org/wiki/Raster_tile_providers>`__).

source: To keep using **ThunderForest Outdoors**, the configuration is:
fr: Pour conserver **ThunderForest Outdoors**, la configuration est :

source: ``TILE_SERVER_URL=https://{s}.tile.thunderforest.com/outdoors/{z}/{x}/{y}.png?apikey=XXXX`` where **XXXX** is **ThunderForest** API key
fr: ``TILE_SERVER_URL=https://{s}.tile.thunderforest.com/outdoors/{z}/{x}/{y}.png?apikey=XXXX`` où **XXXX** est la clé d'API de **ThunderForest**

source: Check the terms of service of tile provider for map attribution.
fr: Vérifier les conditions d'utilisation du fournisseur de tuiles pour l'attribution des cartes.

source: Since the tile server can be used for static map generation, some servers require a subdomain.
fr: Depuis que le serveur de tuiles peut être utilisé pour la génération des images statiques de cartes, certains serveurs nécessitent un sous-domaine.

source: For instance, to set OSM France tile server, the expected values are:
fr: Par exemple, pour configurer le serveur d\'OSM France, les valeurs attendues sont :

source: The subdomain will be chosen randomly.
fr: Le sous-domaine sera choisi de manière aléatoire.

source: The default tile server (**OpenStreetMap**) no longer requires subdomains.
fr: Le serveur de tuiles par défault (**OpenStreetMap**) ne nécessite plus de sous-domaines.

source: Tasks processing
fr: Traitement des tâches

source: Add ``TASKS_TIME_LIMIT`` variable
fr: Ajout de la variable ``TASKS_TIME_LIMIT``

source: Tasks processing is done using `Dramatiq <https://dramatiq.io/>`_. It requires Redis and is used for email sending, user data exports and workouts archives uploads.
fr: Le traitement des tâches est effectué en utilisant `Dramatiq <https://dramatiq.io/>`_. Il requiert Redis et est utilisé pour l'envoi des emails, les exports de données utilisateurs et le chargement des archives de séances.

source: The following environment variables must be set:
fr: Les variables d'environnement suivantes doivent être définies :

source: `REDIS_URL <environments_variables.html#envvar-REDIS_URL>`__: Redis instance used by **Dramatiq** and **Flask-Limiter**.
fr: `REDIS_URL <environments_variables.html#envvar-REDIS_URL>`__ : Instance Redis utilisée par **Dramatiq** et **Flask-Limiter**.

source: `WORKERS_PROCESSES <environments_variables.html#envvar-WORKERS_PROCESSES>`__: Number of processes used by **Dramatiq**.
fr: `WORKERS_PROCESSES <environments_variables.html#envvar-WORKERS_PROCESSES>`__ : Nombre de processus utilisés par **Dramatiq**.

source: `DRAMATIQ_LOG <environments_variables.html#envvar-DRAMATIQ_LOG>`__: Path to **Dramatiq** log file.
fr: `DRAMATIQ_LOG <environments_variables.html#envvar-DRAMATIQ_LOG>`__ : Chemin du fichier de log de **Dramatiq**

source: To avoid long-running tasks for user data exports and workouts archives uploads, a time limit is set:
fr: Pour éviter que des tâches d'export de données utilisateurs et de chargement d'archives s'exécutent indéfiniment, une durée limite est définie :

source: `TASKS_TIME_LIMIT <environments_variables.html#envvar-TASKS_TIME_LIMIT>`__: Timeout in seconds for **Dramatiq** task execution. The default value is 1800 seconds (30 minutes).
fr: `TASKS_TIME_LIMIT <environments_variables.html#envvar-TASKS_TIME_LIMIT>`__ : *Timeout* en secondes pour l'exécution des tâches par **Dramatiq**. La valeur par défaut est 1800 secondes (30 minutes).

source: To start task queue workers, run the following command after virtual environment activation:
fr: Pour démarrer les *workers* de la file d'attente, exécuter la commande suivante après l'activation de l'environnement virtuel :

source: It is also possible to start task queue workers with **Flask-Dramatiq** CLI, but it is recommended to use **Dramatiq** CLI instead for now.
fr: Il est également possible de démarrer les *workers* de la file d'attente avec l'interface de ligne de commandes de **Flask-dramatiq**, mais il est recommandé d'utiliser l'interface de **Dramatiq** pour le moment.

source: It is possible to run queues independently, for instance for workouts archive uploads:
fr: Il est possible de lancer les files d'attente séparément, par exemple pour le chargement d'archives de séances :

source: The following queues are available:
fr: Les files d'attente suivantes sont disponibles :

source: ``fittrackee_emails``: for emails sending (priority: high)
fr: ``fittrackee_emails``: pour l'envoi des emails (priorité: haute)

source: ``fittrackee_users_exports``: for user data exports (priority: medium)
fr: ``fittrackee_users_exports``: pour les exports de données utilisateurs (priorité: moyenne)

source: ``fittrackee_workouts``: for workouts archive uploads (priority: medium)
fr: ``fittrackee_workouts``: pour le chargement des archives de séances (priorité: moyenne)

source: Run ``dramatiq -h`` to see a list of the available commands.
fr: Lancer ``dramatiq -h`` pour afficher la liste des commandes disponibles.

source: Upgrade
fr: Mise à jour

source: If you are upgrading to version 1.0, additional steps are required, see `Upgrading to 1.0.x <upgrade.html#upgrading-to-1-0-x>`__.
fr: Si vous mettez à jour vers la version 1.0, des étapes supplémentaires sont requises, voir `Mettre à jour vers la version 1.0.x <upgrade.html#upgrading-to-1-0-x>`__.

source: Before upgrading, make a backup of all data:
fr: Avant de procéder à la mise à jour, faire une sauvegarde de l'ensemble des données :

source: database (with `pg_dump <https://www.postgresql.org/docs/current/app-pgdump.html>`__ for instance)
fr: base de données (avec la commande `pg_dump <https://www.postgresql.org/docs/current/app-pgdump.html>`__ par exemple)

source: upload directory (see `Environment variables <environments_variables.html#envvar-UPLOAD_FOLDER>`__)
fr: répertoire des fichiers téléversés (see `Variables d'environnement <environments_variables.html#envvar-UPLOAD_FOLDER>`__)

source: For now, releases do not follow `semantic versioning <https://semver.org>`__. Any version may contain backward-incompatible changes.
fr: Les versions publiées ne suivent pas la `gestion sémantique de version <https://semver.org/lang/fr/>`__. Toute version peut contenir des changements non rétro-compatibles.

source: Only if **FitTrackee** was initially installed from **PyPI**
fr: Seulement si **FitTrackee** a été installé initialement à partir de **PyPI**

source: Stop the application and activate the `virtualenv <https://docs.python.org/3/library/venv.html>`__
fr: Stopper l'application et activer l'`environnement virtuel <https://docs.python.org/3/library/venv.html>`__

source: Upgrade with pip
fr: Mettre à jour avec pip

source: Update environment variables if needed and source environment variables file
fr: Mettre à jour les variables d'environnements si nécessaire et les activer

source: Upgrade database if needed (see changelog for migrations):
fr: Mettre à jour la base de données si nécessaire (voir le journal des changements pour les migrations) :

source: Restart the application and task queue workers (if email sending is enabled).
fr: Redémarrer l'application et les *workers* de la file d'attente des tâches (si l'envoi des courriels est activé).

source: Only if **FitTrackee** was initially installed from sources.
fr: Seulement si **FitTrackee** a été installé initialement à partir des sources.

source: Prod environment
fr: Environnement de production

source: Stop the application
fr: Arrêter l'application

source: Change to the directory where FitTrackee directory is located
fr: Changer pour le répertoire dans lequel FitTrackee est localisé

source: Download the last release (for now, it is the release v1.1.0b3) and overwrite existing files:
fr: Télécharger la dernière version (à ce jour, la version v1.1.0b3) et écraser les fichiers existants :

source: Update **.env** if needed (see `Environment variables <environments_variables.html>`__).
fr: Mettre à jour le fichier **.env** si nécessaire (cf. `Variables d'environnement <environments_variables.html>`__).

source: Upgrade packages:
fr: Mettre à jour les paquets :

source: Restart the server and **Dramatiq** workers:
fr: Redémarrer le serveur et les *workers* de **Dramatiq** :

source: Stop the application and pull the repository:
fr: Arrêter l'application et récupérer les derniers changements du dépôt :

source: Restart the server:
fr: Redémarrer le serveur :

source: Upgrading to 1.0.x
fr: Mettre à jour vers une version 1.0.x

source: This paragraph describes the upgrade from a version prior to 1.0.0 to version 1.0.x.
fr: Ce paragraphe décrit la mise à jour à partir d'une version inférieure à la 1.0.0 vers une version 1.0.x.

source: The version 1.0.0 introduces major changes on workout file processing to improve performances and ease the implementation of the next features:
fr: La version 1.0.0 introduit des changements majeurs dans le traitement des fichiers des séances afin d'améliorer les performances et faciliter l'implémentation des futures fonctionnalités:

source: data displayed in the workout chart are stored in the database,
fr: les données affichées dans le graphique de la séance sont maintenant stockées en base de données,

source: and segments geometry is also stored.
fr: ainsi que les géométries des segments.

source: This last change requires `PostGIS <https://postgis.net/>`__ extension, which adds geospatial capabilities to the `PostgreSQL <https://www.postgresql.org/>`__ database.
fr: Ce dernier changement nécessite l'extension `PostGIS <https://postgis.net/>`__, pour ajouter les fonctionnalitées géospatiales à la base de données `PostgreSQL <https://www.postgresql.org/>`__.

source: Instructions for upgrade
fr: Instructions de mise à jour

source: These actions must be performed before upgrading to version 1.1.0.
fr: Ces actions doivent être effectuées avant la mise à niveau vers la version 1.1.0.

source: From PyPI or sources
fr: A partir PyPI ou des sources

source: **PostGIS** must be installed on your operating system. You can find instructions for your OS on `PostGIS documentation <https://postgis.net/documentation/getting_started/>`_.
fr: **PostGIS** doit être installé sur le système d'exploitation. Vous pouvez trouver les instructions pour votre système d'exploitation dans la `documentation de PostGIS <https://postgis.net/documentation/getting_started/>`_.

source: Here are the instructions for installation on ArchLinux with `yay <https://github.com/Jguer/yay>`__ (to adapt depending on your operating system):
fr: Voici les instructions pour une installation sur ArchLinux avec `yay <https://github.com/Jguer/yay>`__ (à adapter selon le système d'exploitation) :

source: stop the application and workers
fr: arrêter l'application et les *workers*

source: install **PostGIS** on the server running the database
fr: installer **PostGIS** sur le serveur de la base de données

source: add **PostGIS** extension to the database
fr: ajouter l'extension **PostGIS** à la base de données
