Repository: SamR1/FitTrackee
Catalog: docsrc/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: distance (only workouts without gpx)
fr: distance (seulement pour les séances sans gpx)

source: ascent and descent (only workouts without gpx)
fr: dénivelés positif et négatif (seulement pour les séances sans gpx)

source: Some values are only calculated on workout creation.
fr: Certains valeurs sont calculées uniquement à la création de la séance.

source: The previously uploaded workouts are not updated in the following cases:
fr: Les séances précédemment créées sont pas mises à jour dans les cas suivants :

source: updating some preferences ("max. speed calculation strategy" and "pause events triggering segment creation"),
fr: mise à jour de certaines préférences ("stratégie de calcul de la vitesse maximale" et "Type de pause déclenchant la création d'un segment"),

source: updating stopped speed threshold in sport preferences (used to calculate pauses),
fr: mise à jour du seuil de vitesse d'arrêt dans les préférences des sports (utilisé pour calculer les pauses),

source: configuring a weather data provider,
fr: configuration d'un fournisseur de données météo.

source: some new features,
fr: ajout de certaines nouvelles fonctionnalités

source: Garmin device mappings update,
fr: mise à jour de la correspondance des produits Garmin,

source: bug fixes on file processing.
fr: correction de bugs sur le traitement des fichiers.

source: The calculated data can be refreshed by clicking on **Refresh** button and weather data fetched (if provider is set and the workout does not have weather data).
fr: Les données calculées peuvent être rafraîchies en cliquant sur le bouton **Refresh** et les données météo mises à jour (si un fournisseur de données est configuré et que la séance n'est pas de données météo)

source: A `CLI command <../cli.html#ftcli-workouts-refresh>`__ is available to refresh several workouts depending on options.
fr: Une `commande de l'interface de ligne de commandes (CLI) <../cli.html#ftcli-workouts-refresh>`__ est disponible pour actualiser plusieurs séances selon des options.

source: The elevation data source can be changed if an `elevation service <../installation/elevation.html>`__ is enabled by the administrators.
fr: La source des données d'altitude peut également être modifiée après la création si un `service d'altitude <../installation/elevation.html>`__ est activé.

source: In this case, the available services are displayed after clicking on the button **Change elevation data source**:
fr: Dans ce cas, les services disponibles s'affichent après avoir cliqué sur le bouton **Modifier la source des données d'altitude** :

source: List of available elevation sources
fr: Liste des sources d'élévation disponibles

source: It is also possible to get the elevation again from the file:
fr: Il est également possible d'obtenir à nouveau l'altitude à partir du fichier :

source: List of available elevation sources with file
fr: Liste des sources d'élévation disponibles avec le fichier

source: A workout can be deleted by clicking on the **Delete** button.
fr: Une séance peut être supprimée en cliquant sur le bouton **Supprimer**.

source: Workouts list
fr: Liste des séances

source: added filter on title
fr: ajout du filtre sur le titre

source: added filter on equipment and notes
fr: ajout du filtre sur l'équipement et les notes

source: added filter on description
fr: ajout d'un filter sur la description

source: added filter on workout visibility
fr: ajout du filtre sur la visibilité de la séance

source: added statistics
fr: ajout des statistiques

source: added average distance, average duration, average ascent and average descent displayed in statistics
fr: ajout des distance, durée, dénivelé positif et négatif moyen dans les statistiques affichées

source: added filter on location and radius, map for filtered workouts
fr: ajout du filter sur la localisation et le rayon et aout de la carte des séances filtrées

source: added filter and sort option on pace
fr: ajout du filtre et du tri sur l'allure

source: By default, the last 10 workouts are displayed in the list.
fr: Par défaut, les 10 dernières séances sont affichées dans la liste.

source: Users can filter workouts on:
fr: Les utilisateurs peuvent filtrer les séances selon :

source: sports (only sports with workouts are displayed in sport dropdown)
fr: sports (seuls les sports comportant des séances sont affichés dans la liste déroulante)

source: equipment (only equipments with workouts are displayed in equipment dropdown)
fr: équipement (seuls les équipements associés des séances sont affichés dans la liste déroulante)

source: notes
fr: notes personnelles

source: location and radius
fr: localisation et rayon

source: duration
fr: durée

source: when only one sport is displayed and 'pace' is set in the sport preference:
fr: lorsqu'un seul sport est affiché et que 'allure' est sélectionnée dans les préférences du sport :

source: maximum pace (= best pace)
fr: allure max. (= meilleure allure)

source: Workouts List on FitTrackee
fr: Liste des séances sur FitTrackee

source: Workouts can be sorted by:
fr: Les séances peuvent être triées par :

source: average pace (when only one sport is displayed and 'pace' is set in the sport preference)
fr: allure moyenne (lorsqu'un seul sport est affiché et que 'allure' est sélectionnée dans les préférences du sport)

source: The number of displayed workouts can be changed (10, 25, 50 or 100 per page).
fr: Le nombre de séances affichées peut être modifié (10, 25, 50 ou 100 par page).

source: Statistics are displayed when more than one workout is displayed:
fr: Des statistiques sont affichées quand plus d'une séance est affichée :

source: maximum speed (when workouts belong to the same sport)
fr: vitesse maximale (quand les séances appartiennent au même sport)

source: average speed (when workouts belong to the same sport)
fr: vitesse moyenne (quand les séances appartiennent au même sport)

source: when workouts belong to the same sport and 'pace' is set in the sport preference:
fr: lorsque les séances appartiennent au même sport et que 'allure' est sélectionnée dans les préférences du sport

source: When multiple pages are fetched, statistics for all pages are also displayed.
fr: Quand plusieurs pages sont récupérées, les statistiques pour l'ensemble des pages sont également affichées.

source: Filtered workouts can be displayed on a map:
fr: Les séances filtrées peuvent être affichées sur une carte :

source: FitTrackee Workouts Map
fr: carte des séances sur FitTrackee

source: This web application allows you to track your outdoor activities (workouts) from gpx files (or other formats) and keep your data on your own server.
fr: Cette application web vous permet de suivre vos activités sportives de plein air à partir de fichiers gpx (ou d'autres formats) et de conserver vos données sur votre propre serveur.

source: No mobile app has been developed yet, but several existing mobile apps or devices can store workouts data locally and export them into a file.
fr: Aucune application mobile n'a encore été développée, mais plusieurs applications mobiles existantes ou appareils peuvent stocker les données des séances localement et les exporter dans un fichier.

source: Examples for Android applications (non-exhaustive list):
fr: Exemples d'applications Android (liste non exhaustive) :

source: To get workouts from devices like smartwatches:
fr: Pour récupérer les séances à partir d'appareils comme les montres connectées :

source: Maps are displayed using `Open Street Map <https://www.openstreetmap.org>`__.
fr: Les cartes sont affichées à l'aide de `Open Street Map <https://www.openstreetmap.org>`__.

source: It is also possible to add a workout without a file.
fr: Il est également possible d'ajouter une séance sans fichier.

source: **Still under heavy development (some features may be unstable).**
fr: **En cours de développement (certaines fonctionnalités peuvent être instables).**

source: (see `issues <https://github.com/SamR1/FitTrackee/issues>`__ for more information)
fr: (cf. `tickets <https://github.com/SamR1/FitTrackee/issues>`__ pour plus d'informations)

source: Table of contents
fr: Table des matières

source: API rate limits
fr: Limitation d'accès à l'API

source: Remove ``API_RATE_LIMITS`` default value in order to disable only rate limits when Redis is set
fr: Suppression de la valeur par défaut de la variable ``API_RATE_LIMITS`` afin de pouvoir désactiver la limitation d'accès quand Redis est configuré

source: If `API_RATE_LIMITS <environments_variables.html#envvar-API_RATE_LIMITS>`__ environment variable is not empty and **Redis** available, API rate limits are managed by `Flask-Limiter <https://flask-limiter.readthedocs.io/en/stable>`_, based on IP with fixed window strategy.
fr: Si la variable `API_RATE_LIMITS <environments_variables.html#envvar-API_RATE_LIMITS>`__ est définie et que **Redis** est disponible, la limitation d'accès à l'API est gérée par `Flask-Limiter <https://flask-limiter.readthedocs.io/en/stable>`_, et basée sur l'adresse IP avec une stratégie de période fixe.

source: If no Redis instance is available for rate limits, FitTrackee can still start.
fr: Si aucune instance Redis n'est disponible, FitTrackee pourra tout de même démarrer.

source: All endpoints are subject to rate limits, except endpoints serving assets.
fr: Tous les points d'accès sont soumis à des limitations d'accès sauf les points servant des *assets*.

source: Limits are configured by setting the environment variable ``API_RATE_LIMITS``, for example ``300 per 5 minutes`` (see `Flask-Limiter documentation for notation <https://flask-limiter.readthedocs.io/en/stable/configuration.html#rate-limit-string-notation>`_).
fr: Les limites sont définies en configurant la variable ``API_RATE_LIMITS``, par exemple ``300 per 5 minutes`` (cf. la `documentation Flask-Limiter sur la notation <https://flask-limiter.readthedocs.io/en/stable/configuration.html#rate-limit-string-notation>`_).

source: Multiple rate limits must be separated by a comma, for instance:
fr: Les limites multiples doivent être séparées par des virgules, par exemple :

source: **Flask-Limiter** provides a `Command Line Interface <https://flask-limiter.readthedocs.io/en/stable/cli.html>`_ for maintenance and diagnostic purposes.
fr: **Flask-Limiter** fournit une `Interface de ligne de commande <https://flask-limiter.readthedocs.io/en/stable/cli.html>`_ à des fins de maintenance et de diagnostic.

source: Rate limits can be managed by other applications, like `nginx <https://nginx.org/en/docs/http/ngx_http_limit_req_module.html>`__.
fr: La limitation d'accès peut être gérée par d'autres applications, telles que `nginx <https://nginx.org/en/docs/http/ngx_http_limit_req_module.html>`__.

source: Deployment
fr: Déploiement

source: This documentation does not detail how to secure a server. Please refer to the documentation and best practices corresponding to your installation and operating system.
fr: Cette documentation ne détaille pas comment sécuriser un serveur. Veuillez vous reporter à la documentation et aux bonnes pratiques correspondant à votre installation et à votre système d'exploitation.

source: There are several ways to start **FitTrackee** web application and task queue library.
fr: Il y a plusieurs méthodes pour démarrer et servir l'application web **FitTrackee** et l'application de gestion de la file d'attente de tâches.

source: One way is to use a **systemd** services and **Nginx** to proxy pass to **Gunicorn**.
fr: Un des moyens est d'utiliser les services **systemd** et **Nginx** pour *proxy passer* à **Gunicorn**.

source: Examples:
fr: Exemples :

source: To adapt depending on your instance configuration and operating system.
fr: À adapter selon la configuration de votre instance et votre système d'exploitation.

source: for application: ``fittrackee.service``
fr: pour l'application : ``fittrackee.service``

source: To handle large files, a higher value for `timeout <https://docs.gunicorn.org/en/stable/settings.html#timeout>`__ can be set.
fr: Pour gérer les fichiers de taille importante, une valeur plus importante pour le `timeout <https://docs.gunicorn.org/en/stable/settings.html#timeout>`__ peut être configurée.

source: More information on deployment with Gunicorn in its `documentation <https://docs.gunicorn.org/en/stable/deploy.html>`__.
fr: Plus d'informations sur le déploiement avec Gunicorn dans sa `documentation <https://docs.gunicorn.org/en/stable/deploy.html>`__.

source: for task queue workers: ``fittrackee_workers.service``
fr: pour les *workers* de la file d'attente : ``fittrackee_workers.service``

source: Command to be adapted to run queues separately.
fr: Commande à adapter pour exécuter les files d'attente séparément.

source: More information on **Dramatiq** CLI in its `documentation <https://dramatiq.io/guide.html#workers>`__.
fr: Plus d'informations sur l'interface de ligne de commandes de **Dramatiq** dans sa `documentation <https://docs.gunicorn.org/en/stable/deploy.html>`__.

source: **Nginx** configuration:
fr: Configuration **Nginx** :

source: If needed, update configuration to handle larger files (see `client_max_body_size <https://nginx.org/en/docs/http/ngx_http_core_module.html#client_max_body_size>`_).
fr: Si besoin, modifier la configuration pour gérer les fichiers de taille importante (cf. `client_max_body_size <https://nginx.org/en/docs/http/ngx_http_core_module.html#client_max_body_size>`_).

source: Elevation data
fr: Données d'altitude

source: The following elevation data providers are supported by **FitTrackee**:
fr: Les fournisseurs de données d'altitude suivants sont pris en charge par **FitTrackee** :

source: To configure a provider, set the following environment variables:
fr: Pour configurer un fournisseur de données, initialiser les variables d'environnement suivantes :

source: `OPEN_ELEVATION_API_URL <environments_variables.html#envvar-OPEN_ELEVATION_API_URL>`__: URL of OpenElevation service (public API or self-hosted instance)
fr: `OPEN_ELEVATION_API_URL <environments_variables.html#envvar-OPEN_ELEVATION_API_URL>`__: URL du service OpenElevation service (API publique ou instance auto-hébergée)

source: `VALHALLA_API_URL <environments_variables.html#envvar-VALHALLA_API_URL>`__: URL of Valhalla service (public API or self-hosted instance)
fr: `VALHALLA_API_URL <environments_variables.html#envvar-VALHALLA_API_URL>`__: URL du service Valhalla service (API publique ou instance auto-hébergée).

source: The configured elevation data providers are displayed in **About** page.
fr: Les fournisseurs de données d'altitude configurés sont affichés dans la page **À propos**.

source: Emails
fr: Courriels

source: Credentials and port can be omitted
fr: Les informations d'identification et le port peuvent être omis

source: Disable email sending
fr: Désactivation de l'envoi des courriels

source: An email is sent when a data export archive is ready to download
fr: Un courriel est envoyé lorsqu'une archive d'export de données est prête à être téléchargée

source: Handle special characters in password
fr: Gestion des caractères spéciaux dans le mot de passe

source: An email is sent after moderation action
fr: Un courriel est envoyé après une action de modération

source: To send emails, a valid ``EMAIL_URL`` must be provided:
fr: Pour l'envoi des courriels, une valeur valide pour la variable ``EMAIL_URL`` doit être fourni :

source: with an unencrypted SMTP server: ``smtp://username:password@smtp.example.com:25``
fr: avec un serveur SMTP sans chiffrement : ``smtp://username:password@smtp.example.com:25``

source: with SSL: ``smtp://username:password@smtp.example.com:465/?ssl=True``
fr: avec SSL : ``smtp://username:password@smtp.example.com:465/?ssl=True``

source: with STARTTLS: ``smtp://username:password@smtp.example.com:587/?tls=True``
fr: avec STARTTLS : ``smtp://username:password@smtp.example.com:587/?tls=True``

source: Credentials can be omitted: ``smtp://smtp.example.com:25``. If ``:<port>`` is omitted, the port defaults to 25.
fr: Les informations d'identification peuvent être omises : ``smtp://smtp.example.com:25``. Si ``:<port>`` est omis ``:<port>``, the port utilisé par défault est 25.

source: Password can be encoded if it contains special characters. For instance with password ``passwordwith@and&and?``, the encoded password will be: ``passwordwith%40and%26and%3F``.
fr: Le mot de passe peut être encodé s'il contient des caractères spéciaux. Par exemple avec le mot de passe ``passwordwith@and&and?``, le mot de passe encodé sera ``passwordwith%40and%26and%3F``.

source: If the email URL is invalid, the application may not start.
fr: Si l'URL du serveur est invalide, l'envoi des courriels sera désactivé.

source: Sending emails with Office365 may not work if SMTP auth is disabled.
fr: L'envoi de courriels avec Office365 peut ne pas fonctionner si l'authentification SMTP est désactivée.

source: Since 0.6.0, newly created accounts must be confirmed (an email with confirmation instructions is sent after registration).
fr: Depuis la version 0.6.0, les comptes nouvellement créés doivent être confirmés (un courriel contenant des instructions de confirmation est envoyé après l'inscription).

source: Emails sent by FitTrackee are:
fr: Les courriels envoyés par FitTrackee sont :

source: account confirmation instructions
fr: instructions pour la confirmation du compte

source: password reset request
fr: demande de réinitialisation du mot de passe

source: email change (to old and new email addresses)
fr: changement d'adresse électronique (vers l'ancienne et la nouvelle adresse)

source: password change
fr: changement de mot de passe

source: notification when a data export archive is ready to download
fr: notification lorsqu'une archive d'export de données est prête à être téléchargée

source: suspension and warning
fr: suspension et avertissement

source: suspension and warning lifting
fr: levée de suspension et d'avertissement

source: rejected appeal
fr: demande d'appel rejetée

source: On single-user instance, it is possible to disable email sending with an empty `EMAIL_URL <environments_variables.html#envvar-EMAIL_URL>`__ (in this case, no need to start **Dramatiq** workers).
fr: Dans le cas des instances avec un seul utilisateur, il est possible de désactiver l'envoi de courriels en laissant la variable `EMAIL_URL <environments_variables.html#envvar-EMAIL_URL>`__ vide (dans ce cas il n'est pas nécessaire de lancer les *workers* de **Dramatiq**).

source: A `CLI <../cli.html#ftcli-users-update>`__ is available to activate account, modify email and password and handle data export requests.
fr: Une `interface de ligne de commande (CLI) <../cli.html#ftcli-users-update>`__ est disponible pour activer les comptes, modifier l'adresse électronique et le mot de passe et gérer les demandes d'exports de données.

source: Environment variables
fr: Variables d'environnement

source: Since FitTrackee 0.4.0, ``Makefile.custom.config`` is replaced by ``.env``
fr: Depuis la version 0.4.0 de FitTrackee, le fichier ``Makefile.custom.config`` est remplacé par le fichier ``.env``

source: General variables
fr: Variables générales

source: The following environment variables are used by **FitTrackee** web application or the task processing library. They are not all mandatory depending on deployment method.
fr: Les variables d'environnements suivantes sont utilisées par l'application web de **FitTrackee** ou la librairie de gestion de la file d'attente des tâches. Elles ne sont pas toutes obligatoires selon la méthode de déploiement.

source: remove default value
fr: suppression de la valeur par défaut

source: API rate limits set for **Flask-Limiter** see `API rate limits <api_rate_limits.html>`__.
fr: Limites d'accès à l'API utilisées par **Flask-Limiter**, cf. `Limitation d'accès à l'API <api_rate_limits.html>`__.

source: Path to log file
fr: Chemin du fichier de log

source: If the value is not set, logging output is displayed only on the console.
fr: Si la valeur n'est pas définie, la sortie des logs est affichée uniquement sur la console.

source: **FitTrackee** secret key, must be initialized in production environment.
fr: clé secrète de **FitTrackee**, doit être initialisé sur un environnement de production.

source: Use a strong secret key. This key is used in JWT generation.
fr: Utiliser une clé secrète forte. Cette clé est utilisée pour la génération des jetons JWT.

source: **FitTrackee** configuration.
fr: Configuration de **FitTrackee**.

source: default
fr: défaut

source: Timeout (in seconds) for workers spawned by **Gunicorn** (when starting application with **FitTrackee** entry point or with Docker image), see `Gunicorn documentation <https://docs.gunicorn.org/en/stable/settings.html#timeout>`__).
fr: `timeout` (en secondes) pour les *workers* lancés par **Gunicorn** (dans le cas du démarrage direct avec le point d’entrée de FitTrackee ou avec l'image Docker), voir la documentation de `Gunicorn <https://docs.gunicorn.org/en/stable/settings.html#workers>`__.

source: used by the Docker image entry point script
fr: utilisé par le script du point d'entrée de l'image Docker

source: Number of workers spawned by **Gunicorn** (when starting application with **FitTrackee** entry point or with Docker image), see `Gunicorn documentation <https://docs.gunicorn.org/en/stable/settings.html#workers>`__.
fr: Nombre de *workers* lancés par **Gunicorn** (dans le cas du démarrage direct avec le point d’entrée de FitTrackee ou avec l'image Docker), voir la documentation de `Gunicorn <https://docs.gunicorn.org/en/stable/settings.html#workers>`__.

source: Disable pooling if needed (when starting application with **FitTrackee** entry point and not directly with **Gunicorn**), see `SqlAlchemy documentation <https://docs.sqlalchemy.org/en/13/core/pooling.html#using-connection-pools-with-multiprocessing-or-os-fork>`__.
fr: Désactiver le *pooling* si nécessaire (dans le cas du démarrage direct avec le point d'entrée de **FitTrackee** et non avec **Gunicorn**), cf. la `documentation de SqlAlchemy <https://docs.sqlalchemy.org/en/13/core/pooling.html#using-connection-pools-with-multiprocessing-or-os-fork>`__.

source: Database URL with username and password, must be initialized in production environment.
fr: URL de la base de données avec le nom et le mot de passe de l'utilisateur, doit être initialisée sur les environnements de production.

source: For example in dev environment : ``postgresql://fittrackee:fittrackee@localhost:5432/fittrackee``
fr: Exemple pour un environnement de développement : ``postgresql://fittrackee:fittrackee@localhost:5432/fittrackee``

source: Since `SQLAlchemy update (1.4+) <https://docs.sqlalchemy.org/en/14/changelog/changelog_14.html#change-3687655465c25a39b968b4f5f6e9170b>`__, engine URL should begin with ``postgresql://``.
fr: Depuis la `version 1.4+ de SQLAlchemy <https://docs.sqlalchemy.org/en/14/changelog/changelog_14.html#change-3687655465c25a39b968b4f5f6e9170b>`__, l'URL doit commencé avec `postgresql://`.

source: If ``True``, it keeps using **Static Map 3** default tile server to generate static maps (OSM tile server).
fr: Si ``True``, le serveur de tuile par défaut de **Static Map 3** est conservé pour générer les images statiques de cartes (serveur de tuiles OSM).

source: Otherwise, it uses the tile server set in `TILE_SERVER_URL <environments_variables.html#envvar-TILE_SERVER_URL>`__.
fr: Sinon, le serveur de tuiles configuré au niveau de la variable `TILE_SERVER_URL <environments_variables.html#envvar-TILE_SERVER_URL>`__ sera utilisé.

source: This variable is now case-insensitive.
fr: Cette variable est maintenant insensible à la casse.
