Repository: SamR1/FitTrackee
Catalog: docsrc/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: If ``False``, depending on tile server, `subdomains <environments_variables.html#envvar-STATICMAP_SUBDOMAINS>`__ may be mandatory.
fr: Si ``False``, selon le serveur de tuile, les `sous-domaines <environments_variables.html#envvar-STATICMAP_SUBDOMAINS>`__ peuvent être obligatoires.

source: Path to **Dramatiq** log file.
fr: Chemin du fichier de log de **Dramatiq**

source: Email URL with credentials, see `Email <emails.html>`__.
fr: URL du serveur d'envoi des courriels avec les informations de connexion, cf. `Courriels <emails.html>`__.

source: empty string
fr: chaine de caractère vide

source: If the email URL is empty, email sending will be disabled.
fr: Si l'URL du serveur est vide, l'envoi des courriels sera désactivé.

source: Enables geospatial features on User Interface.
fr: Active les fonctionnalités géospatiales sur l'interface utilisateur.

source: **Keep the value set to** ``False`` **until all workouts have been updated to add geometries** (see `Workouts CLI command <../cli.html#ftcli-workouts-refresh>`__).
fr: **Garder la valeur à** ``False`` **jusqu'à ce que toutes les séances aient été mises à jour pour ajouter les geométries** (voir `l'interface de ligne de commandes des séances <../cli.html#ftcli-workouts-refresh>`__).

source: This variable is case-insensitive.
fr: Cette variable est insensible à la casse.

source: This is a temporary flag. It will be removed in the next version, which will require all workouts to be updated.
fr: Il s'agit d'un indicateur temporaire. Il sera supprimé dans la prochaine version, ce qui nécessitera la mise à jour de tous les séances.

source: Name of the module to import at flask run.
fr: Nom du module à importer au démarrage de Flask.

source: ``FLASK_APP`` should contain ``$(PWD)/fittrackee/__main__.py`` with installation from sources, else ``fittrackee``.
fr: ``FLASK_APP`` doit contenir ``$(PWD)/fittrackee/__main__.py`` dans le cas de l'installation à partir des sources, sinon ``fittrackee``.

source: **FitTrackee** host.
fr: Hôte **FitTrackee**.

source: Log level for **Gunicorn** (when starting application with **FitTrackee** entry point or with Docker image), see `Gunicorn documentation <https://docs.gunicorn.org/en/stable/settings.html#loglevel>`__).
fr: Niveau de log pour **Gunicorn** (dans le cas du démarrage direct avec le point d’entrée de FitTrackee ou avec l'image Docker), voir la documentation de `Gunicorn <https://docs.gunicorn.org/en/stable/settings.html#loglevel>`__.

source: Map attribution (if using another tile server), see `Map tile server <map_tile_server.html>`__.
fr: Attribution de la carte (si une autre serveur de tuile est utilisé), cf. `Serveur de tuiles <map_tile_server.html>`__.

source: URL of `Nominatim <https://nominatim.org>`__ server, used to get location coordinates from user input
fr: URl du server `Nominatim <https://nominatim.org>`__, permettant d'obtenir les coordonnées de la localisation saisie par l'utilisateur.

source: URL of `OpenElevation <https://open-elevation.com/>`__ service (public API or self-hosted instance).
fr: URL du service `OpenElevation <https://open-elevation.com/>`__ (API publique ou auto-hébergée).

source: **FitTrackee** port.
fr: Port de l'application web **FitTrackee**.

source: Redis instance used by **Dramatiq** and **Flask-Limiter**.
fr: Instance Redis utilisée par **Dramatiq** et **Flask-Limiter**.

source: local Redis instance (``redis://``)
fr: instance locale Redis (``redis://``)

source: **FitTrackee** sender email address.
fr: Adresse électronique de l'expéditeur **FitTrackee**.

source: Directory for **Static Map 3** cache
fr: Répertoire pour le cache de **Static Map 3**

source: This is the library's default variable, to be modified to set another directory.
fr: Il s'agit de la variable par défaut de la bibliothèque, à modifier pour définir un autre répertoire

source: Some tile servers require a subdomain, see `Map tile server <map_tile_server.html>`__.
fr: Certains serveurs de tuiles nécessitent un sous-domaine, cf. `Serveur de tuiles <map_tile_server.html>`__.

source: For instance: "a,b,c" for OSM France.
fr: Par exemple: "a,b,c" pour OSM France.

source: Timeout in seconds for **Dramatiq** task execution to avoid long-running tasks.
fr: *Timeout* en secondes pour l'exécution des tâches par **Dramatiq** pour éviter des exécutions trop longues

source: Tile server URL (with api key if needed), see `Map tile server <map_tile_server.html>`__.
fr: URl du serveur de tuiles (avec la clé de l'API si nécessaire), cf. `Serveur de tuiles <map_tile_server.html>`__.

source: Since **0.4.9**, it's also used to generate static maps (to keep default server, see `DEFAULT_STATICMAP <environments_variables.html#envvar-DEFAULT_STATICMAP>`__)
fr: Depuis la version **0.4.9**, il est également utiliser pour générer les images statiques des cartes (pour garder le serveur par défaut cf. `DEFAULT_STATICMAP <environments_variables.html#envvar-DEFAULT_STATICMAP>`__)

source: The default URL is updated: **OpenStreetMap**'s tile server no longer requires subdomains.
fr: L'URL par défaut a été mise à jour : le serveur de tuiles **OpenStreetMap** ne nécessite plus de sous-domaines.

source: **FitTrackee** URL, needed for links in emails and mentions on interface.
fr: URL de **FitTrackee**, nécessaire pour les liens dans les courriels et les mentions sur l'interface.

source: UI_URL must contains url scheme (``https://``).
fr: UI_URL doit contenir le schéma d'URI (``https://``).

source: **Absolute path** to the directory where ``uploads`` folder will be created.
fr: Un **chemin absolu** vers le répertoire dans le répertoire `uploads` sera créé.

source: With installation from PyPI, the directory will be located in **virtualenv** directory if the variable is not initialized.
fr: Dans le cas d'une installation avec PyPI, le répertoire sera localisé dans le répertoire de l'environnement virtuel Python si la variable n'est pas initialisée.

source: URL of `Valhalla <https://valhalla.github.io/valhalla/>`__ service (public API or self-hosted instance).
fr: URL du service `Valhalla <https://valhalla.github.io/valhalla/>`__ (API publique ou auto-hébergée).

source: ⚠️ replaces ``VUE_APP_API_URL``
fr: ⚠️ remplace ``VUE_APP_API_URL``

source: **FitTrackee** API URL, only needed in dev environment.
fr: URL de l'API de **FitTrackee**, nécessaire uniquement pour l'environnement de développement.

source: ⚠️ replaces ``WEATHER_API``
fr: ⚠️ remplace ``WEATHER_API``

source: Weather API key (not mandatory), see ``WEATHER_API_PROVIDER``.
fr: Clé d'API du fournisseur de données météo (non obligatoire), cf. ``WEATHER_API_PROVIDER``.

source: Provider for weather data (not mandatory), see `Weather data <weather.html>`__.
fr: Fournisseur de données météo (non obligatoire), cf. `Données météo <weather.html>`__.

source: Number of processes used by **Dramatiq**.
fr: Nombre de processus utilisés par **Dramatiq**.

source: Rename variables and add ``HOST_STATICMAP_CACHE_DIR``
fr: Renommage des variables et ajout de ``HOST_STATICMAP_CACHE_DIR``

source: Application container port
fr: Port du conteneur de l'application.

source: Host directory for PostgreSQL data volume
fr: Répertoire de l'hôte pour le volume des données PostgreSQL

source: User for PostgreSQL database
fr: Utilisateur de la base de données PostgreSQL

source: Password for PostgreSQL user
fr: Mot de passe de l'utilisateur PostgreSQL

source: Database name for FitTrackee application
fr: Nom de la base de données de l'application FitTrackee

source: Host directory for redis data volume
fr: Répertoire de l'hôte pour le volume des données redis

source: Host directory for logs volume
fr: Répertoire de l'hôte pour le volume des logs

source: Host directory for uploaded files volume
fr: Répertoire de l'hôte pour le volume des fichiers téléversés

source: Host directory for Static Map 3 cache volume
fr: Répertoire de l'hôte pour le volume du cache de Static Map 3

source: **FitTrackee** can be installed:
fr: **FitTrackee** peut être installé :

source: via a single Python package from `PyPI <https://pypi.org/project/fittrackee/>`__,
fr: grâce un simple paquet Python à partir de `PyPI <https://pypi.org/project/fittrackee/>`__,

source: from sources,
fr: à partir des sources,

source: with a `Docker <installation.html#docker>`__ image.
fr: avec une image `Docker <installation.html#docker>`__.

source: Thanks to contributors, packages are also available on `Yunohost <https://apps.yunohost.org/app/fittrackee>`__ and `NixOS <https://search.nixos.org/packages?query=fittrackee>`__.
fr: Grâce aux contributeurs, des paquets sont disponibles sur `Yunohost <https://apps.yunohost.org/app/fittrackee>`__ et `NixOS <https://search.nixos.org/packages?query=fittrackee>`__.

source: Main dependencies
fr: Dépendances principales

source: This application is written in Python (API) and Typescript (client):
fr: Cette application est développée en Python (API) et Typescript (client) :

source: `SQLAlchemy <https://www.sqlalchemy.org/>`_ and `geoalchemy2 <https://geoalchemy-2.readthedocs.io>`_ to interact with the database
fr: `SQLAlchemy <https://www.sqlalchemy.org/>`_ et `geoalchemy2 <https://geoalchemy-2.readthedocs.io>`_ pour intéragir avec la base de données

source: `gpxpy <https://github.com/tkrajina/gpxpy>`_ to parse gpx files
fr: `gpxpy <https://github.com/tkrajina/gpxpy>`_ pour analyser les fichiers gpx

source: `fitdecode <https://github.com/polyvertex/fitdecode>`_ to parse fit files
fr: `fitdecode <https://github.com/polyvertex/fitdecode>`_ pour lire les fichiers fit

source: `GeoPandas <https://geopandas.org>`_ to work with geospatial data
fr: `GeoPandas <https://geopandas.org>`_ pour manipuler les données spatiales

source: `Static Map 3 <https://github.com/SamR1/staticmap>`_, a fork of `Static Map <https://github.com/komoot/staticmap>`_ to generate a static map image from file coordinates
fr: `Static Map 3 <https://github.com/SamR1/staticmap>`_, un *fork* de `Static Map <https://github.com/komoot/staticmap>`_ pour générer une image de la trace à partir des données du fichier

source: `Dramatiq <https://dramatiq.io/>`_ and `Flask-Dramatiq <https://flask-dramatiq.readthedocs.io>`_ for task queue
fr: `Dramatiq <https://dramatiq.io/>`_ et `Flask-Dramatiq <https://flask-dramatiq.readthedocs.io>`_ pour la file d'attente des tâches

source: `Authlib <https://docs.authlib.org/en/latest/>`_ for OAuth 2.0 Authorization support
fr: `Authlib <https://docs.authlib.org/en/latest/>`_ pour le support de l'autorisation OAuth 2.0

source: `Flask-Limiter <https://flask-limiter.readthedocs.io/en/stable>`_ for API rate limits
fr: `Flask-Limiter <https://flask-limiter.readthedocs.io/en/stable>`_ pour les limitations d'accès à l'API

source: `gunicorn <https://gunicorn.org/>`_ to serve application
fr: `gunicorn <https://gunicorn.org/>`_ pour servir l'application

source: `Leaflet <https://leafletjs.com/>`__ to display map
fr: `Leaflet <https://leafletjs.com/>`__ pour afficher la carte

source: `Chart.js <https://www.chartjs.org/>`__ to display charts
fr: `Chart.js <https://www.chartjs.org/>`__ pour afficher les graphiques

source: `heatmap.js <https://www.patrick-wied.at/static/heatmapjs/>`__ (`fork <https://github.com/SamR1/heatmap.js>`__) and `leaflet-heatmap <https://github.com/Leaflet/Leaflet.heat>`__ to display heatmap for rackets sports
fr: `heatmap.js <https://www.patrick-wied.at/static/heatmapjs/>`__ (`fork <https://github.com/SamR1/heatmap.js>`__) et `leaflet-heatmap <https://github.com/Leaflet/Leaflet.heat>`__ pour afficher la carte thermique (*heat map*) pour les sports de raquette

source: `zxcvbn-ts <https://zxcvbn-ts.github.io/zxcvbn/>`_ for password strength estimation
fr: `zxcvbn-ts <https://zxcvbn-ts.github.io/zxcvbn/>`_ pour l'estimation de la force du mot de passe

source: Logo, most of sports icons and weather icons are made by `Freepik <https://www.freepik.com/>`__ from `Flaticon <https://www.flaticon.com/>`__.
fr: Le logo, les icônes de certains sports et celles des icônes météo ont été faites par `Freepik <https://www.freepik.com/>`__ sur `Flaticon <https://www.flaticon.com/>`__.

source: FitTrackee also uses icons from `Fork Awesome <https://forkaweso.me>`__.
fr: FitTrackee utilise également les icônes de `Fork Awesome <https://forkaweso.me>`__.

source: Instance types
fr: Type d'instances

source: Single-user instance
fr: Instance mono-utilisateur

source: For a single-user instance, `registration <../features/administration.html#configuration>`__ can be disabled.
fr: Pour une instance mono-utilisateur, l'`inscription <../features/administration.html#configuration>`__ peut être désactivée.

source: So all you need is Python and PostgreSQL/PostGIS database if you want to keep the setup simple. A `CLI <../cli.html#users>`__ is available to manage user account.
fr: Ainsi, seuls Python et PostgreSQL/PostGIS sont nécessaires. Une `interface de ligne de commande <../cli.html#users>`__ est disponible pour gérer le compte utilisateur.

source: Multiple-users instance
fr: Instance multi-utilisateurs

source: Registration can en enabled and maximum number of accounts can be set in the `Administration <../features/administration.html#configuration>`__.
fr: L'inscription peut être activée et le nombre maximum de comptes peut être défini dans l'`Administration <../features/administration.html#configuration>`__.

source: It is recommended to set Redis and a SMTP provider for email sending and tasks processing. Alternatively, a `CLI <../cli.html#users>`__ is available to manage users account.
fr: Il est recommandé de configurer Redis et un fournisseur SMTP pour l'envoi d'e-mails et le traitement des tâches. Il est également possible d'utiliser l'interface en ligne de commande (`CLI <../cli.html#users>`__) pour gérer les comptes utilisateurs.

source: Prerequisites
fr: Prérequis

source: mandatory
fr: obligatoires

source: installation from sources or package:
fr: installation à partir des sources ou du paquet :

source: `GDAL <https://gdal.org/en/stable/>`__ on the server running the application, if different from the server running the database (GDAL is installed with PostGIS)
fr: `GDAL <https://gdal.org/en/stable/>`__ sur le serveur hébergeant l'application, s'il est différent de celui de la base de données (GDAL est installé avec PostGIS)

source: installation with Docker:
fr: installation avec Docker :

source: `Docker <https://docs.docker.com/get-started/>`__ and `Docker Compose <https://docs.docker.com/compose/>`__ v2.30+
fr: `Docker <https://docs.docker.com/get-started/>`__ et `Docker Compose <https://docs.docker.com/compose/>`__ v2.30+

source: optional
fr: optionnels

source: `Redis <https://redis.io/>`__ for `task queue <tasks_processing.html>`__ (for `email <emails.html>`__ sending if enable, for data export requests, and asynchronous archive uploads if enabled) and `API rate limits <api_rate_limits.html>`__ (for installation from sources or package)
fr: `Redis <https://redis.io/>`__ pour la `file d'attente de tâches <tasks_processing.html>`__ (si l'envoi des courriels est activé et pour les demandes d'export de données et le tâches asyncrhones) et les `limitations d'accès à l'API <api_rate_limits.html>`__ (pour l'installation à partir des sources ou du paquet)

source: SMTP provider (if `email <emails.html>`__ sending is enabled)
fr: Fournisseur SMTP (si l'envoi des `courriels <emails.html>`__ est activé)

source: API key from a `weather data provider <weather.html>`__
fr: Clé d'API d'un `fournisseur de données météo <weather.html>`__

source: `elevation data provider <elevation.html>`__
fr: `Fournisseur de données d'altitude <elevation.html>`__

source: `Poetry <https://python-poetry.org>`__ 1.2+ (for installation from sources only)
fr: `Poetry <https://python-poetry.org>`__ 1.2+ (pour l'installation à partir des sources uniquement)

source: `Node <https://nodejs.org>`__ 20+ and `Yarn <https://yarnpkg.com>`__ (for development only)
fr: `Node <https://nodejs.org>`__ 20+ et `Yarn <https://yarnpkg.com>`__ (pour le développement uniquement)

source: If registration is enabled, it is recommended to set Redis and a SMTP provider for email sending and data export requests.
fr: Si l'inscription des utilisateurs est activé, il est recommandé de configurer un fournisseur SMTP pour l'envoi des courriels et les demandes d'export de données.

source: Depending on the operating system and the version of Python installed, additional dependencies may be required, such as **gcc** or **libgdal-dev**.
fr: Selon le système d'exploitation et la version de Python installée, des dépendances supplémentaires peuvent être requises, telles que **gcc** ou **libgdal-dev**.

source: The following steps describe an installation on Linux systems (tested with ArchLinux-based OS and Ubuntu on CI).
fr: Les étapes suivantes décrivent l'installation sur des systèmes Linux (testées sur un système d'exploitation basé sur ArchLinux et sur Ubuntu en intégration continue).

source: On other operating systems, some issues can be encountered and adaptations may be necessary.
fr: Sur d'autres systèmes d'exploitations, des problèmes peuvent être rencontrés et des adaptations nécessaires.

source: Other installation guides are available thanks to contributors:
fr: D'autres guides d'installation sont disponibles grâce aux contributeurs :

source: `Installation on Uberspace Web hosting <https://lab.uberspace.de/guide_fittrackee/>`__ (Fittrackee 0.7.25)
fr: `Installation sur l'hébergement web Uberspace <https://lab.uberspace.de/guide_fittrackee/>`__ (Fittrackee 0.7.25, guide en anglais)

source: `Installation on Debian 12 net install (guide in German) <https://speefak.spdns.de/oss_lifestyle/fittrackee-installation-unter-debian-12/>`__ (Fittrackee 0.7.31)
fr: `Installation sur Debian 12 net install <https://speefak.spdns.de/oss_lifestyle/fittrackee-installation-unter-debian-12/>`__ (Fittrackee 0.7.31, guide en allemand)

source: Note that **FitTrackee** is under heavy development, some features may be unstable.
fr: Remarque : FitTrackee est en cours de développement, certaines fonctionnalités peuvent être instables.

source: From PyPI
fr: A partir de PyPI

source: Create and activate a `virtualenv <https://docs.python.org/3/library/venv.html>`__
fr: Créer et activer l'`environnement virtuel <https://docs.python.org/3/library/venv.html>`__

source: Install **FitTrackee** with pip
fr: Installer **FitTrackee** avec pip

source: Create ``fittrackee`` database
fr: Créer la base de données ``fittrackee``

source: Example:
fr: Exemple :

source: see PostgreSQL `documentation <https://www.postgresql.org/docs/15/ddl-schemas.html>`_ for schema and privileges.
fr: cf. `documentation <https://www.postgresql.org/docs/15/ddl-schemas.html>`_ PostgreSQL pour les schémas et privilèges.

source: Install **PostGIS** extension
fr: Installer l'extension **PostGIS**

source: Example for `fittrackee` database:
fr: Exemple pour la base de données ``fittrackee`` :

source: **PostGIS** must be installed on OS, see `installation documentation <https://postgis.net/documentation/getting_started/#installing-postgis>`_.
fr: **PostGIS** doit être installé sur le système d'exploitation, voir la `documentation d'installation <https://postgis.net/documentation/getting_started/#installing-postgis>`_.

source: Many OS includes pre-built packages for PostGIS, see `wiki <https://trac.osgeo.org/postgis/wiki/UsersWikiPackages>`_.
fr: Plusieurs systèmes d'exploitation proposent des paquets pré-compilés pour **PostGIS**, voir le `wiki <https://trac.osgeo.org/postgis/wiki/UsersWikiPackages>`_.

source: Initialize environment variables, see `Environment variables <environments_variables.html>`__
fr: Initialiser les variables d'environnement, cf. `Variables d'environnement <environments_variables.html>`__

source: For instance, copy and update ``.env`` file from ``.env.example`` and source the file.
fr: Par exemple, copier et coller le fichier ``.env`` à partir de ``.env.example`` et activer le fichier.

source: Initialize database schema
fr: Initialiser le schéma de la base de données

source: Start the application
fr: Démarrer l'application

source: Start task queue workers **if email sending is enabled**, with **Dramatiq** CLI (see `documentation <https://dramatiq.io/guide.html#workers>`__) :
fr: Démarrer les *workers* de la file d'attente des tâches **si l'envoi des courriels est activé**, avec l'interface de ligne de commandes de **Dramatiq** (cf. `documentation <https://dramatiq.io/guide.html#workers>`__):

source: It is also possible to start task queue workers with **Flask-Dramatiq** CLI:
fr: Il est également possible de démarrer les *workers* de la file d'attente des tâches avec l'interface de ligne de commandes de **Flask-dramatiq** :

source: But running **Flask-Dramatiq** CLI on Python 3.13+ raises errors. Emails and user data export are sent, but the `middleware <https://dramatiq.io/reference.html#dramatiq.middleware.TimeLimit>`__ preventing actors from running too long is not active. Please use **Dramatiq** CLI instead for now.
fr: Mais lancer l'interface de ligne de commandes de **Flask-Dramatiq** génère des erreurs sur Python 3.13+. Les emails et les exports de données de l'utilisateur sont bien envoyés, mais le `middleware <https://dramatiq.io/reference.html#dramatiq.middleware.TimeLimit>`__ évitant que les acteurs de fonctionner trop longtemps n'est pas actif. Veuillez utiliser l'interface de ligne de commandes de **Dramatiq** à la place pour le moment.

source: To start application and workers with **systemd** service, see `Deployment <deployment.html>`__.
fr: Pour démarrer l'application et les *workers* avec le service **systemd**, cf. `Déploiement <deployment.html>`__

source: Open http://localhost:5000 and register
fr: Ouvrir l'URL http://localhost:5000 avec un navigateur et s'inscrire

source: To set owner role to the newly created account, use the following command line:
fr: Pour attribuer le rôle de propriétaire au compte nouvellement créé, utiliser la ligne de commande suivante :

source: If the user account is inactive, it activates it.
fr: Si le compte de l'utilisateur est inactif, il sera alors activée.

source: From sources
fr: A partir des sources

source: Since **FitTrackee** 0.2.1, Python packages installation needs Poetry.
fr: Depuis la version 0.2.1 de FitTrackee, l'installation des paquets Python nécessite Poetry.

source: For more information, see `Poetry Documentation <https://python-poetry.org/docs/#installation>`__
fr: Pour plus d'information, voir la `documentation de Poetry <https://python-poetry.org/docs/#installation>`__

source: To keep virtualenv in project directory, update Poetry `configuration <https://python-poetry.org/docs/configuration/#virtualenvsin-project>`__.
fr: Pour conserver l'environnement virtuel dans le répertoire du projet, mettre à jour la `configuration <https://python-poetry.org/docs/configuration/#virtualenvsin-project>`__ de Poetry.

source: Production environment
fr: Environnements de production

source: Note that FitTrackee is under heavy development, some features may be unstable.
fr: Note : FitTrackee est en cours de développement. Certaines fonctionnalités peuvent être instables.

source: Download the last release (for now, it is the release v1.1.0b3):
fr: Télécharger la dernière version (à ce jour, la version v1.1.0b3) :

source: Create **.env** from example and update it (see `Environment variables <environments_variables.html>`__).
fr: Créer le fichier **.env** à partir de l'exemple et le mettre à jour (cf. `Variables d'environnement <environments_variables.html>`__).

source: Install Python virtualenv and all related packages:
fr: Installer l'environnement virtuel Python et tous les paquets nécessaires :
