Repository: SamR1/FitTrackee
Catalog: docsrc/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: In this release 2 issues were closed.
fr: Dans cette version 2 tickets ont été fermés.

source: Version 0.6.1 (2022/03/27)
fr: Version 0.6.1 (27/03/2022)

source: Version 0.6.0 (2022/03/27)
fr: Version 0.6.0 (27/03/2022)

source: This version introduces some changes on user registration.<br />From now on, a user needs to confirm his account after registration (an email with confirmation instructions is sent after registration).
fr: Cette version apporte quelques changements au niveau de l’inscription des utilisateurs.<br />A partir de maintenant, un utilisateur doit confirmer son compte après inscription (un courriel avec les instructions de confirmation est envoyé avec inscription).

source: In this release 3 issues were closed.<br />Note: This release contains database migration (see upgrade instructions in documentation)
fr: Dans cette version 3 tickets ont été fermés.<br />Note : Cette version contient des migrations de base de données (voir les instructions de mise à jour dans la documentation)

source: Version 0.5.7 (2022/02/13)
fr: Version 0.5.7 (13/02/2022)

source: This release contains several fixes including security fixes.<br />Thanks to @DanielSiersleben for the report.
fr: Cette version contient plusieurs corrections de sécurité.<br /> Merci @DanielSiersleben pour le rapport.

source: And from now on, admin account is not created on application initialization.<br />A new command is added to set administration rights on the account created after registration (see documentation)
fr: Et à partir de cette version, le compte de l’administrateur ne sera plus créé à l’initialisation.<br />Une nouvelle commande a été ajoutée pour donner les droits d’administration au compte créé après inscription (voir la documentation)

source: Security
fr: Sécurité

source: set autoescape on jinja templates
fr: configure l’échappement (_autoespcape_) dans les modèles jinja

source: sanitize input when serving images
fr: nettoie les entrées lorsque les images sont servies

source: sanitize inputs when serving map tiles
fr: nettoie les entrées lorsque les tuiles sont servies

source: allow only alphanumeric characters and '_' in username
fr: permet seulement les caractères alphanumériques et les '_' dans le nom de l’utilisateurs

source: fix dramatiq warning when launching workers w/ script entrypoint
fr: corrige les alertes de dramatiq quand les *workers* sont lancés à partir du point d’entrée du script.

source: check app config before dropping database, to avoid deleting data on production
fr: vérifie la configuration de l’application avant de supprimer la base de données afin d’éviter de supprimer des données en production

source: remove dotenv warning
fr: supprime l’alerte dotenv

source: Version 0.5.6 (2022/02/05)
fr: Version 0.5.6 (05/02/2022)

source: Version 0.5.5 (2022/01/19)
fr: Version 0.5.5 (19/01/2022)

source: New Features
fr: Nouvelles fonctionnalités

source: Version 0.5.4 (2022/01/01)
fr: Version 0.5.4 (01/01/2022)

source: Version 0.5.3 (2022/01/01)
fr: Version 0.5.3 (01/01/2022)

source: Version 0.5.2 (2021/12/19)
fr: Version 0.5.2 (19/12/2021)

source: In this release 2 issues were closed.<br />Note: This release contains database migration.
fr: Dans cette version 2 tickets ont été fermés<br />Note : cette version contains des migrations de base de données.

source: Version 0.5.1 (2021/11/30)
fr: Version 0.5.1 (30/11/2021)

source: Version 0.5.0 (2021/11/14)
fr: Version 0.5.0 (14/11/2021)

source: In this release 6 issues were closed.<br />Note: This release contains database migrations.
fr: Dans cette version 6 tickets ont été fermés<br />Note : cette version contient des migrations de base de données.

source: Version 0.4.9 (2021/07/16)
fr: Version 0.4.9 (16/07/2021)

source: Version 0.4.8 (2021/07/03)
fr: Version 0.4.8 (03/07/2021)

source: Version 0.4.7 (2021/04/07)
fr: Version 0.4.7 (07/04/2021)

source: Update Python and Javascript dependencies<br />IMPORTANT: Due to SQLAlchemy update (1.4+), engine URLs starting with postgres:// are no longer supported. Please update DATABASE_URL with postgresql://.
fr: Mise à jour des dépendances Python et Javascript<br />IMPORTANT: Du fait de la mise à jour de SQLAlchemy (1.4+), les URLs commençant par postgres:// ne sont plus prise en charge. Merci de mettre à jour la variable DATABASE_URL avec postgresql://.

source: Version 0.4.6 (2021/02/21)
fr: Version 0.4.6 (21/02/2021)

source: Version 0.4.5 (2021/02/17)
fr: Version 0.4.5 (17/02/2021)

source: Version 0.4.4 (2021/01/31)
fr: Version 0.4.4 (31/01/2021)

source: Refactoring before introducing new features.
fr: Refactorisation avant l’ajout de nouvelles fonctionnalités.

source: Add docker files for evaluation purposes.
fr: Ajout de fichiers Docker à des fins d’évaluation.

source: Version 0.4.3 (2021/01/10)
fr: Version 0.4.3 (10/01/2021)

source: Version 0.4.2 (2021/01/03)
fr: Version 0.4.2 (03/01/2021)

source: No new features in this release, only some refactorings before introducing new features.
fr: Pas de nouvelles fonctionnalités dans cette version, seulement de la refactorisation avant l’ajout de nouvelles fonctionnalités.

source: Version 0.4.1 (2020/12/31)
fr: Version 0.4.1 (31/12/2020)

source: Version 0.4.0 - FitTrackee on PyPI (2020/09/19)
fr: Version 0.4.0 - FitTrackee sur PyPI (19/09/2020)

source: This version introduces some major changes:
fr: Cette version introduit des changement majeurs :

source: Installation becomes more easy. FitTrackee can be now be installed from PyPi.<br />⚠️ Warning: please read installation documentation, some environment variables and files have been renamed.
fr: L’installation est facilitée. FitTrackee peut dorénavant être installé à partir de PyPI.<br />⚠️ Attention : merci de lire la documentation d’installation, certaines variables d’environnement et certains fichiers ont été renommés.

source: It's now possible to change the tile provider for maps. The default tile server is now OpenStreetMap's standard tile layer (replacing ThunderForest Outdoors), see Map tile server in documentation.
fr: Il est maintenant possible de changer le fournisseur de tuiles pour les cartes. Le serveur de tuiles par défaut est maintenant celui d’OpenStreetMap (remplaçant ThunderForest Outdoors), voir les Serveurs de tuiles dans la documentation.

source: Version 0.3.0 - Administration (2020/07/15)
fr: Version 0.3.0 - Administration (15/07/2020)

source: FitTrackee administration is now available (see documentation)<br />⚠️ Warning: some application parameters move from environment variables to database (see installation).
fr: L’administration de FitTrackee est maintenant disponible (voir la documentation)<br />⚠️ Attention : certains paramètres de l’application ont été déplacés des variables d’environnement vers la base de données (voir l’installation dans la documentation).

source: in order to send emails, Redis is now a mandatory dependency
fr: afin d’envoyer des courriels, Redis est maintenant une dépendance obligatoire

source: Version 0.2.5 - Fix and improvements (2020/01/31)
fr: Version 0.2.5 - Corrections et améliorations (31/01/2020)

source: This version contains minor fix and improvements on client side:
fr: Cette version contient des corrections mineures et des améliorations coé client :

source: Version 0.2.4 - Minor fix (2020/01/30)
fr: Version 0.2.4 - Corrections mineures (30/01/2020)

source: Version 0.2.3 - FitTrackee available in French (2019/12/29)
fr: Version 0.2.3 - FitTrackee disponible en Français (29/12/2019)

source: Version 0.2.2 - Statistics fix (2019/09/23)
fr: Version 0.2.2 - Corrections des statistiques (23/09/2019)

source: Version 0.2.1 - Fix and improvements (2019/09/01)
fr: Version 0.2.1 - Correction et améliorations (01/09/2019)

source: Poetry replaces pipenv for Python packages management
fr: Poetry remplace pipenv pour la gestion des paquets Python

source: In this release 8 issues were closed.
fr: Dans cette version 8 tickets ont été fermés.

source: Version 0.2.0 - Statistics (2019/07/07)
fr: Version 0.2.0 - Statistiques (07/07/2019)

source: Update dependencies
fr: Mise à jour des dépendances

source: Version 0.1.1 - Fix and improvements (2019/02/07)
fr: Version 0.1.1 - Corrections et améliorations (07/02/2019)

source: In this release 7 issues were closed.
fr: Dans cette version 7 tickets ont été fermés.

source: Version 0.1.0 - First release 🎉 (2018-07-04)
fr: Version 0.1.0 - Première version 🎉 (04/07/2018)

source: Features:
fr: Fonctionnalités :

source: Account creation (only standard user, not admin)
fr: Création de compte (utilisateur standard, non administrateur)

source: 6 sports supported:
fr: 6 sports pris en charge :

source: Cycling (Sport)
fr: Vélo (Sport)

source: Cycling (Transport)
fr: Vélo (Transport)

source: Hiking
fr: Randonnée

source: Mountain Biking
fr: VTT

source: Running
fr: Course à pied

source: Walking
fr: Marche

source: Activity creation by uploading a gpx file. An activity can even be created without gpx (the user must enter date, time, duration and distance)
fr: Création d’activité par ajout de fichier gpx. Une activité peut également être créée sans fichier gpx (l’utilisateur doit enter la date, l’heure, la durée et la distance)

source: Activity edition and deletion
fr: Modification et suppression d’activité

source: An activity can be displayed with map (if with gpx), weather (if the DarkSky API key is provided) and charts (speed and elevation)
fr: Une activité peut être affichée avec une carte (si une fichier gpx existe), la météo (si une clé d’API DarkSky a été configurée) et des graphiques (vitesse et altitude)

source: A user can add a note
fr: Un utilisateur peut ajouter une note

source: Month calendar with activities
fr: Calendrier mensuel avec les activités

source: Current month statistics
fr: Statistiques du mois en cours

source: Records by sports:
fr: Records par sports :

source: average speed
fr: vitesse moyenne

source: farthest distance
fr: distance la plus grande

source: longest duration
fr: durée la plus longue

source: maximum speed
fr: vitesse maximale

source: Activities list and search
fr: Liste des activités et recherche

source: only activity owner can see his activity
fr: seul le propriétaire d’une activité peut la voir

source: no administration for now
fr: pas d’administration pour le moment

source: ➡️ more informations: see documentation and current issues
fr: ➡️ plus d’informations : voir la documentation et les tickets en cours

source: In this release 6 issues were closed.
fr: Dans cette version 6 tickets ont été fermés.

source: Command line interface
fr: Interface de ligne de commande

source: A command line interface (CLI) is available to manage database, OAuth2 tokens, users and workouts archive uploads.
fr: Une interface de ligne de commande (CLI) est disponible pour gérer la base de données, les jetons OAuth2, les utilisateurs et le chargement des archives de séances.

source: Database
fr: Base de données

source: Empty database and delete uploaded files, only on development environments.
fr: Vider la base de données et supprimer les fichiers téléchargés, uniquement pour les environnements de développement.

source: Apply migrations.
fr: Appliquer les migrations.

source: Remove tokens expired for more than provided number of days
fr: Supprimer les jetons expirés depuis plus d'un certain nombre de jours

source: Number of days.
fr: Nombre de jours.

source: Delete export requests and related archives created more than provided number of days.
fr: Supprimer les demandes d'export et les archives associées créées depuis plus d'un certain nombre de jours.

source: Remove blacklisted tokens expired for more than provided number of days.
fr: Supprimer les jetons de la liste noire expirés depuis plus d'un certain nombre de jours.

source: User preference for interface language is added.
fr: La préférence de l'utilisateur pour la langue de l'interface est ajoutée.

source: Add option for user role.
fr: Ajout d'une option pour le rôle de l'utilisateur.

source: User preference for timezone is added.
fr: La préférence pour le fuseau horaire est ajoutée.

source: Create a user account.
fr: Créer un compte utilisateur.

source: the newly created account is already active.
fr: le compte nouvellement créé est déjà actif.

source: the CLI allows to create users when registration is disabled.
fr: la CLI permet de créer des utilisateurs lorsque l'enregistrement est désactivé.

source: Username.
fr: Nom de l'utilisateur.

source: User email (mandatory).
fr: Adresse électronique de l'utilisateur (obligatoire).

source: User password (if not provided, a random password is generated).
fr: Mot de passe de l'utilisateur (s'il n'est pas fourni, un mot de passe aléatoire est généré).

source: User preference for interface language (two-letter code, ISO 639-1). If not provided or not supported, it falls back to English ('en').
fr: Préférence de l'utilisateur pour la langue de l'interface (code à deux lettres, ISO 639-1). Si elle n'est pas fournie ou prise en charge, la valeur par défaut est l'anglais ("en").

source: User preference for timezone. If not provided or not supported, it falls back to 'Europe/Paris'.
fr: Préférence pour le fuseau horaire. Si non fournie ou non prise en charge, la valeur par défaut est 'Europe/Paris'.

source: User role (default: 'user').
fr: Rôle de l'utilisateur (valeur par défaut: 'user')

source: Process a given queued user data export.
fr: Traiter un export de données utilisateur en attente

source: Can be used if redis is not set (no dramatiq workers running).
fr: Peut être utilisé si redis n'est pas activé (pas de *workers* dramatiq en cours d'exécution).

source: Id of task to process.
fr: Identifiant de la tâche à traiter

source: Process incomplete user export requests.
fr: Traiter les requêtes d'export des données utilisateurs en attente.

source: Maximum number of export requests to process.
fr: Nombre maximal de demandes d'export à traiter.

source: Modify a user account (role, active status, email and password).
fr: Modifier le compte d'un utilisateur (rôle, statut actif, email et mot de passe).

source: Set user role (when setting 'moderator', 'admin' and 'owner' role, it also activates user account if not active).
fr: Configurer le rôle (lors de la configuration des rôles 'moderator', 'admin' et 'owner', le compte de l'utilisateur est également activé s'il ne l'est pas.

source: Activate user account.
fr: Activer le compte d'un utilisateur.

source: Reset user password (a new password will be displayed).
fr: Réinitialiser le mot de passe de l'utilisateur (un nouveau mot de passe sera affiché).

source: New user email.
fr: Nouvelle adresse électronique de l'utilisateur

source: Process a given queued workouts archive upload.
fr: Traiter un chargement d'archive de séances en attente donné

source: Process workouts archive uploads if queued tasks exist (progress = 0 and not aborted/errored).
fr: Traite les tâches de chargement des archives de séances si des tâches en attente existent (progression = 0 et tâches non interrompues on en erreur).

source: Maximum number of workouts archive to process.
fr: Nombre maximal de chargement d'archives de séances à traiter.

source: Add ``--add-missing-geometry`` option.
fr: Ajout de l'option ``--add-missing-geometry``

source: Remove ``--add-missing-geometry`` option and add ``--with-elevation`` and ``--new-sport-id`` options.
fr: Suppression de l'option ``--add-missing-geometry`` et ajout des options ``--with-elevation`` et ``--new-sport-id``.

source: Refresh workouts by recalculating data and fetching weather data if provider is set and workout does not have weather data.
fr: Actualiser les séances en recalculant les données de la séance et en récupérant les données météo si un fournisseur est configuré et que la séance n'a pas de données météo

source: Before executing the command, it is recommended to back up of all data (database and upload directory) in case a large number of workouts are refreshed.
fr: Avant d'exécuter la commande, il est recommandé de sauvegarder toutes les données (base de données et répertoire des fichiers téléversé) dans le cas où un grand nombre de séances serait mis à jour.

source: If a weather data provider is defined and the ``--with-weather`` option is provided and/or an Elevation API URL is set and ``--with-elevation`` option is provided, the rate limit may be reached, resulting in API rate limit errors when a large number of workouts is refreshed.
fr: Si un fournisseur de données météo est défini et que l'option ``--with-weather`` est fournie et/ou une URL d'API de données d'altitude et que l'option ``--with-elevation`` ets fournie, la limite d'accès peut être atteinte, résultant en des erreurs de limite dépassée quand un nombre important de séances est actualisé.

source: number of workouts per page (default: 10)
fr: nombre de séances par page (par défaut : 10)

source: page number (default: 1)
fr: page pour la pagination (par défaut : 1)

source: workout date order: 'asc' or 'desc' (default: 'asc')
fr: ordre de tri des séances : 'asc' ou 'desc' (par défaut : 'asc')

source: username of workouts owner
fr: nom de l'utilisateur des séances à mettre à jour

source: workout file extension (valid values are: tcx, kmz, gpx, kml, fit)
fr: extension du fichier de la séance (valeurs possibles: tcx, kmz, gpx, kml, fit)

source: enable weather data collection if weather provider is set and workout has no weather data. WARNING: depending on subscription, the rate limit can be reached, leading to errors and preventing weather data being collected during next uploads until the limit is reset (default: disabled)
fr: active la récupération des données météo si un fournisseur de données est configuré et que la séance n'a pas données météo. ATTENTION: selon la souscription, la limite d'accès peut être atteinte, résultant en des erreurs et empêchant les données météo d'être récupérées pour les prochains chargements de fichiers, le temps que la limite soit réinitialisée (défaut: désactivé)

source: enable elevation update when elevation provider is set and some elevation data are missing. If disabled, existing elevation are not removed when elevation data are missing in the original file. WARNING: depending on subscription, the rate limit can be reached, leading to errors and preventing elevation data being collected during next uploads until the limit is reset (default: disabled)
fr: active la mise à jour des données d'altitude si un fournisseur de données est configuré et que des données sont manquantes. ATTENTION: selon la souscription, la limite d'accès peut être atteinte, résultant en des erreurs et empêchant les données d'altitude d'être récupérées pour les prochains chargements de fichiers, le temps que la limite soit réinitialisée (défaut: désactivé)

source: Enable verbose output log (default: disabled)
fr: Active les logs verbeux (défaut: désactivé)

source: Contribute
fr: Contribuer

source: First off, thank you for your interest in contributing!
fr: Tout d'abord, merci de votre intérêt pour contribuer !

source: Philosophy
fr: Philosophie

source: FitTrackee was created specifically to completely avoid proprietary web platforms for tracking sports activities.<br />Workout files contain sensitive data relating to location and health.
fr: FitTrackee a été créé initialement pour éviter complètement les plateformes web propriétaires pour le suivi des activités sportives. <br />Les fichiers des séances contiennent des données sensibles relatives à la localisation et à la santé.

source: This is one of the reasons why, for example, automatic synchronization of an account hosted on proprietary web platform is not integrated into FitTrackee.<br />For the time being, files must therefore be added manually or third-party tools must be used (or developed) for this type of synchronization.
fr: C'est l'une des raisons pour lesquelles, par exemple, la synchronisation automatique d'un compte hébergé sur une plateforme web propriétaire n'est pas intégrée à FitTrackee.<br />Pour l'instant, les fichiers doivent donc être ajoutés manuellement ou des [outils tiers](https://next.docs.fittrackee.org/fr/third_party_tools.html) doivent être utilisés (ou développés) pour ce type de synchronisation.

source: The other important point is that FitTrackee must be easy to install, particularly for use by a single user and without interaction, for which Python and a PostgreSQL/PostGIS database are sufficient.<br />Ideally, it should be possible to install it on low-resource servers such as the Raspberry Pi 4.
fr: L'autre point important est que FitTrackee doit être facile à installer, en particulier pour une utilisation par un seul utilisateur et sans interaction, pour laquelle Python et une base de données PostgreSQL/PostGIS suffisent.<br />Idéalement, il doit rester possible de l'installer sur des serveurs à faibles ressources tels que Raspberry Pi 4.

source: Pull requests or feature requests must therefore take these points into account.
fr: Les *pull requests* ou demandes de fonctionnalités doivent donc prendre en compte à ces points.

source: Report issues, ask for features
fr: Signaler des problèmes, demander des fonctionnalités

source: If a bug is a security vulnerability, please refer to security policy.
fr: Si le bug concerne une **faille de sécurité**, veuillez vous référer à la [politique de sécurité](https://github.com/SamR1/FitTrackee/blob/master/SECURITY.md).

source: Ensure an issue was not already opened by searching on GitHub under Issues.
fr: Assurez-vous qu'un ticket n'a pas **déjà été ouvert** en effectuant une recherche dans le [tickets](https://github.com/SamR1/FitTrackee/issues) dans **GitHub**.

source: If not, open a new one with a descriptive title and provide a description.
fr: Si ce n'est pas le cas, ouvrez un [nouveau ticket](https://github.com/SamR1/FitTrackee/issues/new) avec un titre descriptif et une description.

source: Contributing Code
fr: Contribuer au code

source: Project repository
fr: Dépôt du projet

source: The GitHub repository contains:
fr: Le dépôt **GitHub** contient :

source: source code (note that the repository also includes client build),
fr: le code source (à noter que le dépôt contient également les fichiers compilés client),

source: translations,
fr: traductions,

source: documentation (source, translations and build).
fr: documentation (source, traductions et fichiers compilés).

source: Continuous integration workflows run on Github Actions platform (on push and pull requests).
fr: Les workflows d'intégration continue s'exécutent sur la plateforme **Github Actions** (lors de **push** et **pull requests**).

source: Application translations files are located:
fr: Les fichiers de traduction de l'application se trouvent :

source: on API side (emails and RSS Feeds): fittrackee/translations/ (implemented with Babel)
fr: côté API (pour les courriels et les flux RSS) : `fittrackee/translations/` (implémenté avec [Babel](https://babel.pocoo.org/en/latest/))

source: on client side: fittrackee_client/src/locales (implemented with Vue I18n)
fr: côté client : `fittrackee/emails/translations/` (implémenté via [Vue I18n](https://vue-i18n.intlify.dev/))

source: Translations can be updated through Weblate.<br />For new language requests, please open an issue in order to initialize the translation files and make the language available on Weblate.
fr: Les traductions peuvent être mises à jour via [Weblate](https://hosted.weblate.org/engage/fittrackee/).<br />Pour toute demande de nouvelle langue, veuillez ouvrir un ticket afin d'initialiser les fichiers de traduction et de rendre la langue disponible sur Weblate.
