Repository: SamR1/FitTrackee
Catalog: docsrc/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: This version provides workout data refresh, original file download and a RSS feed for users public workouts.
fr: Cette version apporte l'actualisation des données de la séances, le téléchargement du fichier original et un flux RSS pour les séances publiques de l'utilisateur.

source: Polish: 89%
fr: Polonais : 89%

source: Version 0.11.2 (2025/08/13)
fr: Version 0.11.2 (13/08/2025)

source: Note (for docker-compose.yml only):
fr: **Note (uniquement pour l'utilisation de docker-compose.yml) :**

source: A new environment variable has been added: HOST_STATICMAP_CACHE_DIR.<br />The other variables have been prefixed to avoid confusion.<br />There is no impact if the default values are used (no overriding by environment variables).
fr: Une nouvelle variable d'environnement a été ajoutée : `HOST_STATICMAP_CACHE_DIR`.<br />Les autres variables ont été préfixées pour éviter toute confusion.<br />Il n'y a pas d'impact si les valeurs par défaut sont utilisées (pas de surcharge par les variables d'environnement).

source: More information in the documentation.
fr: Plus d’informations dans la [documentation](https://next.docs.fittrackee.org/fr/installation/installation.html#docker).

source: Czech: 44%
fr: Tchèque : 44%

source: Polish: 90%
fr: Polonais : 90%

source: Russian: 99%
fr: Russe : 99%

source: Version 0.11.1 (2025/07/30)
fr: Version 0.11.1 (30/07/2025)

source: Note: The fix only applies to next .fit file uploads
fr: **Note**: La correction ne s'applique qu'aux nouveaux fichiers .fit ajoutés.

source: Version 0.11.0 (2025/07/23)
fr: Version 0.11.0 (23/07/2025)

source: This release brings a new sport (Outdoor Tennis), power support for bike-related workouts, new display for workout chart, Garmin device mapping update and several fixes and translation updates.
fr: Cette version apporte un nouveau sport (tennis en extérieur), une prise en charge de la puissance pour les séances liées au vélo, un nouvel affichage du graphique dans le détail de la séance, la mise à jour des correspondances pour les appareils Garmin et plusieurs correctifs et mises à jour de traduction.

source: The minimum Node version (for development) is now Node 20.
fr: La version minimale de Node (pour le développement) est maintenant la version 20.

source: Chinese (Simplified): 97%
fr: Chinois (Simplifié) : 97%

source: Croatian: 98%
fr: Croate : 98%

source: Dutch: 98%
fr: Néerlandais : 98%

source: Version 0.10.3 (2025/06/18)
fr: Version 0.10.3 (18/06/2025)

source: Bulgarian: 57%
fr: Bulgare : 57%

source: German: 90%
fr: Allemand : 90%

source: Italian: 47%
fr: Italien : 47%

source: Polish: 91%
fr: Polonais : 91%

source: Portuguese: 56%
fr: Portugais : 56%

source: Russian: 93%
fr: Russe : 93%

source: Spanish: 59%
fr: Espagnol : 59%

source: Note: This release contains database migration (see upgrade instructions in documentation)
fr: Note : Cette version contient des migrations de base de données (voir les instructions dans la [documentation](https://next.docs.fittrackee.org/fr/installation/upgrade.html))

source: Version 0.10.2 (2025/05/31)
fr: Version 0.10.2 (31/05/2025)

source: German: 91%
fr: Allemand : 91%

source: Polish: 92%
fr: Polonais : 92%

source: Russian: 91%
fr: Russe : 91%

source: Version 0.10.1 (2025/05/30)
fr: Version 0.10.1 (30/05/2025)

source: Chinese (Simplified): 92%
fr: Chinois (Simplifié) : 92%

source: Croatian: 91%
fr: Croate : 91%

source: Czech: 42%
fr: Tchèque : 42%

source: Galician: 92%
fr: Galicien : 92%

source: Version 0.10.0 (2025/05/29)
fr: Version 0.10.0 (29/05/2025)

source: In addition to a new language and translation updates, this version brings asynchronous archives upload, support for several file formats and heart rate and cadence display.
fr: En plus d'une nouvelle langue et des mises à jour de traduction, cette version apporte le chargement asynchrone d'archives, la prise en charge de plusieurs formats de fichiers et l'affichage de la fréquence cardiaque et de la cadence.

source: 2 environment variables are also added: TASKS_TIME_LIMIT and STATICMAP_CACHE_DIR (see documentation).
fr: 2 variables d'environnement ont été également ajoutées : `TASKS_TIME_LIMIT` et `STATICMAP_CACHE_DIR` (see [documentation](https://next.docs.fittrackee.org/fr/installation/environments_variables.html)).

source: Note: This version also includes the changes from the beta versions.
fr: Note: Cette version comprend également les changements des versions bêta.

source: Fix on v0.10.0beta2:
fr: Correction par rapport à la version v0.10.0beta2

source: Dutch: 92%
fr: Néerlandais : 92%

source: Note: If you upgrade from the v0.9.x, there are migrations to apply (see upgrade instructions in documentation)
fr: Note : Si vous effectuez une mise à jour à partir de la version 0.9.x, il y a des migrations à appliquer (voir les instructions dans la [documentation](https://next.docs.fittrackee.org/fr/installation/upgrade.html))

source: Version 0.10.0b2 (2025/05/24)
fr: Version 0.10.0b2 (24/05/2025)

source: Version 0.10.0b1 (2025/05/24)
fr: Version 0.10.0b1 (24/05/2025)

source: Note: This version is not available on PyPI, due to an error when uploading the package.
fr: Note : Cette version n'est pas disponible sur PyPI, suite à une erreur lors du chargement du paquet.

source: Version 0.9.11 (2025/05/18)
fr: Version 0.9.11 (18/05/2025)

source: Bulgarian: 62%
fr: Bulgare : 62%

source: Czech: 46%
fr: Tchèque : 46%

source: German: 98%
fr: Allemand : 98%

source: Italian: 51%
fr: Italien : 51%

source: Norwegian Bokmål: 33%
fr: Norvégien Bokmål : 33%

source: Polish: 99%
fr: Polonais : 99%

source: Portuguese: 61%
fr: Portugais : 61%

source: Russian: 69%
fr: Russe : 69%

source: Spanish: 64%
fr: Espagnol : 64%

source: Version 0.9.10 (2025/05/11)
fr: Version 0.9.10 (11/05/2025)

source: Russian: 38%
fr: Russe : 38%

source: Version 0.9.9 (2025/05/03)
fr: Version 0.9.9 (03/05/2025)

source: Polish: 97%
fr: Polonais : 97%

source: Russian: 39%
fr: Russe : 39%

source: Spanish: 63%
fr: Espagnol : 63%

source: Version 0.9.8 (2025/04/27)
fr: Version 0.9.8 (27/04/2025)

source: Version 0.9.7 (2025/04/20)
fr: Version 0.9.7 (20/04/2025)

source: Galician: 98%
fr: Galicien : 98%

source: Version 0.9.6 (2025/04/16)
fr: Version 0.9.5 (16/04/2025)

source: Bulgarian: 63%
fr: Bulgare : 63%

source: Chinese (Simplified): 100%
fr: Chinois (Simplifié) : 100%

source: Dutch: 63%
fr: Néerlandais : 63%

source: German: 100%
fr: Allemand : 100%

source: Italian: 52%
fr: Italien : 52%

source: Portuguese: 62%
fr: Portugais : 62%

source: Version 0.9.5 (2025/04/06)
fr: Version 0.9.5 (06/04/2025)

source: PR#757 - Fix tasks queue running on Python 3.13<br />Note: It is now possible to use Dramatiq CLI directly to run task queue workers, see documentation. A new environment (DRAMATIQ_LOG) variable has also been added.
fr: [PR#757](https://github.com/SamR1/FitTrackee/pull/757) - Fix tasks queue running on Python 3.13<br />**Note**: Il est maintenant possible d'utiliser l'interface de ligne de commandes de Dramatiq directement pour lancer les *workers* de la file d'attente des tâches (cf. [documentation](https://next.docs.fittrackee.org/fr/installation/installation.html)).<br />Une nouvelle variable d'environnement (`DRAMATIQ_LOG`) a également été ajoutée.

source: German: 86%
fr: Allemand : 86%

source: Version 0.9.4 (2025/03/26)
fr: Version 0.9.4 (26/03/2025)

source: German: 85%
fr: Allemand : 85%

source: Version 0.9.3 (2025/03/15)
fr: Version 0.9.3 (15/03/2025)

source: Dutch: 64%
fr: Néerlandais : 64%

source: Norwegian Bokmål: 34%
fr: Norvégien Bokmål : 34%

source: Version 0.9.2 (2025/02/12)
fr: Version 0.9.2 (12/02/2025)

source: Bulgarian: 64%
fr: Bulgare : 64%

source: Czech: 47%
fr: Tchèque : 47%

source: German: 76%
fr: Allemand : 76%

source: Italian: 53%
fr: Italien : 53%

source: Portuguese: 63%
fr: Portugais : 63%

source: Russian: 40%
fr: Russe : 40%

source: Version 0.9.1 (2025/02/02)
fr: Version 0.9.1 (02/02/2025)

source: Note: The minimum version for Python is now 3.9.2.
fr: Note : La version minimale pour Python est maintenant la version 3.9.2.

source: Polish: 88%
fr: Polonais : 88%

source: Version 0.9.0 (2025/01/18)
fr: Version 0.9.0 (18/01/2025)

source: FitTrackee now allows you to follow other users, view their workouts according to the level of visibility and interact with them.
fr: FitTrackee vous permet maintenant de suivre d'autres utilisateurs, de visualiser leur séances selon le niveau de visibilité et d'interagir avec eux.

source: The default privacy policy has been updated, as well as the link to the documentation.
fr: La politique de confidentialité par défaut a été mis à jour, ainsi que le lien vers la documentation.

source: Chinese (Simplified): 48%
fr: Chinois (Simplifié) : 48%

source: German: 64%
fr: Allemand : 64%

source: Polish: 64%
fr: Polonais : 64%

source: Russian: 64%
fr: Russe : 64%

source: Note: If you upgrade from the v0.8.x, there are migrations to apply (see upgrade instructions in documentation)
fr: Note : Si vous effectuez une mise à jour à partir de la version 0.8.x, il y a des migrations à appliquer. (voir les instructions dans la [documentation](https://next.docs.fittrackee.org/fr/installation/upgrade.html))

source: Version 0.9.0b6 (2025/01/05)
fr: Version 0.9.0b6 (05/01/2025)

source: Version 0.9.0b5 (2024/12/30)
fr: Version 0.9.0b5 (30/12/2024)

source: Version 0.8.13 (2024/12/29)
fr: Version 0.8.13 (29/12/2024)

source: Bulgarian: 98%
fr: Bulgare : 98%

source: Czech: 72%
fr: Tchèque : 72%

source: Italian: 81%
fr: Italien : 81%

source: Norwegian Bokmål: 52%
fr: Norvégien Bokmål : 52%

source: Portuguese: 97%
fr: Portugais : 97%

source: Russian: 62%
fr: Russe : 62%

source: Spanish: 100%
fr: Espagnol : 100%

source: Version 0.9.0b4 (2024/12/23)
fr: Version 0.9.0b4 (23/12/2024)

source: Version 0.9.0b3 (2024/12/18)
fr: Version 0.9.0b3 (18/12/2024)

source: Version 0.9.0b2 (2024/12/14)
fr: Version 0.9.0b2 (14/12/2024)

source: Version 0.9.0b1 (2024/12/14)
fr: Version 0.9.0b1 (14/12/2024)

source: Version 0.8.12 (2024/11/17)
fr: Version 0.8.12 (17/11/2024)

source: Version 0.8.11 (2024/10/30)
fr: Version 0.8.11 (30/10/2024)

source: FitTrackee is now available for Python 3.13. Python 3.8 is no longer supported, the minimum version is now Python 3.9.
fr: **FitTrackee** est maintenant disponible pour Python 3.13. La version 3.8 de Python n’est plus prise en charge, la version minimale est maintenant la version 3.9.

source: Version 0.8.10 (2024/10/09)
fr: Version 0.8.10 (09/10/2024)

source: Russian: 61%
fr: Russe : 61%

source: Version 0.8.9 (2024/09/21)
fr: Version 0.8.9 (21/09/2024)

source: This release introduces a new field: the workout description.<br />This field is longer than the "Notes" field and will have the same visibility as the workout in a next version (see #125). The "Notes" field will remain private.
fr: Cette version apporte un nouveau champ : la description de la séance.<br />Ce champ est plus long que le champs "Notes" et aura la même visibilité que la séance dans une prochaine version (see [#125](https://github.com/SamR1/FitTrackee/issues/125)). Le champ "Notes" restera privé.

source: Bulgarian: 99%
fr: Bulgare : 99%

source: Italian: 82%
fr: Italien : 82%

source: Version 0.8.8 (2024/09/01)
fr: Version 0.8.8 (01/09/2024)

source: FitTrackee is now available in Bulgarian.
fr: **FitTrackee** est maintenant disponible en Bulgare.

source: Bulgarian: 100%
fr: Bulgare : 100%

source: Czech: 73%
fr: Tchèque : 73%

source: Portuguese: 98%
fr: Portugais : 98%

source: Version 0.8.7 (2024/08/25)
fr: Version 0.8.7 (25/08/2024)

source: Spanish: 99%
fr: Espagnol : 99%

source: Version 0.8.6 (2024/08/03)
fr: Version 0.8.6 (03/08/2024)

source: German: 99%
fr: Allemand : 99%

source: Version 0.8.5 (2024/06/29)
fr: Version 0.8.5 (29/06/2024)

source: Version 0.8.4 (2024/05/22)
fr: Version 0.8.4 (22/05/2024)

source: FitTrackee is now available in Portuguese.
fr: **FitTrackee** est maintenant disponible en Portugais.

source: Czech: 74%
fr: Tchèque : 74%

source: Italian: 74%
fr: Italien : 74%

source: Norwegian Bokmål: 53%
fr: Norvégien Bokmål : 53%

source: Portuguese: 100%
fr: Portugais : 100%

source: Version 0.8.3 (2024/05/09)
fr: Version 0.8.3 (09/05/2024)

source: Czech: 25%
fr: Tchèque : 25%

source: Version 0.8.2 (2024/05/08)
fr: Version 0.8.2 (08/05/2024)

source: Version 0.8.1 (2024/05/01)
fr: Version 0.8.1 (01/05/2024)

source: Czech: 15%
fr: Tchèque : 15%

source: Version 0.8.0 (2024/04/21)
fr: Version 0.8.0 (21/04/2024)

source: FitTrackee now lets you associate equipment with workouts and filter workouts on notes.
fr: **Fittrackee** vous permet désormais d'associer un [équipement](https://next.docs.fittrackee.org/fr/features/equipment.html) à une séance et des filtrer les séances sur les notes.

source: Dutch: 89%
fr: Néerlandais : 89%

source: German: 89%
fr: Allemand : 89%

source: Italian: 75%
fr: Italien : 75%

source: Version 0.7.32 (2024/03/10)
fr: Version 0.7.32 (10/03/2024)

source: Italian: 84%
fr: Italien : 84%

source: Norwegian Bokmål: 60%
fr: Norvégien (Bokmål) : 60%

source: Version 0.7.31 (2024/02/10)
fr: Version 0.7.31 (10/02/2024)

source: Basque is now available in FitTrackee interface.
fr: La langue Basque est maintenant disponible dans l’interface de FitTrackee.

source: Version 0.7.30 (2024/02/04)
fr: Version 0.7.30 (04/02/2024)

source: Version 0.7.29 (2024/01/06)
fr: Version 0.7.29 (04/01/2024)

source: Version 0.7.28 (2023/12/23)
fr: Version 0.7.28 (23/12/2023)

source: Version 0.7.27 (2023/12/20)
fr: Version 0.7.27 (20/12/2023)

source: Italian: 85%
fr: Italien : 85%

source: Norwegian Bokmål: 61%
fr: Norvégien (Bokmål) : 61%

source: Version 0.7.26 (2023/11/19)
fr: Version 0.7.26 (19/11/2023)

source: In addition to dependencies update:
fr: En plus de la mise à jour des dépendances :

source: Version 0.7.25 (2023/10/08)
fr: Version 0.7.25 (08/10/2023)

source: Version 0.7.24 (2023/10/04)
fr: Version 0.7.24 (04/10/2023)

source: Norwegian Bokmål: 35%
fr: Norvégien Bokmål : 35%

source: Version 0.7.23 (2023/09/14)
fr: Version 0.7.23 (14/09/2023)

source: Version 0.7.22 (2023/08/23)
fr: Version 0.7.22 (23/08/2023)

source: Version 0.7.21 (2023/07/30)
fr: Version 0.7.21 (30/07/2023)

source: Version 0.7.20 (2023/07/22)
fr: Version 0.7.20 (22/07/2023)

source: Dutch: 97%
fr: Néerlandais : 97%

source: German: 97%
fr: Allemand : 97%

source: Polish: 56%
fr: Polonais : 56%

source: Version 0.7.19 (2023/07/15)
fr: Version 0.7.19 (15/07/2023)

source: Polish: 42%
fr: Polonais : 42%

source: Version 0.7.18 (2023/06/25)
fr: Version 0.7.18 (25/06/2023)

source: Polish is available in FitTrackee interface (partially translated).<br />Documentation is now translated in French (note: documentation translations are not yet available on Weblate).
fr: L’interface de FitTrackee est disponible en Polonais (traduction partielle).<br />La documentation est quant à elle disponible en Français (note: la traduction de la documentation n’est pas encore disponible sur Weblate).

source: Important: Python 3.7 is no longer supported, the minimum version is now Python 3.8.1.
fr: Important: la version 3.7 de Python n’est plus prise en charge, la version minimale est maintenant la version 3.8.1.

source: Italian: 87%
fr: Italien : 87%

source: Norwegian Bokmål: 36%
fr: Norvégien (Bokmål) : 36%

source: Polish: 43%
fr: Polonais : 43%

source: Thanks to all contributors.
fr: Merci à tous les contributeurs.

source: Version 0.7.17 (2023/06/03)
fr: Version 0.7.17 (03/06/2023)

source: Polish: 3%
fr: Polonais : 3%

source: Version 0.7.16 (2023/05/29)
fr: Version 0.7.16 (29/05/2023)

source: Note: Polish is not yet available in FitTrackee interface.
fr: Note: le Polonais n’est pas encore disponible dans l’interface de FitTrackee.

source: Version 0.7.15 (2023/04/12)
fr: Version 0.7.15 (12/04/2023)

source: Among enhancements and fixes, FitTrackee is now available in Galician, Spanish and partially in Norwegian Bokmål (see translation status below).
fr: Parmi les améliorations et corrections, FitTrackee est maintenant disponible en Galicien, Espagnol et partiellement en Norvégien Bokmål (voir l’avancement de la traduction ci-dessous).

source: Note: DarkSky API support is removed, since the service shut down on March 31, 2023.
fr: Note : le support de l’API de DarkSky est supprimé, le service s’étant arrêté le 31 Mars 2023.

source: J. Lavoie from Weblate
fr: J. Lavoie sur Weblate

source: mondstern from Weblate
fr: mondstern sur Weblate

source: Version 0.7.14 (2023/03/08)
fr: Version 0.7.14 (08/03/2023)

source: Version 0.7.13 (2023/03/05)
fr: Version 0.7.13 (05/03/2023)

source: This version allows to display the instance privacy policy. A user must agree to the privacy policy to register.<br />A default policy is available and a custom policy can be defined in the administration.<br />Note: After FitTrackee upgrade, a message will be displayed to all users in order to review the policy.
fr: Cette version permet d’afficher la politique de confidentialité de l’instance. Un utilisateur doit accepter la politique de confidentialité pour s’inscrire. Une politique de confidentialité par défaut est disponible et une politique personnalisée peut être définie dans l’administration. <br />Note : Après la mise à jour de FitTrackee, un message sera affiché à tous les utilisateurs afin qu’ils puissent prendre connaissance de la politique.

source: A user can now request a data export (containing user info, workout data and uploaded gpx files).
fr: Un utilisateur peut maintenant demandé un export de données (contenant les informations de l’utilisateur, les données des séances et les fichiers gpx téléversés).

source: Lastly, additional information that may be useful to users can be displayed in About page.
fr: Enfin, des informations complémentaires pouvant être utiles aux utilisateurs peuvent être affichées dans la page À propos.

source: update workout and map files name
fr: mise à jour du nom des fichiers des séances et des cartes

source: fix error message when api is not running
fr: corrige le message d’erreur quand l’API n’est pas démarrée

source: fix modal position
fr: corrige la position de la modale

source: Version 0.7.12 (2023/02/16)
fr: Version 0.7.12 (16/02/2023)

source: dependencies update
fr: mise à jour des dépendances

source: Version 0.7.11 (2022/12/31)
fr: Version 0.7.11 (31/12/2022)

source: Version 0.7.10 (2022/12/21)
fr: Version 0.7.10 (21/12/2022)

source: FitTrackee is now available in Italian (thanks to @dperruso).
fr: FitTrackee est maintenant disponible en Italien (merci @dperruso).

source: Version 0.7.9 (2022/12/11)
fr: Version 0.7.9 (11/12/2022)

source: Version 0.7.8 (2022/11/30)
fr: Version 0.7.8 (30/11/2022)

source: FitTrackee is now available in Dutch (thanks to @bjornclauw).
fr: FitTrackee est maintenant disponible en Néerlandais (merci @bjornclauw).

source: Version 0.7.7 (2022/11/27)
fr: Version 0.7.7 (27/11/2022)

source: Note: fittrackee_worker command is disabled, please use existing flask-dramatiq CLI (see documentation)
fr: Note : la commende fittrackee_worker est désactivée, merci d’utiliser l’interface de ligne de commande existante flask-dramatiq (see documentation)

source: Version 0.7.6 (2022/11/09)
fr: Version 0.7.6 (09/11/2022)

source: dev dependencies update
fr: mise à jour des dépendances de développement

source: Version 0.7.5 (2022/11/09)
fr: Version 0.7.5 (09/11/2022)

source: Version 0.7.4 (2022/11/05)
fr: Version 0.7.4 (05/11/2022)

source: Note: archive import still needs some improvements (see #89)
fr: Note : l’import d’archives nécessite encore des améliorations (voir #89)

source: Thanks to @jat255
fr: Merci @jat255

source: Version 0.7.3 (2022/11/01)
fr: Version 0.7.3 (01/11/2022)

source: Version 0.7.2 (2022/09/21)
fr: Version 0.7.2 (21/09/2022)

source: Version 0.7.1 (2022/09/21)
fr: Version 0.7.1 (21/09/2022)

source: Version 0.7.0 (2022/09/19)
fr: Version 0.7.0 (19/09/2022)

source: Version 0.6.12 (2022/09/14)
fr: Version 0.6.12 (14/09/2022)

source: Issues Closed
fr: Tickets Fermés

source: Thanks to @Skylan0916
fr: Merci a @Skylan0916

source: In this release 1 issue was closed.<br />Note: This release contains a fix on the last database migration that will be executed only on versions lower than v0.6.11 (no data differences with v0.6.11, the fix allows to execute the migration on Postgres<12)<br />(see upgrade instructions in documentation).
fr: Dans cette version, 1 ticket a été fermé. <br />Note : Cette version contient une correction sur la dernière migration de base de données qui sera exécutée uniquement sur les versions inférieures à la version 0.6.11 (pas de différences avec la version 0.6.11, la correction permet une exécution de la migration sur des versions de PostgreSQL inférieures à la version 12)<br />(voir les instructions de mise à jour dans la documentation).

source: Version 0.6.11 (2022/07/27)
fr: Version 0.6.11 (27/02/2022)

source: Features
fr: Fonctionnalités

source: Thanks to @Fmstrat
fr: Merci @Fmstrat

source: In this release 1 issue was closed.<br />Note: This release contains database migration (see upgrade instructions in documentation)
fr: Dans cette version, 1 ticket a été fermé.<br />Note : Cette version contient migration de base de données (voir les instructions de mise à jour dans la documentation)

source: Version 0.6.10 (2022/07/13)
fr: Version 0.6.10 (13/07/2022)

source: Thanks to @gorgobacka
fr: Merci @gorgobacka

source: In this release 1 issue was closed.
fr: Dans cette version 1 ticket a été fermé.

source: Version 0.6.9 (2022/07/03)
fr: Version 0.6.9 (03/07/2022)

source: FitTrackee is now available in German (thanks to @gorgobacka).<br />And translations can be updated on Weblate.
fr: FitTrackee est maintenant disponible en Allemand (merci @gorgobacka).<br />Et les traductions peuvent être mises à jour sur Weblate.

source: In this release 4 issues were closed.
fr: Dans cette version 4 tickets ont été fermés.

source: J. Lavoie (from Weblate)
fr: J. Lavoie (sur Weblate)

source: Version 0.6.8 (2022/06/22)
fr: Version 0.6.8 (22/06/2022)

source: change gpx and map file naming (included in PR#195)<br />Note: it does not affect previously imported files
fr: changement dans la nomenclature des fichiers (inclus la PR#195)<br />Note : ceci n’affecte pas les fichiers précédemment importés

source: In this release 3 issues were closed.
fr: Dans cette version 3 tickets ont été fermés.

source: Version 0.6.7 (2022/06/11)
fr: Version 0.6.7 (11/06/2022)

source: Version 0.6.6 (2022/05/29)
fr: Version 0.6.6 (29/05/2022)

source: No new features in this release, only dependencies update and code refacto before introducing new features.
fr: Pas de nouvelles fonctionnalités dans cette version, seulement des mises à jour de dépendances et de la refactorisation de code avant l’ajout de nouvelles fonctionnalités.

source: Version 0.6.5 (2022/04/24)
fr: Version 0.6.5 (24/04/2022)

source: It is now possible to start FitTrackee without a configured SMTP provider (see documentation). It reduces pre-requisites for single-user instances.
fr: Il est maintenant possible de démarrer FitTrackee sans fournisseur SMTP configuré (voir la documentation). Cela réduit les prérequis pour les instances mono-utilisateurs

source: To manage users, a new CLI is available.
fr: Pour gérer les utilisations, une nouvelle interface de ligne de commandes (CLI) est disponible.

source: Version 0.6.4 (2022/04/23)
fr: Version 0.6.4 (23/04/2022)

source: Version 0.6.3 (2022/04/09)
fr: Version 0.6.3 (09/04/2022)

source: add missing translation
fr: ajout de traductions manquantes

source: fix 'Add Workout' card position on small screens
fr: corrige la position de la carte ’Ajouter une séance’ sur les petits écrans

source: Version 0.6.2 (2022/04/03)
fr: Version 0.6.2 (03/04/2022)
