Repository: SamR1/FitTrackee
Catalog: docsrc/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: Authentication and account
fr: Authentification et compte

source: Register a user and send confirmation email.
fr: Enregistrer un utilisateur et envoyer un courriel de confirmation.

source: The newly created account is inactive. The user must confirm his email to activate it.
fr: Le compte nouvellement créé est inactif. L'utilisateur doit confirmer son adresse électronique pour l'activer.

source: **Example request**:
fr: **Exemple de requête** :

source: **Example responses**:
fr: **Exemple de réponses** :

source: success:
fr: succès :

source: error on registration:
fr: erreur lors de l'enregistrement :

source: Request JSON Object
fr: Object JSON de requête

source: username (3 to 30 characters required)
fr: nom d'utilisateur (3 à 30 caractères requis)

source: user email
fr: adresse électronique de l'utilisateur

source: password (8 characters required)
fr: mot de passe (8 caractères minimum)

source: user language preferences (if not provided or invalid, fallback to 'en' (english))
fr: préférence de la langue utilisée sur l'interface (si non fournie, la langue utilisée sera l'anglais ('en')

source: ``true`` if user accepted privacy policy
fr: ``true`` si l'utilisateur a accepté la politique de confidentialité

source: user timezone (if not provided or invalid, fallback to 'Europe/Paris')
fr: préférence du fuseau horaire (si non fournie ou invalide, la valeur utilisée sera 'Europe/Paris')

source: Status Codes
fr: Codes d'état

source: Activate user account after registration.
fr: Activer le compte utilisateur après l'inscription.

source: **Example response**:
fr: **Exemple de réponse** :

source: confirmation token
fr: jeton de confirmation

source: Resend email with instructions to confirm account.
fr: Renvoyer le courriel avec les instructions pour confirmer le compte.

source: If email sending is disabled, this endpoint is not available.
fr: Si l'envoi des courriels est désactivé, ce point d'accès n'est pas disponible.

source: User login.
fr: Connexion de l'utilisateur.

source: Only user with an active account can log in.
fr: Seuls les utilisateurs disposant d'un compte actif peuvent se connecter.

source: successful login:
fr: connexion avec succès :

source: error on login
fr: erreur à la connexion

source: password
fr: mot de passe

source: Get authenticated user info (profile, account, preferences).
fr: Obtenir des informations sur l'utilisateur authentifié (profil, compte, préférences).

source: Suspended user can access this endpoint.
fr: Un utilisateur suspendu peut accéder à ce point d'accès.

source: Request Headers
fr: Entêtes de la requête

source: OAuth 2.0 Bearer Token
fr: Jeton 'OAuth 2.0 Bearer'

source: Edit authenticated user profile.
fr: Modifier le profil de l'utilisateur authentifié.

source: user first name
fr: prénom de l'utilisateur

source: user last name
fr: nom de famille de l'utilisateur

source: user location
fr: localisation de l'utilisateur

source: user biography
fr: biographie de l'utilisateur

source: user birth date (format: ``%Y-%m-%d``)
fr: date de naissance de l'utilisateur (format : ``%Y-%m-%d``)

source: Edit authenticated user preferences.
fr: Modifier les préférences de l'utilisateur authentifié.

source: Supported date formats:
fr: Formats de date pris en charge :

source: ``MM/dd/yyyy`` (default value)
fr: ``MM/dd/yyyy`` (valeur par défaut)

source: ``date_string``, corresponding on client to:
fr: ``date_string``, correspondant sur l'application à :

source: ``MMM. do, yyyy`` for ``en`` locale
fr: ``MMM. do, yyyy`` pour la locale ``en``

source: ``d MMM yyyy`` for ``es``, ``fr``, ``gl``, ``it`` and ``nl`` locales
fr: ``d MMM yyyy`` pour les locales ``es``, ``fr``, ``gl``, ``it`` et ``nl``

source: ``do MMM yyyy`` for ``de`` and ``nb`` locales
fr: `do MMM yyyy`` pour les locales ``de`` et ``nb``

source: workout analysis visibility (``public``, ``followers_only``, ``private``)
fr: visibilité de l'analyse de la séance (``public``, ``followers_only``, ``private``)

source: the format used to display dates in the app
fr: le format utilisé pour afficher les dates dans l'application

source: display highest ascent records and total
fr: afficher les records de dénivelé et le total de dénivelé

source: if ``true``, user does not appear in users directory
fr: si la valeur est ``true``, l'utilisateur n'apparait pas dans le répertoire des utilisateurs.

source: heart rate visibility (``public``, ``followers_only``, ``private``)
fr: visibilité de la fréquence cardiaque (``public``, ``followers_only``, ``private``)

source: display distance in imperial units
fr: afficher la distance en unités impériales

source: language preferences
fr: préférences pour la langue

source: if ``false``, follow requests are automatically approved
fr: si la valeur est ``false``, les demandes de suivi sont automatiquement approuvées

source: workout map visibility (``public``, ``followers_only``, ``private``)
fr: visibilité de la carte de la séance (``public``, ``followers_only``, ``private``)

source: event triggering a segment creation for .fit files (``all``, ``only_manual``, ``none``)
fr: évènement à l'origine de la création d'un segment pour les fichiers .fit (``all``, ``only_manual``, ``none``)

source: if ``true``, multiple charts are displayed in workout detail instead of one
fr: si la valeur est ``true``, plusieurs graphiques sont affichées dans le détail de la séance au lieu d'un seul

source: do elevation plots start at zero?
fr: Les graphiques d'altitude commencent-ils à zéro ?

source: user time zone
fr: fuseau horaire de l'utilisateur

source: Display interface with dark mode if ``true``. If ``null``, it uses browser preferences.
fr: Affiche l'interface avec le thème sombre si la valeur est ``true``. Si la valeur est ``null``, le thème est sélectionné selon les préférences du navigateur.

source: Use unfiltered gpx to calculate speeds
fr: Utiliser des points gpx non filtrés pour calculer les vitesses

source: does week start on Monday?
fr: La semaine commence-t-elle le lundi ?

source: user workouts visibility (``public``, ``followers_only``, ``private``)
fr: visibilité des séances de l'utilisateur (``public``, ``followers_only``, ``private``)

source: Edit authenticated user sport preferences.
fr: Modifier les préférences des sports de l'utilisateur authentifié.

source: id of the sport for which preferences are created/modified
fr: id du sport pour lequel les préférences sont créées/modifiées

source: valid hexadecimal color
fr: couleur au format hexadécimale valide

source: is sport available when adding a workout
fr: le sport est-il disponible lors de l'ajout d'une séance

source: stopped speed threshold used by gpxpy
fr: seuil de vitesse arrêtée utilisé par gpxpy

source: the default equipment id to use for this sport. **Note**: for now only one equipment can be associated.
fr: l'id de l'équipement par défaut à utiliser pour ce sport. **Note** : pour le moment, un seul équipement peut être associé.

source: Reset authenticated user preferences for a given sport.
fr: Réinitialiser les préférences de l'utilisateur authentifié pour un sport donné.

source: Parameters
fr: Paramètres

source: sport id
fr: identifiant du sport

source: user preferences deleted
fr: préférences de l'utilisateur supprimées

source: Edit authenticated user preferences for UI notifications.
fr: Modifier les préférences de notification de l'utilisateur authentifié.

source: notification for user registration (only for user with administration rights)
fr: notification d'inscription d'un utilisateur (seulement si l'utilisateur a des droits d'administration)

source: notification for comment likes
fr: notification de _like_ sur un commentaire

source: notification for follow
fr: notification de suivi

source: notification for follow requests
fr: notification de demande d'abonnement

source: notification for follow request approval
fr: notification de demande d'abonnement approuvée

source: notification for mention
fr: notification de mention

source: notification for comments on workout
fr: notification de commentaire sur une séance

source: notification for workout likes
fr: notification de _like_ sur une séance

source: Edit authenticated user preferences for messages displayed on UI.
fr: Modifier les préférences de l'utilisateur authentifié pour les messages affichés sur l'interface utilisateur

source: message displayed before displaying a large number of workouts on a map
fr: message affiché avant l'affichage d'un grand nombre de séances sur la carte

source: Update authenticated user picture.
fr: Mise à jour de l'image de l'utilisateur authentifié.

source: Form Parameters
fr: Paramètres du formulaire

source: image file (allowed extensions: .jpg, .png, .gif)
fr: fichier de l'image (extensions autorisées : .jpg, .png, .gif)

source: Delete authenticated user picture.
fr: Supprimer l'image de l'utilisateur authentifié.

source: picture deleted
fr: image supprimée

source: Handle password reset request.
fr: Traiter les demandes de réinitialisation de mot de passe.

source: Update authenticated user email and password.
fr: Mise à jour de l'email et du mot de passe de l'utilisateur authentifié.

source: It sends emails if sending is enabled:
fr: Les courriels suivants sont envoyés si l'envoi est activé :

source: Password change
fr: Modification de mot de passe

source: Email change:
fr: Changement d'adresse électronique :

source: one to the current address to inform user
fr: un à l'adresse actuelle pour informer l'utilisateur

source: another one to the new address to confirm it.
fr: un autre à la nouvelle adresse pour la confirmer.

source: user current password
fr: mot de passe actuel de l'utilisateur

source: user new password
fr: nouveau mot de passe de l'utilisateur

source: Update user password after password reset request.
fr: Mise à jour du mot de passe de l'utilisateur après une demande de réinitialisation du mot de passe.

source: It sends emails if sending is enabled.
fr: Uniquement si l'envoi est activé.

source: password reset token
fr: jeton de réinitialisation du mot de passe

source: Update user email after confirmation.
fr: Mise à jour de l'adresse électronique de l'utilisateur après confirmation.

source: User logout. If a valid token is provided, it will be blacklisted.
fr: Déconnexion de l'utilisateur. Si un jeton valide est fourni, il sera invalidé.

source: successful logout:
fr: déconnexion avec succès :

source: error on logout:
fr: erreur lors de la déconnexion :

source: The authenticated user accepts the privacy policy.
fr: L'utilisateur authentifié accepte la politique de confidentialité.

source: Get a data export info for authenticated user if a request exists.
fr: Obtenir l'archive de l'export de données pour l'utilisateur authentifié si une demande existe.

source: It returns:
fr: Il renvoie :

source: export creation date
fr: date de création de l'export

source: export status (``in_progress``, ``successful`` and ``errored``)
fr: état de l'export (``in_progress``, ``successful`` and ``errored``)

source: file name and size (in bytes) when export is successful
fr: nom du fichier et sa taille (en octets) lorsque l'export est réussi

source: if a request exists:
fr: si une requête existe :

source: if no request:
fr: si aucun requête :

source: Request a data export for authenticated user.
fr: Demande d'export de données pour un utilisateur authentifié.

source: Download a data export archive.
fr: Télécharger une archive d'export de données.

source: filename
fr: nom du fichier

source: Get blocked users by authenticated user
fr: Obtenir les utilisateurs bloqués par l'utilisateur authentifié.

source: **Example requests**:
fr: **Exemple de requêtes** :

source: without parameters:
fr: sans paramètres :

source: with parameters:
fr: avec des paramètres :

source: with blocked users:
fr: avec les utilisateurs bloqués :

source: no blocked users:
fr: sans les utilisateurs bloqués :

source: Query Parameters
fr: Paramètres de la requête

source: page if using pagination (default: 1)
fr: page si pagination (par défaut : 1)

source: Get suspension if exists for authenticated user.
fr: Obtenir tous les records pour l'utilisateur authentifié.

source: suspension exists:
fr: une suspension existe :

source: no suspension:
fr: aucun suspension :

source: Appeal suspension for authenticated user.
fr: Faire appeal de la suspension de l'utilisateur authentifié.

source: text explaining appeal
fr: texte expliquant la raison de l'appel

source: appeal for suspension created
fr: appel pour la suspension créé

source: Get sanction for authenticated user.
fr: Obtenir les sanctions pour l'utilisateur authentifié.

source: suspension id
fr: identifiant de la suspension

source: Appeal a sanction
fr: Faire appel de la suspension

source: sanction id
fr: identifiant de la sanction

source: appeal created
fr: appel créé

source: Returns list of available time zones
fr: Renvoie la liste des fuseaux horaires disponibles

source: Comments
fr: Commentaires

source: Get workout comments.
fr: Obtenir les commentaires de le séance.

source: It returns only comments visible to authenticated user and only public comments when no authentication provided.
fr: Retourne uniquement les commentaires visibles par l'utilisateur authentifié et les commentaires publiques sans authentification.

source: workout short id
fr: identifiant court de la séance

source: OAuth 2.0 Bearer Token for comments with ``private`` and ``followers_only`` visibility
fr: Jeton 'OAuth 2.0 Bearer' pour les commentaires avec une visibilité ``private`` et``followers_only``

source: Get comment.
fr: Obtenir le commentaire.

source: comment short id
fr: identifiant court du commentaire

source: OAuth 2.0 Bearer Token for comment with ``private`` and ``followers_only`` visibility
fr: Jeton 'OAuth 2.0 Bearer' pour le commentaire avec une visibilité ``private`` et ``followers_only``

source: Post a comment.
fr: Poster un commentaire.

source: comment content
fr: contenu du commentaire

source: visibility level (``public``, ``followers_only``, ``private``)
fr: niveau de visibilité (``public``, ``followers_only``, ``private``)

source: Update comment text.
fr: Mettre à jour le texte du commentaire.

source: Add a "like" to a comment.
fr: Ajouter un "like" au commentaire.

source: Remove a comment "like".
fr: Supprimer le "like" du commentaire.

source: Get users who like comment.
fr: Obtenir la liste des utilisateurs qui ont "liké" le commentaire

source: Appeal comment suspension.
fr: Faire appel de la suspension du commentaire.

source: Only comment author can appeal the suspension.
fr: Seul l'auteur du commentaire peut faire appel de la suspension.

source: Delete workout comment.
fr: Supprimer le commentaire de la séance.

source: comment deleted
fr: commentaire supprimé

source: Get Application configuration.
fr: Obtenir la configuration de l'application.

source: Update Application configuration.
fr: Mettre à jour de la configuration de l'application.

source: **Minimum role**: Administrator
fr: **Rôle minimum**: Administrateur

source: instance information
fr: informations de l'instance

source: email to contact the administrator
fr: adresse électronique pour contacter l'administrateur

source: max number of files in zip archive, processed synchronously (it must not exceed ``file_limit_import``)
fr: nombre maximum de fichiers dans une archive zip, traité de façon synchrone (ne doit pas excéder ``file_limit_import``)

source: max number of files in zip archive
fr: nombre maximum de fichiers dans l'archive zip

source: max number of workouts displayed on global map
fr: nombre maximal de séances afficher sur la carte

source: is registration enabled?
fr: l'inscription est-elle activée ?

source: max size of a single file
fr: taille maximale d'un fichier

source: max users allowed to register on instance
fr: nombre maximum d'utilisateurs autorisés à s'inscrire sur l'instance

source: max size of a zip archive
fr: taille maximale d'une archive zip

source: instance privacy policy
fr: politique de confidentialité de l'instance

source: max number of workouts for sport statistics
fr: nombre maximum de séances pour les statistiques d'un sport

source: health check endpoint
fr: point d'accès de contrôle

source: Equipment Types
fr: Types d'équipement

source: Get all types of equipment.
fr: Obtenir tous les types d'équipement.

source: for non admin user :
fr: pour un utilisateur non admin :

source: for admin user :
fr: pour un administrateur :

source: success
fr: succès

source: Get a type of equipment
fr: Obtenir un type d'équipement

source: success for non admin user :
fr: succès pour un utilisateur non admin :

source: success for admin user :
fr: succès pour un administrateur :

source: equipment type not found
fr: type d'équipement non trouvé

source: equipment type id
fr: id du type d'équipement

source: Update a type of equipment to (de)activate it.
fr: Modifier un type d'équipement pour le (dés)activer.

source: success :
fr: succès :

source: equipment type active status
fr: état d'activation du type d'équipement

source: Equipments
fr: Équipements

source: Get all user equipments. Only the equipment owner can see his equipment.
fr: Obtenir tous les équipements d'un utilisateur. Seul le propriétaire de l'équipement peut voir son équipement.

source: with some query parameters (get all equipment of type "Shoes")
fr: avec quelques paramètres de requête (obtenir tous les équipements de type "Shoes")

source: Get an equipment item. Only the equipment owner can see his equipment.
fr: Obtenir un équipement. Seul le propriétaire de l'équipement peut voir son équipement.

source: equipment not found
fr: équipement non trouvé :

source: equipment short id
fr: id court de l'équipement

source: Post a new piece of equipment.
fr: Créer un nouvel équipement.

source: a brief (less than 50 characters) label for the piece of equipment
fr: un label bref (moins de 50 caractères) pour l'équipement

source: the ID for an equipment type (it must be active)
fr: l'id d'un type d'équipement (il doit être actif)

source: a (perhaps longer) description of the equipment (limited to 200 characters, optional)
fr: une description (éventuellement plus longue) de l'équipement (limitée à 200 caractères, facultatif)

source: whether or not this equipment is currently active (default: ``true``)
fr: si cet équipement est actuellement actif ou non (par défaut : ``true``)

source: the default sport ids to use for this equipment, not mandatory
fr: les id des sports par défaut à utiliser pour cet équipement, non obligatoires

source: visibility level (``public``, ``followers_only``, ``private``), not mandatory (default value: ``private``)
fr: niveau de visibilité (``public``, ``followers_only``, ``private``), optionnel (valeur par défaut : ``private``)

source: equipment created
fr: équipement créé

source: Update a piece of equipment. Allows a user to change one of their equipment's label, description, type or active status.
fr: Modifier un équipement. Permet à un utilisateur de modifier le label, la description, le type ou le statut actif d'un de ses équipements.

source: Changing equipment type will remove all existing workouts associations for that piece of equipment and default sports.
fr: Le changement de type d'un équipement supprimera toutes les associations existantes à des séances pour cet équipement et les sports définis par défaut.

source: the default sport ids to use for this equipment
fr: les id des sports par défaut à utiliser pour cet équipement

source: equipment updated
fr: équipement mis à jour

source: Refresh equipment totals (in case values are incorrect).
fr: Recalcule les totaux de l'équipement (dans le cas où les valeurs seraient incorrectes).

source: Delete a piece of equipment.
fr: Supprimer un équipement

source: A user can only delete their own equipment, and only if there are no workouts associated with that equipment (unless forced). If equipment was associated with any workouts and deletion is forced, the association between this equipment and those workouts will be removed. If this equipment was a default for any sport, that default will be removed (set to NULL).
fr: Un utilisateur ne peut supprimer que son propre équipement, et seulement s'il n'y a pas de séances associées à cet équipement (à moins que la suppression ne soit forcée). Si l'équipement était associé à des séances et que la suppression est forcée, l'association entre cet équipement et ces séances sera supprimée. Si cet équipement était un équipement par défaut pour n'importe quel sport, la préférence sera mise à jour.

source: if supplied as argument (no value required), will force deletion of the equipment and remove that equipment from associated workouts
fr: si fourni en tant qu'argument (aucune valeur requise), cela forcera la suppression de l'équipement et l'enlèvera des séances associées

source: equipment deleted
fr: équipement supprimé

source: Follow requests
fr: Demandes de suivi

source: Get follow requests to process, received by authenticated user.
fr: Obtenir les demandes de suivi à valider, reçues par l'utilisateur authentifié.

source: without parameters
fr: sans paramètres

source: with some query parameters
fr: avec quelques paramètres de requête

source: number of follow requests per page (default: 10, max: 50)
fr: nombre de demande de suivi par page (par défaut : 10, max : 50)

source: sorting order (default: ``asc``)
fr: ordre de tri (par défaut : ``asc``)

source: Accept a follow request from user.
fr: Accepter la demande de suivi d'un utilisateur

source: user name
fr: nom de l'utilisateur

source: Reject a follow request from user.
fr: Rejeter la demande de suivi d'un utilisateur.

source: Return coordinates based on location (city) using Nominatim API.
fr: Renvoie les coordonnées à partir de la localisation (ville) en utilisant l'API Nominatim

source: returning at least one location:
fr: renvoyant au moins une localisation :

source: returning no locations
fr: renvoyant aucune localisation

source: location
fr: localisation

source: Return location based on OSM id using Nominatim API.
fr: Renvoie la localisation à partir de l'identifiant OSM en utilisant l'API Nominatim

source: returning location:
fr: renvoyant une localisation

source: returning no location
fr: renvoyant aucune localisation

source: OSM id, prefixed by location type
fr: identifiant OSM préfixé par le type de localisation

source: Endpoints:
fr: Points d'accès :

source: API documentation
fr: Documentation de l'API

source: Get authenticated user notifications.
fr: Obtenir les notifications de l'utilisateur authentifié.

source: with some query parameters:
fr: avec quelques paramètres de requête :

source: returning at least one notification:
fr: renvoyant au moins une notification :

source: returning no notifications
fr: renvoyant aucune notification

source: sorting order: ``asc``, ``desc`` (default: ``desc``)
fr: ordre de tri : ``asc``, ``desc`` (par défaut : ``desc``)

source: notification read status (``read``, ``unread``)
fr: état de lecture de la notification (``read``, ``unread``)

source: Update authenticated user notification read status.
fr: Mettre à jour l'état de lecture de la notification reçue par l'utilisateur authentifié.

source: notification short id
fr: identifiant court de la notification

source: notification read status
fr: état de lecture de la notification

source: Get if unread notifications exist for authenticated user.
fr: Obtenir si des notifications non lues existent pour l'utilisateur authentifié.

source: Mark all authenticated user notifications as read.
fr: Marquer tous les notifications de l'utilisateur authentifié comme lues.

source: notification type (optional)
fr: type de notifications (optionnel)
