Repository: SamR1/FitTrackee
Catalog: docsrc/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: Get types of notifications received by authenticated user.
fr: Obtenir le type des notifications reçues de l'utilisateur authentifié.

source: with query parameter:
fr: avec le paramètre de requête :

source: Get OAuth2 clients (apps) for authenticated user with pagination (5 clients/page).
fr: Obtenir les clients OAuth2 pour l'utilisateur authentifié avec pagination (5 clients/page).

source: This endpoint is only accessible by FitTrackee client (first-party application).
fr: Ce point d'accès n'est accessible que par le client web FitTrackee.

source: with 'page' parameter:
fr: avec le paramètre 'page' :

source: page for pagination (default: 1)
fr: page pour la pagination (par défaut : 1)

source: Create an OAuth2 client (app) for the authenticated user.
fr: Créer un client OAuth2 pour l'utilisateur authentifié.

source: JSON Parameters
fr: Paramètres JSON

source: client name
fr: nom du client

source: client URL
fr: URl du client

source: list of client redirect URLs (string)
fr: liste des URL de redirection du client (chaîne de caractères)

source: client scopes
fr: scopes du client

source: client description (optional)
fr: description du client (optionnelle)

source: Get an OAuth2 client (app) by 'client_id'.
fr: Obtenir un client OAuth2 avec le 'client_id'.

source: not found:
fr: non trouvé :

source: OAuth2 client client_id
fr: client_id du client OAuth2

source: Get an OAuth2 client (app) by id (integer value).
fr: Obtenir un client OAuth2 avec l'identifiant (valeur de type entier).

source: OAuth2 client id
fr: Identifiant du client OAuth2

source: OAuth2 client deleted
fr: Supprimer un client OAuth2

source: Revoke all tokens associated to an OAuth2 client (app).
fr: Révoquer tous les tokens associés à un client OAuth2.

source: Authorize an OAuth2 client (app). If successful, it redirects to the client callback URL with the code to issue a token.
fr: Autoriser un client OAuth2 (app). En cas de succès, il redirige vers l'URL de redirection du client avec le code pour émettre un jeton.

source: OAuth2 client 'client_id'
fr: 'client_id' du client OAuth2

source: client response type (only 'code' is supported by FitTrackee)
fr: type de réponse du client (seul 'code' est supporté par FitTrackee)

source: OAuth2 client scopes
fr: scope du client OAuth2

source: confirmation (must be ``true``)
fr: confirmation (doit être ``true``)

source: unique value to prevent cross-site request forgery (not mandatory but recommended)
fr: valeur unique pour éviter la falsification des requêtes entre les sites (*cross-site request forgery* (CSRF)), non obligatoire mais recommandée

source: string generated from a code verifier (for PKCE, not mandatory but recommended)
fr: chaîne générée par un vérificateur de code (pour PKCE, non obligatoire mais recommandée)

source: method used to create challenge, for instance "S256" (mandatory if `code_challenge` provided)
fr: méthode utilisée pour créer le challenge, par exemple "S256" (obligatoire si `code_challenge` fourni)

source: errors returned by Authlib library
fr: erreurs renvoyées par la librairie Authlib

source: Issue or refresh token for a given OAuth2 client (app).
fr: Délivrer ou rafraîchir un jeton pour un client OAuth2 donné.

source: OAuth2 client secret
fr: secret du client OAuth2

source: OAuth2 client grant type (only 'authorization_code' (for token issue) and 'refresh_token' (for token refresh) are supported by FitTrackee)
fr: Type d'autorisation du client OAuth2 (seuls 'authorization_code' (pour l'émission de jetons) et 'refresh_token' (pour le rafraîchissement de jeton) sont pris en charge par FitTrackee)

source: code generated after authorizing the client (for token issue)
fr: code généré après l'autorisation du client (pour l'émission de jetons)

source: code verifier (for token issue with PKCE, not mandatory)
fr: vérificateur de code (pour l'émission de jetons avec PKCE, non obligatoire)

source: refresh token (for token refresh)
fr: jeton de rafraîchissement (pour le rafraîchissement du jeton)

source: Revoke a token for a given OAuth2 client (app).
fr: Révoquer un jeton pour un client OAuth2 donné.

source: access token to revoke
fr: jeton d'accès à révoquer

source: Queued Tasks
fr: Tâches en attente

source: Get queued tasks.
fr: Obtenir les tâches en attente

source: Get queued tasks for a given type
fr: Obtenir les tâches en attente pour un type donné

source: Get all records for authenticated user.
fr: Obtenir tous les records pour l'utilisateur authentifié.

source: Following types of records are available, depending en sport:
fr: Les types de records suivants sont disponibles, en fonction du sport :

source: average pace (record_type: ``AP``)
fr: allure moyenne (record_type : ``AP``)

source: average speed (record_type: ``AS``)
fr: vitesse moyenne (record_type : ``AS``)

source: best pace (record_type: ``BP``)
fr: meilleure allure (record_type : ``BP``)

source: farthest distance (record_type: ``FD``)
fr: distance la plus élevée (record_type : ``FD``)

source: highest ascent (record_type: ``HA``)
fr: dénivelé le plus élevé (record_type : ``HA``)

source: longest duration (record_type: ``LD``)
fr: durée la plus longue (record_type : ``LD``)

source: maximum speed (record_type: ``MS``)
fr: vitesse maximale (record_type : ``MS``)

source: returning records
fr: retournant des records

source: no records
fr: pas de record

source: Reports
fr: Signalements

source: Get reports.
fr: Obtenir les signalements.

source: **Minimum role**: Moderator
fr: **Rôle minimum**: Modérateur

source: returning at least one report:
fr: renvoyant au moins un signalement :

source: returning no reports
fr: renvoyant aucun signalement

source: reported content type (``comment``, ``user`` or ``workout``)
fr: type de contenu signalé (``comment``, ``user`` ou ``workout``)

source: sorting criteria: ``created_at`` or ``updated_at``
fr: critère de tri: ``created_at`` ou ``updated_at``

source: reporter username
fr: nom d'utilisateur du rapporteur

source: filter on report status
fr: filtrer sur le status des signalements

source: Get report.
fr: Obtenir un signalement.

source: Get if unresolved reports exist.
fr: Obtenir si des signalements non résolus existent

source: Create a report.
fr: Modifier un signalement.

source: note describing report
fr: note décrivant le signalement

source: id of content reported
fr: identifiant du contenu signalé

source: type of content reported (``comment``, ``workout`` or ``user``)
fr: type du content signalé (``comment``, ``workout`` ou ``user``)

source: report created
fr: signalement créé

source: Update report.
fr: Modifier un signalement.

source: **Example response** (report on user profile):
fr: **Exemple de réponse** (signalement sur un profil utilisateur):

source: report id
fr: identifiant du signalement

source: report comment (mandatory)
fr: commentaire du signalement (obligatoire)

source: report status
fr: état du signalement

source: Create report action.
fr: Créer une action liée à un signalement.

source: id of comment affected by action (type: ``comment_suspension``, ``comment_suspension``)
fr: identifiant du commentaire concerné par l'action (type: ``comment_suspension``, ``comment_suspension``)

source: text explaining the reason for the action
fr: texte expliquent la raison de l'action

source: username of user affected by action (type: ``user_suspension``, ``user_unsuspension``, ``user_warning``)
fr: nom de l'utilisateur concerné par l'action (type: ``comment_suspension``, ``comment_suspension``)

source: id of workout affected by action (type: ``workout_suspension``, ``workout_unsuspension``)
fr: identifiant de la séance concernée par l'action (type: ``comment_suspension``, ``comment_suspension``)

source: Process appeal.
fr: Gérer la demande d'appel.

source: appeal id
fr: identifiant de l'appel

source: ``true`` if appeal is approved, ``false`` if rejected
fr: ``true`` si l'appel est accepté, ``false`` si rejeté

source: text explaining why the appeal was approved or rejected
fr: text expliquant pourquoi l'appel est accepté ou rejeté

source: RSS Feeds
fr: Flux RSS

source: RSS feed with user's last 5 public workouts.
fr: Flux RSS des 5 dernières séances de l'utilisateur.

source: Note: it does not display workouts when user is suspended.
fr: Note: les séances ne sont pas affichées si l'utilisateur est suspendu

source: RSS feed language (two-letter code, ISO 639-1, default: 'en'). If provided language is not supported, it falls back to English.
fr: Langue du flux RSS (code à deux lettres, ISO 639-1, défaut: "en"). Si la langue fournie n'est pas supportée, la valeur est l'anglais ("en").

source: display values with imperial units. If false, metric system is used instead (default: false).
fr: affiche les valeurs avec les unités impériales. Si ``false``, le système métrique est utilisé (défaut: ``false``)

source: display workout description if true (default: false).
fr: affiche la description si ``true`` (défaut: ``false``)

source: Get all sports.
fr: Obtenir tous les sports.

source: for non admin user:
fr: pour un utilisateur non admin :

source: for admin user and check_workouts=true:
fr: pour un utilisateur admin et check_workouts=true :

source: check if sport has workouts
fr: vérifier si le sport est associé à des séances

source: OAuth 2.0 Bearer Token if user is authenticated
fr: Jeton 'OAuth 2.0 Bearer' si l'utilisateur est authentifié

source: Get a sport.
fr: Obtenir un sport.

source: success for non admin user:
fr: succès pour un utilisateur non admin :

source: sport not found:
fr: sport non trouvé :

source: Update a sport.
fr: Modifier un sport.

source: Authenticated user must be an admin.
fr: L'utilisateur authentifié doit avoir des droits d'administration.

source: sport active status
fr: état d'activation du sport

source: sport updated
fr: sport mis à jour

source: Statistics
fr: Statistiques

source: Get workouts statistics for a user by time. For now only authenticated users can access their statistics. Average speed is returned for Hiking, Running, Trail and Walking only if user preferences allow it.
fr: Obtenir des statistiques sur les séances pour un utilisateur par période de temps. Seul l'utilisateur authentifié peut accéder à ses statistiques. L'allure moyenne est renvoyée pour la randonnée, la course à pied, le trail et la marche uniquement si les préférences de l'utilisateur le permettent.

source: success for total:
fr: succès pour les totaux :

source: success for average:
fr: succès pour les moyennes :

source: no workouts:
fr: pas de séances :

source: username
fr: nom d'utilisateur

source: start date (format: ``%Y-%m-%d``)
fr: date de début (format : ``%Y-%m-%d``)

source: end date (format: ``%Y-%m-%d``)
fr: date de fin (format : ``%Y-%m-%d``)

source: time frame: - ``day``: day - ``week``: week starting Sunday - ``weekm``: week starting Monday - ``month``: month - ``year``: year (default)
fr: période de temps : - ``day``: jour - ``week`` : semaine commençant le dimanche - ``weekm`` : semaine commençant le lundi - ``month`` : mois - ``year`` : année (default)

source: time frame:
fr: période de temps :

source: ``day``: day
fr: ``day``: jour

source: ``week``: week starting Sunday
fr: ``week`` : semaine commençant le dimanche

source: ``weekm``: week starting Monday
fr: ``weekm`` : semaine commençant le lundi

source: ``month``: month
fr: ``month`` : mois

source: ``year``: year (default)
fr: ``year`` : année (default)

source: stats type: - ``total``: calculating totals - ``average``: calculating averages
fr: type de statistiques : - ``total``: calcul des totaux - ``average``: calcul des moyennes

source: stats type:
fr: type de statistiques :

source: ``total``: calculating totals
fr: ``total``: calcul des totaux

source: ``average``: calculating averages
fr: ``average``: calcul des moyennes

source: Get workouts statistics for a user by sport. For now only authenticated users can access their statistics. Average speed is returned for Hiking, Running, Trail and Walking only if user preferences allow it.
fr: Obtenir des statistiques sur les séances pour un utilisateur par sport. Seul l'utilisateur authentifié peut accéder à ses statistiques. L'allure moyenne est renvoyée pour la randonnée, la course à pied, le trail et la marche uniquement si les préférences de l'utilisateur le permettent.

source: without parameters (get stats for all sports with workouts):
fr: sans paramètres (obtenir les statistiques pour tous les sports ayant des séances) :

source: with sport id:
fr: avec l'identifiant du sport :

source: success for all sports:
fr: succès pour tous les sports :

source: success for a given sport:
fr: succès pour un sport donné :

source: sport id (not mandatory). If not provided, statistics for all sports are returned.
fr: identifiant du sport (non obligatoire). Si non fourni, les statistiques sont retournées pour tous les sports.

source: Get all application statistics.
fr: Obtenir toutes les statistiques de l'application.

source: Timeline
fr: Flux de séances

source: Get workouts visible to authenticated user.
fr: Obtenir les séances visibles par l'utilisateur authentifié.

source: returning at least one workout:
fr: renvoyant au moins une séance :

source: returning no workouts
fr: renvoyant aucune séance

source: Users
fr: Utilisateurs

source: Get all users. If authenticated user has admin rights, users email is returned.
fr: Obtenir tous les utilisateurs (quel que soit le statut de leur compte), si l'utilisateur authentifié a des droits d'administration le courriel est renvoyé.

source: It returns user preferences only for authenticated user.
fr: Ne renvoie les préférences de l'utilisateur que pour l'utilisateur authentifié.

source: number of users per page (default: 10, max: 50)
fr: nombre d'utilisateurs par page (par défaut : 10, max : 50)

source: query on user name
fr: requête sur le nom de l'utilisateur

source: sorting order: ``asc``, ``desc`` (default: ``asc``)
fr: ordre de tri : ``asc``, ``desc`` (par défaut : ``asc``)

source: sorting criteria: ``username``, ``created_at``, ``workouts_count``, ``role``, ``is_active`` (default: ``username``)
fr: critères de tri : ``username``, ``created_at``, ``workouts_count``, ``role``, ``is_active`` (par défaut : ``username``)

source: returns hidden users followed by user if true
fr: renvoie les utilisateurs dont le profil est masqué si ``true``

source: returns hidden users if ``true`` (only if authenticated user has administration rights - for users administration)
fr: renvoie les utilisateurs dont le profil est masqué si ``true`` (seulement si l'utilisateur a les droits d'administration - pour l'administration des utilisateurs

source: returns inactive users if ``true`` (only if authenticated user has administration rights - for users administration)
fr: renvoie les utilisateurs inactifs si ``true`` (seulement si l'utilisateur a les droits d'administration - pour l'administration des utilisateurs

source: returns suspended users if ``true`` (only if authenticated user has administration rights - for users administration)
fr: renvoie les utilisateurs suspendus si ``true`` (seulement si l'utilisateur a les droits d'administration - pour l'administration des utilisateurs

source: Get single user details. If a user is authenticated, it returns relationships. If authenticated user has admin rights, user email is returned.
fr: Obtenir les informations de l'utilisateur. Si l'utilisateur est authentifié, ce point d'entrée renvoie les relations. Si l'utilisateur a des droits d'administrations, l'email est renvoyé.

source: **Scope**: ``users:read`` for Oauth 2.0 client
fr: **Scope** : ``users:read`` pour le client OAuth 2.0

source: when a user is authenticated:
fr: quand l'utilisateur est authentifié

source: when no authentication:
fr: sans authentification

source: get user picture
fr: obtenir l'image de l'utilisateur

source: Update user account.
fr: Mise à jour du compte utilisateur.

source: add/remove admin rights (regardless user account status)
fr: ajouter/supprimer des droits d'administration (quel que soit le statut du compte d'utilisateur)

source: reset password (and send email to update user password, if sending enabled)
fr: réinitialiser le mot de passe (et envoyer un courriel pour mettre à jour le mot de passe de l'utilisateur, si l'envoi activé)

source: update user email (and send email to new user email, if sending enabled)
fr: mettre à jour l'adresse électronique de l'utilisateur (et envoyer un message à la nouvelle adresse électronique de l'utilisateur, si l'envoi est activé)

source: activate account for an inactive user
fr: activer le compte d'un utilisateur inactif

source: deactivate account after report.
fr: désactiver le compte utilisateur après signalement.

source: (de-)activate user account
fr: (dés-)activer le compte utilisateur

source: user role (``user``, ``admin``, ``moderator``). ``owner`` can only be set via **CLI**.
fr: rôle de l'utilisateur (``user``, ``admin``, ``moderator``). Le rôle``owner`` ne peut être donné que via la **CLI**.

source: new user email
fr: nouvelle adresse électronique de l'utilisateur

source: reset user password
fr: réinitialiser le mot de passe de l'utilisateur

source: Delete a user account.
fr: Supprimer un compte utilisateur.

source: A user can only delete his own account.
fr: Un utilisateur ne peut supprimer que son propre compte.

source: A user with admin rights can delete all accounts except his account if he is the only user with admin rights. Only owner can delete his own account.
fr: Un utilisateur avec des droits d'administration peut supprimer tous les comptes sauf le sien s'il est le seul utilisateur avec des droits d'administration.

source: user account deleted
fr: compte de l'utilisateur supprimé

source: Send a follow request to a user.
fr: Envoyer une demande de suivi à un utilisateur.

source: Unfollow a user.
fr: Arrêter de suivre un utilisateur.

source: Get user followers. If the authenticated user has admin rights, it returns following users with additional field 'email'
fr: Obtenir les utilisateurs suivants l'utilisateur authentifié. Si l'utilisateur a des droits d'administration, l'email est également renvoyé.

source: with page parameter
fr: avec le paramètre 'page' :

source: Get user following. If the authenticate user has admin rights, it returns following users with additional field 'email'
fr: Obtenir les utilisateurs suivis par l'utilisateur authentifié. Si l'utilisateur a des droits d'administration, l'email est également renvoyé.

source: Block a user
fr: Bloquer un utilisateur

source: Unblock a user
fr: Débloquer un utilisateur

source: Get user sanctions.
fr: Obtenir les sanctions de l'utilisateur.

source: It returns sanctions only if: - user name is authenticated user username - user has moderation rights.
fr: Les sanctions sont renvoyées uniquement si: - l'utilisateur est l'utilisateur authentifié - l'utilisateur a des droits de modération.

source: if sanctions exist (response with moderation rights)
fr: si des sanctions existent (réponse avec des droits de modération)

source: if sanctions exist (response for authenticated user)
fr: si des sanctions existent (réponse pour l'utilisateur authentifié)

source: no sanctions
fr: aucune sanction

source: Get user last 5 visible workouts.
fr: Obtenir les 5 dernières séances de l'utilisateur.

source: Workouts
fr: Séances

source: Get workouts for the authenticated user.
fr: Obtenir les séances de l'utilisateur authentifié.

source: with statistics
fr: avec les statistiques

source: number of workouts per page (default: 5, max: 100)
fr: nombre de séances par page (par défaut : 5, max : 100)

source: any part (or all) of the workout title; title matching is case-insensitive
fr: une partie (ou la totalité) du titre de la séance, la correspondance avec le titre ne tient pas compte des majuscules et des minuscules

source: minimal distance
fr: distance minimale

source: maximal distance
fr: distance maximale

source: minimal duration (format: ``%H:%M``)
fr: durée minimale (format : ``%H:%M``)

source: maximal distance (format: ``%H:%M``)
fr: distance maximale (format : ``%H:%M``)

source: minimal average speed
fr: vitesse moyenne minimale

source: maximal average speed
fr: vitesse moyenne maximale

source: minimal max. speed
fr: vitesse max. minimale

source: maximal max. speed
fr: vitesse max. maximale

source: equipment id (if ``none``, only workouts without equipments will be returned)
fr: identifiant de l'équipement (si valeur à ``none``, seules les séances sans équipements seront renvoyées)

source: any part (or all) of the workout notes, notes matching is case-insensitive
fr: une partie (ou la totalité) des notes de la séance, la correspondance avec les notes ne tient pas compte des majuscules et des minuscules

source: any part of the workout description; description matching is case-insensitive
fr: une partie de la description de la séance, la correspondance avec la description ne tient pas compte des majuscules et des minuscules

source: return workouts with equipment (by default, equipment is not returned). **Note**: It's not a filter. **Warning**: Needed for 3rd-party applications updating equipments.
fr: renvoie les séances avec l'équipement (par défaut, l'équipement n'est pas renvoyé). **Note**: Il ne s'agit pas d'un filtre. **Attention**: nécessaire pour les applications tierces mettant à jour les équipements.

source: workout visibility (``private``, ``followers_only`` or ``public``)
fr: visibilité de la séance (``private``, ``followers_only`` ou ``public``)

source: return statistics when ``true`` (by default, statistics are not returned)
fr: renvoie les statistics quand la valeur est ``true`` (par défaut les statistiques ne sont pas renvoyées)

source: location coordinates separated with a comma (latitude, longitude)
fr: coordonnées de la localisation séparée par une virgule (latitude, longitude)

source: radius in km, only used when location is provided (default: 10)
fr: rayon en km, utilisé uniquement quand la localisation est fournie (défaut: 10)

source: Get workouts for the authenticated user as a feature collection, in order to display the workouts listed in the workout list on the map.
fr: Obtenir les séances de l'utilisateur authentifié sous forme d'une *feature collection*, pour afficher les séances de la liste des séances sur la carte.

source: Note: the pagination returns counts for all workouts (with or without geometries) to match `/api/workouts` pagination on the user interface.
fr: Note: la pagination renvoie les valeurs pour toutes les séances (avec ou sans géometries) pour correspondre à la pagination du point d'entrée `/api/workouts` sur l'interface utilisateur.

source: Get all workouts with start point geometry for the authenticated user as a feature collection, in order to display workouts on the global map.
fr: Obtenir les séances de l'utilisateur authentifié, avec le point de départ, sous forme d'une *feature collection*, afin de les afficher sur la carte globale.

source: ids of sports, separated by a comma
fr: identifiants des sports séparés par une virgule

source: Get a workout.
fr: Obtenir une séance.

source: workout not found:
fr: séance non trouvé :

source: OAuth 2.0 Bearer Token for workout with ``private`` or ``followers_only`` visibility
fr: Jeton 'OAuth 2.0 Bearer' pour la séance avec une visibilité ``private`` et ``followers_only``

source: Get workout GeoJSON when segments have geometry.
fr: Obtenir le GeoJSON de la séance, quand les segments ont une géométrie.

source: OAuth 2.0 Bearer Token for workout with ``private`` or ``followers_only`` map visibility
fr: Jeton 'OAuth 2.0 Bearer' pour la séance avec une visibilité ``private`` et ``followers_only`` pour la carte
