Repository: SamR1/FitTrackee
Catalog: docsrc/locales/*/LC_MESSAGES/docs.po
Languages: fr

source: suspend or reactive workout or comment
fr: suspendre ou réactiver une séance ou un commentaire

source: suspend or reactive user account
fr: suspendre ou réactiver le compte d'un utilisateur

source: mark report as resolved or unresolved
fr: marquer un signalement comme résolu ou non résolu

source: Report on FitTrackee
fr: Signalement sur FitTrackee

source: Report content is visible regardless the visibility level.
fr: Le contenu signalé est visible quelque soit le niveau de visibilité.

source: Users can appeal suspension or warning.
fr: Les utilisateurs peuvent faire appel de la suspension ou de l'avertissement.

source: Suspended user can only access his account, appeal the account suspension, request and data export or delete his account. His sessions and comments are no longer visible.
fr: L'utilisateur suspendu peut uniquement accéder à son compte, faire appel de la suspension du compte, demander l'export de données ou supprimer son compte. Ses séances et commentaires ne sont plus visibles.

source: Only users with administration rights can access equipment types administration.
fr: Seuls les utilisateurs disposant de droits d'administration peuvent accéder l'administration des types d'équipement.

source: Equipment types administration on FitTrackee
fr: Administration du type d'équipement sur FitTrackee

source: It allows to enable or disable an equipment type in order to match disabled sports (a equipment type can be disabled even if equipment with this type exists)
fr: Il est possible d'activer ou désactiver un type d'équipement afin de correspondre aux sports désactivés (un type d'équipement peut être désactivé même si un équipement pour ce type existe).

source: Queued tasks
fr: Tâches en attente

source: Only users with administration rights can view queued tasks for user data export or workouts archive upload.
fr: Seuls les utilisateurs ayant des droits d'administration peuvent accéder aux tâches en attente pour les exports des données utilisateurs ou le chargement des archives de séances.

source: If no workers are running, `CLI <../cli.html>`__ commands allow to process queued tasks.
fr: Si aucun *worker* n'est lancé, une `interface de ligne de commandes <../cli.html>`__ permet de traiter les tâches en attente.

source: Only users with administration rights can access sports administration.
fr: Seuls les utilisateurs ayant des droits d'administration peuvent accéder à l'administration des sports.

source: Sports administration on FitTrackee
fr: Administration des sports sur FitTrackee

source: It allows to enable or disable a sport (a sport can be disabled even if workout with this sport exists).
fr: Il est possible d'activer ou désactiver un sport (un sport peut être désactivé même si une séance avec ce sport existe).

source: added user account activation, email and password update
fr: ajout de l'activation d'un compte utilisateur et de la mise à jour de l'adresse électronique et du mot de passe

source: added moderator and owner roles, updated administrator role
fr: ajout des rôles de modérateur et propriétaire, mise à jour du rôle d'administrateur

source: Only users with administration rights can access users administration.
fr: Seuls les utilisateurs ayant des droits d'administration peuvent accéder à l'administration des utilisateurs.

source: Following roles are available:
fr: Les rôles suivants sont disponibles :

source: user
fr: utilisateur

source: no moderation or administration rights
fr: pas de droits de modération ou d'administration

source: moderator
fr: modérateur

source: can only access moderation entry in administration
fr: peut seulement accéder à l'entrée modération dans l'administration

source: can see reports
fr: peut voir les signalements

source: perform report actions
fr: effectuer des actions liées aux signalements

source: administrator
fr: administrateur

source: has moderator rights
fr: a les droits de modération

source: can access all entries in administration:
fr: peut accéder à toutes les entrées de l'administration :

source: moderation
fr: modération

source: equipment types
fr: types d'équipement

source: users
fr: utilisateurs

source: owner
fr: propriétaire

source: has admin rights
fr: a les droits d'administration

source: role can not be modified by other administrator/owner on application
fr: ce rôle ne peut pas être modifié par un autre administrateur ou propriétaire dans l'application

source: Roles defined prior to version 0.9.0 remain unchanged.
fr: Les rôles définis avant la version 0.9.0 restent inchangés.

source: Users administration displays the list of users, which can be filtered.
fr: L'administration des utilisateurs affiche la liste des utilisateurs, qui peut être filtrée.

source: It is possible to edit a user in order to:
fr: Il est possible de modifier un utilisateur afin de :

source: update role. A user with owner role can not be modified by other users. Owner role can only be assigned or removed with **FitTrackee** CLI.
fr: mettre à jour le rôle. Un utilisateur avec un rôle de propriétaire ne peut pas être modifié par un autre utilisateur. Le rôle de propriétaire ne peut être assigné ou retiré qu'avec la CLI de **FitTrackee**.

source: activate his account
fr: activer son compte

source: update his email (in case his account is locked)
fr: mettre à jour son adresse électronique (au cas où son compte serait bloqué)

source: reset his password (in case his account is locked). If email sending is disabled, it is only possible via `CLI <../cli.html>`__.
fr: réinitialiser son mot de passe (dans le cas où son compte est verrouillé).Si l'envoi des courriels est désactivé, cela n'est possible que via `l'interface de ligne de commande (CLI) <../cli.html>`__.

source: It is also possible to delete a user account.
fr: Il est également possible le compte d'un utilisateur.

source: Dashboard
fr: Tableau de bord

source: the timeline displays visible workouts for the authenticated user.
fr: Le flux d'activités affiche les séances visibles pour l'utilisateur authentifié.

source: A dashboard displays:
fr: Le tableau de bord affiche :

source: user statistics
fr: les statistiques de l'utilisateur

source: a chart with monthly statistics
fr: un graphe avec les statistiques du mois en cours

source: a monthly calendar displaying workouts and record. The week can start on Sunday or Monday (which can be changed in the `user preference <account_and_preferences.html#preferences>`__). The calendar displays up to 100 workouts.
fr: un calendrier mensuel affichant les séances et les records. La semaine peut commencer le dimanche ou le lundi (ce qui peut être modifié dans les `préférences de l'utilisateur <account_and_preferences.html#preferences>`__). Le calendrier affiche jusqu'à 100 séances.

source: user records by sports
fr: les records de l'utilisateur par sport

source: a timeline with the workouts visible to the authenticated user (their own workouts and those of users they follow)
fr: un flux d'activités avec les séances visibles par l'utilisateur authentifié (ses propres séances et celles des utilisateurs suivis)

source: FitTrackee Dashboard
fr: Tableau de bord sur FitTrackee

source: Dashboard on mobile:
fr: Tableau de bord sur mobile :

source: FitTrackee Dashboard on mobile (calendar)
fr: Tableau de bord de FitTrackee sur mobile (calendrier)

source: FitTrackee Dashboard on mobile (statistics)
fr: Tableau de bord de FitTrackee sur mobile (statistiques)

source: FitTrackee Dashboard on mobile (latest workouts)
fr: Tableau de bord de FitTrackee sur mobile (dernières séances)

source: FitTrackee Dashboard on mobile (records)
fr: Tableau de bord de FitTrackee sur mobile (record)

source: Equipment
fr: Équipements

source: added equipment visibility
fr: ajout de la visibilité de l'équipement

source: added Kayaking and Canoeing to Boat
fr: ajout du Kayak et du Canoë au type Bateau

source: sports updated for Bike
fr: sports mis à jour pour le type Vélo

source: added Board
fr: ajout du type Planche

source: added Standup paddleboarding to Board
fr: ajout du Stand up paddle au type Planche

source: added Tennis (Outdoor) to Shoes
fr: ajout du Tennis (Extérieur) au type Chaussures

source: added Padel (Outdoor) to Shoes
fr: ajout du Padel (Extérieur) au type Chaussures

source: added Canoeing (Whitewater) and Kayaking (Whitewater) to Boat
fr: ajout de Canöe en eaux vives et du Kayak en eaux vives au type Bateau

source: Users can create equipment that can be associated with workouts.
fr: Les utilisateurs peut créer des équipements qui peuvent être associés à des séances.

source: FitTrackee Equipment
fr: Équipements sur FitTrackee

source: The following equipment types are available, depending on the sport:
fr: Les types d'équipement suivants sont disponibles, selon le sport :

source: Bike: Cycling (Sport, Transport, Trekking), Halfbike, Mountain Biking and Mountain Biking (Electric),
fr: Vélo : Halfbike, Vélo (Sport, Transport, Trekking), VTT et VTT (Électrique)

source: Bike Trainer: Cycling (Virtual),
fr: Vélo d'entraînement : Vélo (Virtuel),

source: Board: Standup paddleboarding and Windsurfing,
fr: Planche: Planche à voile et Stand up paddle

source: Kayak/Boat: Canoeing, Canoeing (Whitewater), Rowing, Kayaking and Kayaking (Whitewater),
fr: Kayak/Bateau : Aviron, Canöe, Canöe en eaux vives, Kayak et Kayak en eaux vives

source: Shoes: Hiking, Mountaineering, Padel (Outdoor), Running, Tennis (Outdoor), Trail and Walking,
fr: Chaussures : Alpinisme, Course, Marche, Padel (Extérieur), Randonnées, Tennis (Extérieur) et Trail

source: Skis: Skiing (Alpine and Cross Country),
fr: Skis : Ski (Alpin et Randonnée)

source: Snowshoes: Snowshoes.
fr: Raquettes : Raquettes.

source: Users can define equipment visibility:
fr: Les utilisateurs peuvent définir la visibilité de l'équipement :

source: private: only owner can see the equipment in workout detail,
fr: privé: seul le propriétaire peut voir l'équipement dans le détail de la séance,

source: followers only: only owner and followers can see the equipment in workout detail,
fr: abonnés seulement: seul le propriétaire et les abonnés peuvent voir l'équipement dans le détail de la séance,

source: public: anyone can see the equipment in workout detail even unauthenticated users.
fr: public: tout le monde peut voir l'équipement dans le détail de la séance, même les utilisateurs non authentifiés.

source: FitTrackee Equipment Detail
fr: Détail d'un équipement sur FitTrackee

source: The equipment details are only visible to its owner.
fr: Le détail de l'équipement n'est visible que par son propriétaire.

source: For now only, only one piece of equipment can be associated with a workout.
fr: Pour le moment, un seul équipement peut être associé à une séance.

source: Following totals are displayed for each piece of equipment:
fr: Les totaux suivants sont affichés pour chaque équipement :

source: total distance
fr: distance totale

source: total duration
fr: durée totale

source: total workouts
fr: nombre total de séances

source: In case of an incorrect total (although this should not happen), it is possible to recalculate totals.
fr: En cas de total incorrect (bien que cela ne doive pas se produire), il est possible de recalculer les totaux.

source: It is possible to define default equipment for sports: when adding a workout, the equipment will automatically be displayed in the dropdown list depending on selected sport.
fr: Il est possible de définir un équipement par défaut pour les sports : à l'ajout de la séance, l'équipement sera automatiquement affiché dans la liste déroulante selon le sport sélectionné.

source: An equipment can be edited (label, equipment type, description, visibility, active status and default sports).
fr: Un équipement peut être modifié (label, type d'équipement, description, visibilité, status actif et sports par défaut).

source: Deactivated equipment will not appear in dropdown when **a workout is added**. It remains displayed in the details of the workout, to which it was associated before being deactivated.
fr: Un équipement désactivé n'apparait plus dans la liste déroulante lors de l'ajout d'une séance. Il reste affiché dans le détail de la séance, à laquelle il a été associé avant sa désactivation.

source: An equipment type can be deactivated by an administrator.
fr: Un type d'équipement peut être désactivé par un administrateur.

source: Global map
fr: Carte Globale

source: User workouts can be displayed on a global map and filtered by date and sports.
fr: Les séances peuvent être affichées sur une carte globale et filtrées selon la date et les sports.

source: FitTrackee Global Map
fr: Carte globale sur FitTrackee

source: If the number of workouts exceeds 3,000, a modal appears to confirm the display. This message can be hidden (this can be changed in the `user preferences <account_and_preferences.html#preferences>`__).
fr: Si le nombre de séances dépasse les 3000, une modale apparait pour valider l'affichage. Ce message peut être masqué (cela peut être modifié dans la `préférences utilisateur <account_and_preferences.html#preferences>`__)

source: Depending on the browser and device used, displaying a large number of workouts may cause browser slowness or errors.
fr: Selon le navigateur et l'appareil utilisés, l'affichage d'un grand nombre des séances peut entraîner des ralentissements du navigateur ou des erreurs.

source: **FitTrackee** allows you to upload tracks from your outdoor activities and display some statistics.
fr: **FitTrackee** vous permet de stocker les tracés de vos activités sportives en **plein air** et d'afficher quelques statistiques.

source: Workouts can be filtered and displayed on a map.
fr: Des séances peuvent être filtrées et affichées sur la carte.

source: Equipments can be associated with workouts.
fr: Des équipements peuvent être associés aux séances.

source: If registration is enabled, multiple users can register and interact with other users (comments, likes). Workouts and comments are visible to other users according to visibility levels.
fr: Si l'inscription est activée, plusieurs utilisateurs peuvent s'inscrire et interagir avec les autres utilisateurs (commentaires, "likes"). Les séances et commentaires sont visibles selon le niveau de visibilité configuré.

source: Files are stored in an upload directory (**without encryption**).
fr: Les fichier sont stockés dans un répertoire du serveur (**sans aucun chiffrement**).

source: With the default configuration, `Open Street Map <https://www.openstreetmap.org>`__ is used as tile server in Workout detail and for static map generation.
fr: Avec la configuration par défaut, `Open Street Map <https://www.openstreetmap.org>`__ est utilisé comme serveur de tuile sur la page de détail de la séance et pour la génération des images statiques des traces.

source: Users directory
fr: Répertoire des utilisateurs

source: Users can configure visibility in directory in the `user preferences <account_and_preferences.html#preferences>`__ (hidden profile by default).
fr: Les utilisateurs peuvent configurer sa visibilité dans le répertoire au niveau des `préférences utilisateur <account_and_preferences.html#preferences>`__ (profil masqué par défaut).

source: This affects username completion when writing comments (only profiles visible in users directory or followed users are suggested).
fr: Cela impacte également la complétion des noms d'utilisateurs lors de la rédaction d'un commentaire (seuls les utilisateurs visibles dans le répertoire et les utilisateurs suivis sont proposés).

source: Users Directory on FitTrackee
fr: Répertoire des utilisateurs sur FitTrackee

source: A user profile remains accessible via its URL.
fr: Le profil d'un utilisateur reste accessible via son URL.

source: User profile
fr: Profil de l'utilisateur

source: display of the last 5 sessions visible in the user profile
fr: affichage des 5 dernières séances visibles dans le profil utilisateur

source: added RSS Feed
fr: ajout du flux RSS

source: description added to the RSS Feed
fr: ajout de la description dans le flux

source: The user profile displays the last 5 visible workouts.
fr: Le profil de l'utilisateur affiche les 5 dernières séances visibles.

source: The language and imperial units are taken into account according to the user's preferences if logged in.
fr: La langue et les unités impériales sont prises en compte en fonction des préférences de l'utilisateur si celui-ci est connecté.

source: User profile on FitTrackee
fr: Profile de l'utilisateur sur FitTrackee

source: On the screenshot only 4 workouts are visible to the authenticated user.
fr: Sur la capture d'écran, seules les 4 dernières séances sont visibles par l'utilisateur authentifié.

source: A RSS feed is available in the user profile with the 5 last public workouts (displayed by default in English and using the metric system).
fr: Un flux RSS est disponible dans le profil de l'utilisateur avec les 5 dernières séances publiques (affiché par défault en anglais et le système métrique)

source: It's possible to specify language and/or imperial units display, for instance:
fr: Il est possible de spécifier la langue et/ou l'affichage en unités impériales, par exemple :

source: The rendering of the description may differ from that on FitTrackee, as different libraries are used and additional styles are applied on the UI.
fr: Le rendu de la description peut être différent de celui affiché sur FitTrackee, car les librairies utilisées sont différentes et des styles additionnels sont appliqués sur l'interface.

source: No workouts are displayed when the user is suspended.
fr: Aucune séance n'est affichée si l'utilisateur est suspendu.

source: Workout description can be displayed by adding ``description`` parameter (not displayed by default):
fr: La description de la séance peut être affichée en ajoutant le paramètre ``description`` (non affichée par défaut) :

source: The RSS feed is not autodiscoverable due to application architecture (client-side rendering).
fr: Le flux RSS ne peut pas découvert automatiquement du fait de l'architecture de l'application (rendu côté client).

source: The users can send follow request to other users.
fr: Les utilisateurs peuvent envoyer des demandes de suivi à d'autres utilisateurs.

source: Follow request can be approved or rejected.
fr: Une demande de suivi peut être acceptée ou rejetée.

source: Follow request approval can be manual or automatic (manual by default, see `user preferences <account_and_preferences.html#preferences>`__).
fr: L'approbation d'une demande de suivi peut être manuelle ou automatique (manuelle par défaut, cf. `préférences utilisateur <account_and_preferences.html#preferences>`__).

source: In order to hide unwanted content, users can block another user.
fr: Afin de masquer du contenu indésirable, les utilisateurs peuvent bloquer un autre utilisateur.

source: Blocking users hides their workouts on timeline and comments. Notifications from blocked users are not displayed.
fr: Le blocage des utilisateurs masque leurs séances sur le flux d'activités et les commentaires. Les notifications des utilisateurs bloqués ne s'affichent pas.

source: Blocked users cannot see workouts and comments from users who have blocked them, or follow them (if they followed them, they are forced to unfollow them).
fr: Les utilisateurs bloqués ne peuvent pas voir les séances et les commentaires des utilisateurs qui les ont bloqués, ni les suivre (s'ils les suivaient, les abonnements sont automatiquement supprimés).

source: Users can report a user profile that violates instance rules. This will send a notification to moderators and administrators.
fr: Les utilisateurs peuvent signaler un profil qui enfreint les règles de l'instance. Une notification sera envoyée aux modérateurs et administrateurs.

source: Depending on visibility, an authenticated user can comment on a workout.
fr: Selon la visibilité, un utilisateur authentifié peut commenter une séance.

source: A limited Markdown syntax can be used.
fr: Une syntaxe Markdown limitée peut être utilisée.

source: The visibility levels for comment are:
fr: Les niveaux de visibilité pour les commentaires sont :

source: private: only author and mentioned users can see the comment,
fr: privé: seul l'auteur et les utilisateurs mentionnés peuvent voir le commentaire,

source: followers only: only author, followers and mentioned users can see the comment,
fr: abonnés seulement: seul l'auteur, les utilisateurs mentionnés et les abonnés peuvent voir le commentaire,

source: public: anyone can see the comment even unauthenticated users.
fr: public: tout le monde peut voir le commentaire, même les utilisateurs non authentifiés.

source: Please keep in mind that the server operating team or the moderation team may view content with restricted visibility.
fr: Veuillez garder à l'esprit que l'équipe d'exploitation du serveur ou l'équipe de modération peuvent visualiser les contenus à visibilité restreinte.

source: Changing workout visibility will not affect visibility of existing comments.
fr: Changer la visibilité de la séance n'affectera pas celle des commentaires existants.

source: Comment text can be modified (visibility level cannot be changed).
fr: Le texte du commentaire peut être modifié (le niveau de visibilité ne peut pas être modifié).

source: Users can report a comment that violates instance rules. This will send a notification to moderators and administrators.
fr: Les utilisateurs peuvent signaler un commentaire qui enfreint les règles de l'instance. Une notification sera envoyée aux modérateurs et administrateurs.

source: Depending on visibility, users can like or "unlike" a workout or a comment.
fr: Selon la visibilité de l'instance, les utilisateurs peuvent ajouter ou supprimer "like" sur une séance ou un commentaire.

source: The list of users who have liked the workout or comment is available.
fr: La liste des utilisateurs ayant "liké" la séance ou le commentaire est disponible.

source: Notifications are created for the following event:
fr: Des notifications sont créées pour les évènements suivants :

source: follow request and follow
fr: demande de suivi et suivi

source: follow request approval when follow request approval is manual
fr: demande d'abonnement acceptée si l'approbation des demandes est manuelle

source: like on comment or workout
fr: "like" sur un commentaire ou une séance

source: comment on workout
fr: commentaire sur une séance

source: mention on comment
fr: mention dans un commentaire

source: suspension or warning (an email is also sent if email sending is enabled)
fr: suspension ou avertissement (un courriel est également envoyé si l'envoi des courriels est activé).

source: suspension or warning lifting (an email is also sent if email sending is enabled)
fr: levée de suspension ou d'avertissement (un courriel est également envoyé si l'envoi des courriels est activé).

source: FitTrackee Notifications
fr: Notifications sur FitTrackee

source: Users with moderation rights can also receive notifications on:
fr: Les utilisateurs avec des droits de modération peuvent également recevoir des notifications pour :

source: report creation
fr: la création de signalements

source: appeal on suspension or warning
fr: les appels sur des suspensions

source: Users with administration rights can also receive notifications on user creation.
fr: Les utilisateurs avec des droits d'administration peuvent également recevoir des notifications lors de l'inscription d'un utilisateur.

source: Users can mark notifications as read or unread.
fr: Les utilisateurs peuvent marquer les notifications comme lues ou non lues.
